#if 0
;
; Note: shader requires additional functionality:
;       Double-precision floating point
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 824dd64c5771fd565c96391376d63517.pdb
; shader hash: 824dd64c5771fd565c96391376d63517
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.RayGenConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           int doCheckerboardRayGeneration;          ; Offset:    8
;           int checkerboardGenerateRaysForEvenPixels;; Offset:   12
;           uint seed;                                ; Offset:   16
;           uint numSamplesPerSet;                    ; Offset:   20
;           uint numSampleSets;                       ; Offset:   24
;           uint numPixelsPerDimPerSet;               ; Offset:   28
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for g_sampleSets
; {
;
;   struct struct.AlignedHemisphereSample3D
;   {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !17, globals: !92)
!1 = !DIFile(filename: "RTAO\5CShaders\5CAORayGenCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 48, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 48, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 42, baseType: !16)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !{!18, !29, !37, !38, !41, !44, !53, !57, !60, !65, !70, !73, !76, !79, !80, !83, !86, !89}
!18 = !DISubprogram(name: "main", scope: !1, file: !1, line: 36, type: !19, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21, !21}
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !23, templateParams: !26)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, baseType: !16, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, baseType: !16, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !{!27, !28}
!27 = !DITemplateTypeParameter(name: "element", type: !16)
!28 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!29 = !DISubprogram(name: "DecodeNormalDepth", linkageName: "\01?DecodeNormalDepth@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !30, file: !30, line: 438, type: !31, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false)
!30 = !DIFile(filename: "RTAO\5CShaders/RaytracingShaderHelper.hlsli", directory: "")
!31 = !DISubroutineType(types: !32)
!32 = !{null, !15, !33, !35}
!33 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4)
!35 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!37 = !DISubprogram(name: "DecodeNormalDepth_N16D16", linkageName: "\01?DecodeNormalDepth_N16D16@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !30, file: !30, line: 426, type: !31, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DISubprogram(name: "Unpack_R8G8B16_FLOAT", linkageName: "\01?Unpack_R8G8B16_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !30, file: !30, line: 393, type: !39, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!4, !15}
!41 = !DISubprogram(name: "Unpack_R8_FLOAT", linkageName: "\01?Unpack_R8_FLOAT@@YAMI@Z", scope: !30, file: !30, line: 364, type: !42, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!8, !15}
!44 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !30, file: !30, line: 344, type: !45, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!4, !47}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 367, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 367, size: 64, align: 32, elements: !49, templateParams: !52)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !1, line: 367, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !1, line: 367, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !{!12, !28}
!53 = !DISubprogram(name: "GetRandomRayDirection", linkageName: "\01?GetRandomRayDirection@@YA?AV?$vector@M$02@@V?$vector@I$01@@V1@0I@Z", scope: !54, file: !54, line: 16, type: !55, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!54 = !DIFile(filename: "RTAO\5CShaders/RayGen.hlsli", directory: "")
!55 = !DISubroutineType(types: !56)
!56 = !{!4, !21, !4, !21, !15}
!57 = !DISubprogram(name: "hash", linkageName: "\01?hash@@YAMV?$vector@M$02@@@Z", scope: !30, file: !30, line: 462, type: !58, isLocal: false, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!8, !4}
!60 = !DISubprogram(name: "SeedThread", linkageName: "\01?SeedThread@RNG@@YAII@Z", scope: !62, file: !61, line: 19, type: !63, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DIFile(filename: "RTAO\5CShaders/RandomNumberGenerator.hlsli", directory: "")
!62 = !DINamespace(name: "RNG", scope: null, file: !61, line: 16)
!63 = !DISubroutineType(types: !64)
!64 = !{!15, !15}
!65 = !DISubprogram(name: "Random", linkageName: "\01?Random@RNG@@YAIAIAIII@Z", scope: !62, file: !61, line: 55, type: !66, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!15, !68, !15, !15}
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !15)
!70 = !DISubprogram(name: "Random01", linkageName: "\01?Random01@RNG@@YAMAIAI@Z", scope: !62, file: !61, line: 42, type: !71, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!8, !68}
!73 = !DISubprogram(name: "Random", linkageName: "\01?Random@RNG@@YAIAIAI@Z", scope: !62, file: !61, line: 32, type: !74, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!15, !68}
!76 = !DISubprogram(name: "EncodeNormalDepth", linkageName: "\01?EncodeNormalDepth@@YAIV?$vector@M$02@@M@Z", scope: !30, file: !30, line: 433, type: !77, isLocal: false, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{!15, !4, !8}
!79 = !DISubprogram(name: "EncodeNormalDepth_N16D16", linkageName: "\01?EncodeNormalDepth_N16D16@@YAIV?$vector@M$02@@M@Z", scope: !30, file: !30, line: 418, type: !77, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubprogram(name: "EncodeNormal", linkageName: "\01?EncodeNormal@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !30, file: !30, line: 336, type: !81, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!47, !4}
!83 = !DISubprogram(name: "OctWrap", linkageName: "\01?OctWrap@@YA?AV?$vector@M$01@@V1@@Z", scope: !30, file: !30, line: 330, type: !84, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!47, !47}
!86 = !DISubprogram(name: "Pack_R8G8B16_FLOAT", linkageName: "\01?Pack_R8G8B16_FLOAT@@YAIV?$vector@M$02@@@Z", scope: !30, file: !30, line: 385, type: !87, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!15, !4}
!89 = !DISubprogram(name: "Pack_R8_FLOAT", linkageName: "\01?Pack_R8_FLOAT@@YAIM@Z", scope: !30, file: !30, line: 359, type: !90, isLocal: false, isDefinition: true, scopeLine: 360, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{!15, !8}
!92 = !{!93, !99, !104, !105, !107, !109, !114, !115, !117, !129, !133, !134, !137, !141, !143, !158, !167, !169, !171, !173}
!93 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !94, file: !95, line: 506, type: !96, isLocal: true, isDefinition: true)
!94 = !DINamespace(name: "TraceRayParameters", scope: null, file: !95, line: 504)
!95 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !98, line: 20, baseType: !15)
!98 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!99 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !100, file: !95, line: 508, type: !101, isLocal: true, isDefinition: true)
!100 = !DINamespace(name: "HitGroup", scope: !94, file: !95, line: 507)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, align: 32, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 2)
!104 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !100, file: !95, line: 513, type: !96, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !106, file: !95, line: 516, type: !101, isLocal: true, isDefinition: true)
!106 = !DINamespace(name: "MissShader", scope: !94, file: !95, line: 515)
!107 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !108, file: !95, line: 526, type: !96, isLocal: true, isDefinition: true)
!108 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !95, line: 524)
!109 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !110, file: !95, line: 528, type: !111, isLocal: true, isDefinition: true)
!110 = !DINamespace(name: "HitGroup", scope: !108, file: !95, line: 527)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, align: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !110, file: !95, line: 534, type: !96, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !116, file: !95, line: 537, type: !111, isLocal: true, isDefinition: true)
!116 = !DINamespace(name: "MissShader", scope: !108, file: !95, line: 536)
!117 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !95, line: 544, type: !118, isLocal: true, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !98, line: 17, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 544, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 544, size: 128, align: 32, elements: !122, templateParams: !127)
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !121, file: !1, line: 544, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !121, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !121, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !121, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!127 = !{!12, !128}
!128 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!129 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !130, file: !131, line: 15, type: !132, isLocal: true, isDefinition: true)
!130 = !DINamespace(name: "RTAO", scope: null, file: !131, line: 14)
!131 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!133 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !130, file: !131, line: 16, type: !132, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariable(name: "g_texRayOriginSurfaceNormalDepth", linkageName: "\01?g_texRayOriginSurfaceNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 24, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<unsigned int>", file: !1, line: 24, size: 64, align: 32, elements: !2, templateParams: !136)
!136 = !{!27}
!137 = !DIGlobalVariable(name: "g_texRayOriginPosition", linkageName: "\01?g_texRayOriginPosition@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 25, type: !138, isLocal: false, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 25, size: 160, align: 32, elements: !2, templateParams: !139)
!139 = !{!140}
!140 = !DITemplateTypeParameter(name: "element", type: !121)
!141 = !DIGlobalVariable(name: "g_rtRaysDirectionOriginDepth", linkageName: "\01?g_rtRaysDirectionOriginDepth@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 27, type: !142, isLocal: false, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 27, size: 32, align: 32, elements: !2, templateParams: !136)
!143 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@URayGenConstantBuffer@@@@A", scope: !0, file: !1, line: 29, type: !144, isLocal: false, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<RayGenConstantBuffer>", file: !1, line: 29, size: 32, align: 32, elements: !2, templateParams: !145)
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "T", type: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayGenConstantBuffer", file: !95, line: 162, size: 256, align: 32, elements: !148)
!148 = !{!149, !151, !153, !154, !155, !156, !157}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !147, file: !95, line: 164, baseType: !150, size: 64, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !98, line: 21, baseType: !21)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "doCheckerboardRayGeneration", scope: !147, file: !95, line: 165, baseType: !152, size: 32, align: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !98, line: 24, baseType: !14)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "checkerboardGenerateRaysForEvenPixels", scope: !147, file: !95, line: 166, baseType: !152, size: 32, align: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !147, file: !95, line: 168, baseType: !97, size: 32, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "numSamplesPerSet", scope: !147, file: !95, line: 169, baseType: !97, size: 32, align: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "numSampleSets", scope: !147, file: !95, line: 170, baseType: !97, size: 32, align: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "numPixelsPerDimPerSet", scope: !147, file: !95, line: 171, baseType: !97, size: 32, align: 32, offset: 224)
!158 = !DIGlobalVariable(name: "g_sampleSets", linkageName: "\01?g_sampleSets@@3V?$StructuredBuffer@UAlignedHemisphereSample3D@@@@A", scope: !0, file: !1, line: 30, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AlignedHemisphereSample3D>", file: !1, line: 30, size: 128, align: 32, elements: !2, templateParams: !160)
!160 = !{!161}
!161 = !DITemplateTypeParameter(name: "element", type: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AlignedHemisphereSample3D", file: !95, line: 467, size: 128, align: 32, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !162, file: !95, line: 469, baseType: !165, size: 96, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !98, line: 16, baseType: !4)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !162, file: !95, line: 470, baseType: !97, size: 32, align: 32, offset: 96)
!167 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !95, line: 544, type: !168, isLocal: false, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !118, size: 32, align: 4, offset: 96)
!169 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !95, line: 544, type: !170, isLocal: false, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !118, size: 32, align: 4, offset: 64)
!171 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !95, line: 544, type: !172, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !118, size: 32, align: 4)
!173 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !95, line: 544, type: !174, isLocal: false, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !118, size: 32, align: 4, offset: 32)
!175 = !{i32 2, !"Dwarf Version", i32 4}
!176 = !{i32 2, !"Debug Info Version", i32 3}
!177 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!178 = !{!"RTAO\5CShaders\5CAORayGenCS.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A// Desc: Generates AO rays for each pixel and stores them in a texture.\0D\0A// Supports 1 rays per pixel (spp) and 0.5 spp (via checkerboard distribution).\0D\0A// 0.5 spp:\0D\0A//  - generates 1 spp for every other pixel in a checkerboard distribution.\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A#include \22RaytracingShaderHelper.hlsli\22\0D\0A#include \22RandomNumberGenerator.hlsli\22\0D\0A#include \22Ray sorting/RaySorting.hlsli\22\0D\0A#include \22RTAO.hlsli\22\0D\0A\0D\0ATexture2D<NormalDepthTexFormat> g_texRayOriginSurfaceNormalDepth : register(t0);\0D\0ATexture2D<float4> g_texRayOriginPosition : register(t1);\0D\0A\0D\0ARWTexture2D<NormalDepthTexFormat> g_rtRaysDirectionOriginDepth : register(u0);\0D\0A\0D\0AConstantBuffer<RayGenConstantBuffer> cb: register(b0);\0D\0AStructuredBuffer<AlignedHemisphereSample3D> g_sampleSets : register(t3);\0D\0A\0D\0A// Delay the include so that resource references resolve.\0D\0A#include \22RayGen.hlsli\22\0D\0A\0D\0A[numthreads(DefaultComputeShaderParams::ThreadGroup::Width, DefaultComputeShaderParams::ThreadGroup::Height, 1)]\0D\0Avoid main(uint2 DTid : SV_DispatchThreadID, uint2 GTid : SV_GroupThreadID)\0D\0A{\0D\0A    uint2 DTidFullRes = DTid;\0D\0A\0D\0A    if (cb.doCheckerboardRayGeneration)\0D\0A    {\0D\0A        UINT pixelStepX = 2;\0D\0A        bool isEvenPixelY = (DTid.y & 1) == 0;\0D\0A        UINT pixelOffsetX = isEvenPixelY != cb.checkerboardGenerateRaysForEvenPixels;\0D\0A        DTidFullRes.x = DTid.x * pixelStepX + pixelOffsetX;\0D\0A    }\0D\0A\0D\0A    float3 surfaceNormal;\0D\0A    float rayOriginDepth;\0D\0A    DecodeNormalDepth(g_texRayOriginSurfaceNormalDepth[DTidFullRes], surfaceNormal, rayOriginDepth);\0D\0A\0D\0A    float3 rayDirection = 0;\0D\0A    if (rayOriginDepth != INVALID_RAY_ORIGIN_DEPTH)\0D\0A    {\0D\0A        rayDirection = GetRandomRayDirection(DTid, surfaceNormal, cb.textureDim, 0);\0D\0A    }\0D\0A\0D\0A    g_rtRaysDirectionOriginDepth[DTid] = EncodeNormalDepth(rayDirection, rayOriginDepth);\0D\0A}\0D\0A"}
!179 = !{!".\5CSampleCore\5Cshaders\5CHlslCompat.hlsli", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float2 XMFLOAT2;\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0Atypedef uint2 XMUINT2;\0D\0Atypedef uint3 XMUINT3;\0D\0Atypedef int2 XMINT2;\0D\0Atypedef int BOOL;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
