#if 0
;
; Note: shader requires additional functionality:
;       Wave level operations
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 996e73a53d7a405a020f149c8f962061.pdb
; shader hash: 996e73a53d7a405a020f149c8f962061
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.CalculateMeanVarianceConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           uint kernelWidth;                         ; Offset:    8
;           uint kernelRadius;                        ; Offset:   12
;           int doCheckerboardSampling;               ; Offset:   16
;           int areEvenPixelsActive;                  ; Offset:   20
;           uint pixelStepY;                          ; Offset:   24
;           float padding;                            ; Offset:   28
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    32
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !29, globals: !54)
!1 = !DIFile(filename: "RTAO\5CShaders\5CDenoising\5CCalculateMeanVarianceCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !14, !21, !25}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 40, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 40, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 40, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 64, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 64, size: 64, align: 32, elements: !16, templateParams: !19)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 64, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 64, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !13)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 142, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !23, templateParams: !27)
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 31, baseType: !25, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 31, baseType: !25, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !{!28, !12}
!28 = !DITemplateTypeParameter(name: "element", type: !25)
!29 = !{!30, !34, !37, !40, !45, !48, !51}
!30 = !DISubprogram(name: "main", scope: !1, file: !1, line: 192, type: !31, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !4, !4, !33, !4}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 39, baseType: !8)
!34 = !DISubprogram(name: "FilterHorizontally", linkageName: "\01?FilterHorizontally@@YAXV?$vector@I$01@@I@Z", scope: !1, file: !1, line: 55, type: !35, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !4, !33}
!37 = !DISubprogram(name: "GetActivePixelIndex", linkageName: "\01?GetActivePixelIndex@@YA?AV?$vector@H$01@@V1@@Z", scope: !1, file: !1, line: 45, type: !38, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DISubroutineType(types: !39)
!39 = !{!14, !14}
!40 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@H$01@@0@Z", scope: !41, file: !41, line: 62, type: !42, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !14, !14}
!44 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!45 = !DISubprogram(name: "Float2ToHalf", linkageName: "\01?Float2ToHalf@@YAIV?$vector@M$01@@@Z", scope: !41, file: !41, line: 36, type: !46, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!33, !21}
!48 = !DISubprogram(name: "FilterVertically", linkageName: "\01?FilterVertically@@YAXV?$vector@I$01@@0@Z", scope: !1, file: !1, line: 149, type: !49, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !4, !4}
!51 = !DISubprogram(name: "HalfToFloat2", linkageName: "\01?HalfToFloat2@@YA?AV?$vector@M$01@@I@Z", scope: !41, file: !41, line: 44, type: !52, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!21, !33}
!54 = !{!55, !61, !66, !67, !69, !71, !76, !77, !79, !91, !95, !96, !99, !103, !107, !108, !123, !125, !127, !129, !131, !133, !135, !137, !139, !144}
!55 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !56, file: !57, line: 506, type: !58, isLocal: true, isDefinition: true)
!56 = !DINamespace(name: "TraceRayParameters", scope: null, file: !57, line: 504)
!57 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !60, line: 20, baseType: !33)
!60 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!61 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !62, file: !57, line: 508, type: !63, isLocal: true, isDefinition: true)
!62 = !DINamespace(name: "HitGroup", scope: !56, file: !57, line: 507)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64, align: 32, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 2)
!66 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !62, file: !57, line: 513, type: !58, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !68, file: !57, line: 516, type: !63, isLocal: true, isDefinition: true)
!68 = !DINamespace(name: "MissShader", scope: !56, file: !57, line: 515)
!69 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !70, file: !57, line: 526, type: !58, isLocal: true, isDefinition: true)
!70 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !57, line: 524)
!71 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !72, file: !57, line: 528, type: !73, isLocal: true, isDefinition: true)
!72 = !DINamespace(name: "HitGroup", scope: !70, file: !57, line: 527)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, align: 32, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !72, file: !57, line: 534, type: !58, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !78, file: !57, line: 537, type: !73, isLocal: true, isDefinition: true)
!78 = !DINamespace(name: "MissShader", scope: !70, file: !57, line: 536)
!79 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !57, line: 544, type: !80, isLocal: true, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !60, line: 17, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 544, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 544, size: 128, align: 32, elements: !84, templateParams: !89)
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !83, file: !1, line: 544, baseType: !25, size: 32, align: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !83, file: !1, line: 544, baseType: !25, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !83, file: !1, line: 544, baseType: !25, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !83, file: !1, line: 544, baseType: !25, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!89 = !{!28, !90}
!90 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!91 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !92, file: !93, line: 15, type: !94, isLocal: true, isDefinition: true)
!92 = !DINamespace(name: "RTAO", scope: null, file: !93, line: 14)
!93 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!95 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !92, file: !93, line: 16, type: !94, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariable(name: "g_inValue", linkageName: "\01?g_inValue@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 30, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 30, size: 64, align: 32, elements: !2, templateParams: !98)
!98 = !{!28}
!99 = !DIGlobalVariable(name: "g_outMeanVariance", linkageName: "\01?g_outMeanVariance@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 31, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 31, size: 64, align: 32, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "element", type: !22)
!103 = !DIGlobalVariable(name: "g_outDebug1", linkageName: "\01?g_outDebug1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 33, type: !104, isLocal: false, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 33, size: 128, align: 32, elements: !2, templateParams: !105)
!105 = !{!106}
!106 = !DITemplateTypeParameter(name: "element", type: !83)
!107 = !DIGlobalVariable(name: "g_outDebug2", linkageName: "\01?g_outDebug2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 34, type: !104, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UCalculateMeanVarianceConstantBuffer@@@@A", scope: !0, file: !1, line: 36, type: !109, isLocal: false, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CalculateMeanVarianceConstantBuffer>", file: !1, line: 36, size: 32, align: 32, elements: !2, templateParams: !110)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "T", type: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "CalculateMeanVarianceConstantBuffer", file: !57, line: 150, size: 256, align: 32, elements: !113)
!113 = !{!114, !116, !117, !118, !120, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !112, file: !57, line: 152, baseType: !115, size: 64, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !60, line: 21, baseType: !4)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "kernelWidth", scope: !112, file: !57, line: 153, baseType: !59, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "kernelRadius", scope: !112, file: !57, line: 154, baseType: !59, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "doCheckerboardSampling", scope: !112, file: !57, line: 156, baseType: !119, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !60, line: 24, baseType: !13)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "areEvenPixelsActive", scope: !112, file: !57, line: 157, baseType: !119, size: 32, align: 32, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pixelStepY", scope: !112, file: !57, line: 158, baseType: !59, size: 32, align: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !112, file: !57, line: 159, baseType: !25, size: 32, align: 32, offset: 224)
!123 = !DIGlobalVariable(name: "GroupDim", scope: !34, file: !1, line: 57, type: !124, isLocal: true, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!125 = !DIGlobalVariable(name: "NumRowsToLoadPerThread", scope: !34, file: !1, line: 65, type: !126, isLocal: true, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!127 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !57, line: 544, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !80, size: 32, align: 4, offset: 32)
!129 = !DIGlobalVariable(name: "GroupDim.1", linkageName: "\01?GroupDim@?1??FilterHorizontally@@YAXV?$vector@I$01@@I@Z@3V2@B.1", scope: !34, file: !1, line: 57, type: !130, isLocal: false, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !124, size: 32, align: 4, offset: 32)
!131 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !57, line: 544, type: !132, isLocal: false, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !80, size: 32, align: 4, offset: 64)
!133 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !57, line: 544, type: !134, isLocal: false, isDefinition: true)
!134 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !80, size: 32, align: 4)
!135 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !57, line: 544, type: !136, isLocal: false, isDefinition: true)
!136 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !80, size: 32, align: 4, offset: 96)
!137 = !DIGlobalVariable(name: "GroupDim.0", linkageName: "\01?GroupDim@?1??FilterHorizontally@@YAXV?$vector@I$01@@I@Z@3V2@B.0", scope: !34, file: !1, line: 57, type: !138, isLocal: false, isDefinition: true)
!138 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !124, size: 32, align: 4)
!139 = !DIGlobalVariable(name: "PackedRowResultCache", linkageName: "\01?PackedRowResultCache@@3PAY07$$CAIA.1dim", scope: !0, file: !1, line: 39, type: !140, isLocal: false, isDefinition: true, variable: [128 x i32] addrspace(3)* @"\01?PackedRowResultCache@@3PAY07$$CAIA.1dim")
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 4096, align: 32, elements: !141)
!141 = !{!142, !143}
!142 = !DISubrange(count: 16)
!143 = !DISubrange(count: 8)
!144 = !DIGlobalVariable(name: "NumValuesCache", linkageName: "\01?NumValuesCache@@3PAY07$$CAIA.1dim", scope: !0, file: !1, line: 40, type: !140, isLocal: false, isDefinition: true, variable: [128 x i32] addrspace(3)* @"\01?NumValuesCache@@3PAY07$$CAIA.1dim")
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
