#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 3de7081ca9a03b051a3ec5820f5ea48b.pdb
; shader hash: 3de7081ca9a03b051a3ec5820f5ea48b
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.CalculatePartialDerivativesConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           float padding[2];                         ; Offset:   16
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; cb                                cbuffer      NA          NA     CB0            cb0     1
; g_inValue                         texture     f32          2d      T0             t0     1
; g_outValue                            UAV     f32          2d      U0             u0     1
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22, globals: !31)
!1 = !DIFile(filename: "SampleCore\5CShaders\5Cutil\5CCalculatePartialDerivativesViaCentralDifferencesCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 37, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 37, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 37, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 37, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !{!23, !26}
!23 = !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !24, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !4}
!26 = !DISubprogram(name: "GetIndexOfValueClosestToTheReference", linkageName: "\01?GetIndexOfValueClosestToTheReference@@YAIMV?$vector@M$01@@@Z", scope: !27, file: !27, line: 660, type: !28, isLocal: false, isDefinition: true, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: false)
!27 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !18, !14}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 506, baseType: !8)
!31 = !{!32, !38, !43, !44, !46, !48, !53, !54, !56, !68, !72, !73, !76, !80, !90, !92, !94, !96}
!32 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !33, file: !34, line: 506, type: !35, isLocal: true, isDefinition: true)
!33 = !DINamespace(name: "TraceRayParameters", scope: null, file: !34, line: 504)
!34 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !37, line: 20, baseType: !30)
!37 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!38 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !39, file: !34, line: 508, type: !40, isLocal: true, isDefinition: true)
!39 = !DINamespace(name: "HitGroup", scope: !33, file: !34, line: 507)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, align: 32, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 2)
!43 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !39, file: !34, line: 513, type: !35, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !45, file: !34, line: 516, type: !40, isLocal: true, isDefinition: true)
!45 = !DINamespace(name: "MissShader", scope: !33, file: !34, line: 515)
!46 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !47, file: !34, line: 526, type: !35, isLocal: true, isDefinition: true)
!47 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !34, line: 524)
!48 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !49, file: !34, line: 528, type: !50, isLocal: true, isDefinition: true)
!49 = !DINamespace(name: "HitGroup", scope: !47, file: !34, line: 527)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, align: 32, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !49, file: !34, line: 534, type: !35, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !55, file: !34, line: 537, type: !50, isLocal: true, isDefinition: true)
!55 = !DINamespace(name: "MissShader", scope: !47, file: !34, line: 536)
!56 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !34, line: 544, type: !57, isLocal: true, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !37, line: 17, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 544, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 544, size: 128, align: 32, elements: !61, templateParams: !66)
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !60, file: !1, line: 544, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !60, file: !1, line: 544, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !60, file: !1, line: 544, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !60, file: !1, line: 544, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!66 = !{!21, !67}
!67 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!68 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !69, file: !70, line: 15, type: !71, isLocal: true, isDefinition: true)
!69 = !DINamespace(name: "RTAO", scope: null, file: !70, line: 14)
!70 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!72 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !69, file: !70, line: 16, type: !71, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariable(name: "g_inValue", linkageName: "\01?g_inValue@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 17, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 17, size: 64, align: 32, elements: !2, templateParams: !75)
!75 = !{!21}
!76 = !DIGlobalVariable(name: "g_outValue", linkageName: "\01?g_outValue@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 18, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 18, size: 64, align: 32, elements: !2, templateParams: !78)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "element", type: !15)
!80 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UCalculatePartialDerivativesConstantBuffer@@@@A", scope: !0, file: !1, line: 20, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CalculatePartialDerivativesConstantBuffer>", file: !1, line: 20, size: 32, align: 32, elements: !2, templateParams: !82)
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "T", type: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "CalculatePartialDerivativesConstantBuffer", file: !34, line: 383, size: 128, align: 32, elements: !85)
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !84, file: !34, line: 385, baseType: !87, size: 64, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !37, line: 21, baseType: !4)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !84, file: !34, line: 386, baseType: !89, size: 64, align: 32, offset: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, align: 32, elements: !41)
!90 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !34, line: 544, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !57, size: 32, align: 4, offset: 96)
!92 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !34, line: 544, type: !93, isLocal: false, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !57, size: 32, align: 4, offset: 64)
!94 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !34, line: 544, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !57, size: 32, align: 4, offset: 32)
!96 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !34, line: 544, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !57, size: 32, align: 4)
!98 = !{i32 2, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!101 = !{!"SampleCore\5CShaders\5Cutil\5CCalculatePartialDerivativesViaCentralDifferencesCS.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#define HLSL\0D\0A\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A#include \22RaytracingShaderHelper.hlsli\22\0D\0A\0D\0ATexture2D<float> g_inValue : register(t0);\0D\0ARWTexture2D<float2> g_outValue : register(u0);\0D\0A\0D\0AConstantBuffer<CalculatePartialDerivativesConstantBuffer> cb : register(b0);\0D\0A\0D\0A[numthreads(DefaultComputeShaderParams::ThreadGroup::Width, DefaultComputeShaderParams::ThreadGroup::Height, 1)]\0D\0Avoid main(uint2 DTid : SV_DispatchThreadID)\0D\0A{\0D\0A    //                x\0D\0A    //        ----------------->\0D\0A    //    |    x     [top]     x\0D\0A    // y  |  [left]   DTiD   [right]\0D\0A    //    v    x    [bottom]   x\0D\0A    //\0D\0A    uint2 top = clamp(DTid.xy + uint2(0, -1), 0, cb.textureDim - 1);\0D\0A    uint2 bottom = clamp(DTid.xy + uint2(0, 1), 0, cb.textureDim - 1);\0D\0A    uint2 left = clamp(DTid.xy + uint2(-1, 0), 0, cb.textureDim - 1);\0D\0A    uint2 right = clamp(DTid.xy + uint2(1, 0), 0, cb.textureDim - 1);\0D\0A\0D\0A    float centerValue = g_inValue[DTid.xy];\0D\0A    float2 backwardDifferences = centerValue - float2(g_inValue[left], g_inValue[top]);\0D\0A    float2 forwardDifferences = float2(g_inValue[right], g_inValue[bottom]) - centerValue;\0D\0A\0D\0A    // Calculates partial derivatives as the min of absolute backward and forward differences. \0D\0A\0D\0A    // Find the absolute minimum of the backward and foward differences in each axis\0D\0A    // while preserving the sign of the difference.\0D\0A    float2 ddx = float2(backwardDifferences.x, forwardDifferences.x);\0D\0A    float2 ddy = float2(backwardDifferences.y, forwardDifferences.y);\0D\0A\0D\0A    uint2 minIndex = {\0D\0A        GetIndexOfValueClosestToTheReference(0, ddx),\0D\0A        GetIndexOfValueClosestToTheReference(0, ddy)\0D\0A    };\0D\0A    float2 ddxy = float2(ddx[minIndex.x], ddy[minIndex.y]);\0D\0A\0D\0A    // Clamp ddxy to a reasonable value to avoid ddxy going over surface boundaries\0D\0A    // on thin geometry and getting background/foreground blended together on blur.\0D\0A    float maxDdxy = 1;\0D\0A    float2 _sign = sign(ddxy);\0D\0A    ddxy = _sign * min(abs(ddxy), maxDdxy);\0D\0A\0D\0A    g_outValue[DTid] = ddxy;\0D\0A}"}
