#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: e236f78c62e23be988f4e83908a8bc85.pdb
; shader hash: e236f78c62e23be988f4e83908a8bc85
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.ComposeRenderPassesConstantBuffer
;       {
;
;           uint compositionType;                     ; Offset:    0
;           uint isAOEnabled;                         ; Offset:    4
;           float RTAO_MaxRayHitDistance;             ; Offset:    8
;           float defaultAmbientIntensity;            ; Offset:   12
;           int variance_visualizeStdDeviation;       ; Offset:   16
;           float variance_scale;                     ; Offset:   20
;           float padding[2];                         ; Offset:   32
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    52
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !25, subprograms: !46, globals: !93)
!1 = !DIFile(filename: "SampleCore\5CShaders\5CCompositionCS.hlsl", directory: "")
!2 = !{!3, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CompositionType", file: !4, line: 247, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "PBRShading", value: 0)
!7 = !DIEnumerator(name: "AmbientOcclusionOnly_Denoised", value: 1)
!8 = !DIEnumerator(name: "AmbientOcclusionOnly_RawOneFrame", value: 2)
!9 = !DIEnumerator(name: "AmbientOcclusionAndDisocclusionMap", value: 3)
!10 = !DIEnumerator(name: "AmbientOcclusionVariance", value: 4)
!11 = !DIEnumerator(name: "AmbientOcclusionLocalVariance", value: 5)
!12 = !DIEnumerator(name: "RTAOHitDistance", value: 6)
!13 = !DIEnumerator(name: "NormalsOnly", value: 7)
!14 = !DIEnumerator(name: "DepthOnly", value: 8)
!15 = !DIEnumerator(name: "Albedo", value: 9)
!16 = !DIEnumerator(name: "BaseMaterialAlbedo", value: 10)
!17 = !DIEnumerator(name: "Count", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !19, file: !4, line: 437, size: 32, align: 32, elements: !20)
!19 = !DINamespace(name: "MaterialType", scope: null, file: !4, line: 436)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "Default", value: 0)
!22 = !DIEnumerator(name: "Matte", value: 1)
!23 = !DIEnumerator(name: "Mirror", value: 2)
!24 = !DIEnumerator(name: "AnalyticalCheckerboardTexture", value: 3)
!25 = !{!26, !38}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 190, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 190, size: 128, align: 32, elements: !28, templateParams: !34)
!28 = !{!29, !31, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 190, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 190, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, line: 190, baseType: !30, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !27, file: !1, line: 190, baseType: !30, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!34 = !{!35, !36}
!35 = !DITemplateTypeParameter(name: "element", type: !30)
!36 = !DITemplateValueParameter(name: "element_count", type: !37, value: i32 4)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 25, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 25, size: 96, align: 32, elements: !40, templateParams: !44)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 25, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 25, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 25, baseType: !30, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !{!35, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !37, value: i32 3)
!46 = !{!47, !59, !62, !71, !72, !75, !78, !87, !88, !89, !90, !91, !92}
!47 = !DISubprogram(name: "main", scope: !1, file: !1, line: 188, type: !48, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !52, templateParams: !56)
!52 = !{!53, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !1, baseType: !54, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !1, baseType: !54, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !{!57, !58}
!57 = !DITemplateTypeParameter(name: "element", type: !54)
!58 = !DITemplateValueParameter(name: "element_count", type: !37, value: i32 2)
!59 = !DISubprogram(name: "RenderPBRResult", linkageName: "\01?RenderPBRResult@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 34, type: !60, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!26, !50}
!62 = !DISubprogram(name: "DecodeNormalDepth", linkageName: "\01?DecodeNormalDepth@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !63, file: !63, line: 438, type: !64, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 506, baseType: !54)
!67 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !38)
!69 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !30)
!71 = !DISubprogram(name: "DecodeNormalDepth_N16D16", linkageName: "\01?DecodeNormalDepth_N16D16@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !63, file: !63, line: 426, type: !64, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubprogram(name: "Unpack_R8G8B16_FLOAT", linkageName: "\01?Unpack_R8G8B16_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !63, file: !63, line: 393, type: !73, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!38, !66}
!75 = !DISubprogram(name: "Unpack_R8_FLOAT", linkageName: "\01?Unpack_R8_FLOAT@@YAMI@Z", scope: !63, file: !63, line: 364, type: !76, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!30, !66}
!78 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !63, file: !63, line: 344, type: !79, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!38, !81}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 367, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 367, size: 64, align: 32, elements: !83, templateParams: !86)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !82, file: !1, line: 367, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !82, file: !1, line: 367, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!86 = !{!35, !58}
!87 = !DISubprogram(name: "RenderAOResult", linkageName: "\01?RenderAOResult@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 64, type: !60, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubprogram(name: "RenderDisocclusionMap", linkageName: "\01?RenderDisocclusionMap@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 165, type: !60, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubprogram(name: "RenderVariance", linkageName: "\01?RenderVariance@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 82, type: !60, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubprogram(name: "RenderRayHitDistance", linkageName: "\01?RenderRayHitDistance@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 108, type: !60, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubprogram(name: "RenderNormalOrDepth", linkageName: "\01?RenderNormalOrDepth@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 127, type: !60, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubprogram(name: "RenderAlbedo", linkageName: "\01?RenderAlbedo@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 149, type: !60, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false)
!93 = !{!94, !99, !104, !105, !107, !109, !114, !115, !117, !120, !124, !125, !130, !145, !147, !150, !153, !172, !173, !174, !175, !176, !177, !178, !180, !182, !184}
!94 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !95, file: !4, line: 506, type: !96, isLocal: true, isDefinition: true)
!95 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 504)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !98, line: 20, baseType: !66)
!98 = !DIFile(filename: "SampleCore\5CShaders/HlslCompat.hlsli", directory: "")
!99 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !100, file: !4, line: 508, type: !101, isLocal: true, isDefinition: true)
!100 = !DINamespace(name: "HitGroup", scope: !95, file: !4, line: 507)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, align: 32, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 2)
!104 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !100, file: !4, line: 513, type: !96, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !106, file: !4, line: 516, type: !101, isLocal: true, isDefinition: true)
!106 = !DINamespace(name: "MissShader", scope: !95, file: !4, line: 515)
!107 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !108, file: !4, line: 526, type: !96, isLocal: true, isDefinition: true)
!108 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !4, line: 524)
!109 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !110, file: !4, line: 528, type: !111, isLocal: true, isDefinition: true)
!110 = !DINamespace(name: "HitGroup", scope: !108, file: !4, line: 527)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, align: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !110, file: !4, line: 534, type: !96, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !116, file: !4, line: 537, type: !111, isLocal: true, isDefinition: true)
!116 = !DINamespace(name: "MissShader", scope: !108, file: !4, line: 536)
!117 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !4, line: 544, type: !118, isLocal: true, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !98, line: 17, baseType: !26)
!120 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !121, file: !122, line: 15, type: !123, isLocal: true, isDefinition: true)
!121 = !DINamespace(name: "RTAO", scope: null, file: !122, line: 14)
!122 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!124 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !121, file: !122, line: 16, type: !123, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariable(name: "g_renderTarget", linkageName: "\01?g_renderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 18, size: 128, align: 32, elements: !127, templateParams: !128)
!127 = !{}
!128 = !{!129}
!129 = !DITemplateTypeParameter(name: "element", type: !27)
!130 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UComposeRenderPassesConstantBuffer@@@@A", scope: !0, file: !1, line: 21, type: !131, isLocal: false, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ComposeRenderPassesConstantBuffer>", file: !1, line: 21, size: 32, align: 32, elements: !127, templateParams: !132)
!132 = !{!133}
!133 = !DITemplateTypeParameter(name: "T", type: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComposeRenderPassesConstantBuffer", file: !4, line: 329, size: 256, align: 32, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !142, !143}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "compositionType", scope: !134, file: !4, line: 331, baseType: !3, size: 32, align: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "isAOEnabled", scope: !134, file: !4, line: 332, baseType: !97, size: 32, align: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RTAO_MaxRayHitDistance", scope: !134, file: !4, line: 333, baseType: !30, size: 32, align: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "defaultAmbientIntensity", scope: !134, file: !4, line: 334, baseType: !30, size: 32, align: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "variance_visualizeStdDeviation", scope: !134, file: !4, line: 336, baseType: !141, size: 32, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !98, line: 24, baseType: !37)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "variance_scale", scope: !134, file: !4, line: 337, baseType: !30, size: 32, align: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !134, file: !4, line: 338, baseType: !144, size: 64, align: 32, offset: 192)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, align: 32, elements: !102)
!145 = !DIGlobalVariable(name: "g_texGBufferPositionRT", linkageName: "\01?g_texGBufferPositionRT@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !146, isLocal: false, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 22, size: 160, align: 32, elements: !127, templateParams: !128)
!147 = !DIGlobalVariable(name: "g_texGBufferNormalDepth", linkageName: "\01?g_texGBufferNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 23, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<unsigned int>", file: !1, line: 23, size: 64, align: 32, elements: !127, templateParams: !149)
!149 = !{!57}
!150 = !DIGlobalVariable(name: "g_texAO", linkageName: "\01?g_texAO@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 24, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 24, size: 64, align: 32, elements: !127, templateParams: !152)
!152 = !{!35}
!153 = !DIGlobalVariable(name: "g_materials", linkageName: "\01?g_materials@@3V?$StructuredBuffer@UPrimitiveMaterialBuffer@@@@A", scope: !0, file: !1, line: 25, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PrimitiveMaterialBuffer>", file: !1, line: 25, size: 768, align: 32, elements: !127, templateParams: !155)
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "element", type: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveMaterialBuffer", file: !4, line: 445, size: 768, align: 32, elements: !158)
!158 = !{!159, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Kd", scope: !157, file: !4, line: 447, baseType: !160, size: 96, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !98, line: 16, baseType: !38)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Ks", scope: !157, file: !4, line: 448, baseType: !160, size: 96, align: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Kr", scope: !157, file: !4, line: 449, baseType: !160, size: 96, align: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Kt", scope: !157, file: !4, line: 450, baseType: !160, size: 96, align: 32, offset: 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !157, file: !4, line: 451, baseType: !160, size: 96, align: 32, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "eta", scope: !157, file: !4, line: 452, baseType: !160, size: 96, align: 32, offset: 480)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !157, file: !4, line: 453, baseType: !30, size: 32, align: 32, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "hasDiffuseTexture", scope: !157, file: !4, line: 454, baseType: !141, size: 32, align: 32, offset: 608)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "hasNormalTexture", scope: !157, file: !4, line: 455, baseType: !141, size: 32, align: 32, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "hasPerVertexTangents", scope: !157, file: !4, line: 456, baseType: !141, size: 32, align: 32, offset: 672)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !4, line: 457, baseType: !18, size: 32, align: 32, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !157, file: !4, line: 458, baseType: !30, size: 32, align: 32, offset: 736)
!172 = !DIGlobalVariable(name: "g_texRayHitDistance", linkageName: "\01?g_texRayHitDistance@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 26, type: !151, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "g_texTspp", linkageName: "\01?g_texTspp@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 27, type: !148, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "g_texColor", linkageName: "\01?g_texColor@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 28, type: !146, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "g_texAOSurfaceAlbedo", linkageName: "\01?g_texAOSurfaceAlbedo@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 29, type: !146, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "g_texVariance", linkageName: "\01?g_texVariance@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 30, type: !146, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariable(name: "g_texLocalMeanVariance", linkageName: "\01?g_texLocalMeanVariance@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 31, type: !146, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !4, line: 544, type: !179, isLocal: false, isDefinition: true)
!179 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !118, size: 32, align: 4, offset: 64)
!180 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !4, line: 544, type: !181, isLocal: false, isDefinition: true)
!181 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !118, size: 32, align: 4, offset: 96)
!182 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !4, line: 544, type: !183, isLocal: false, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !118, size: 32, align: 4)
!184 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !4, line: 544, type: !185, isLocal: false, isDefinition: true)
!185 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !118, size: 32, align: 4, offset: 32)
!186 = !{i32 2, !"Dwarf Version", i32 4}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
