#if 0
;
; Note: shader requires additional functionality:
;       Wave level operations
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: c6316b28e752b5547769f55c31cabefe.pdb
; shader hash: c6316b28e752b5547769f55c31cabefe
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.FilterConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           uint step;                                ; Offset:    8
;           float padding;                            ; Offset:   12
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; cb                                cbuffer      NA          NA     CB0            cb0     1
; g_inDepth                         texture     f32          2d      T0             t1     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22, globals: !63)
!1 = !DIFile(filename: "RTAO\5CShaders\5CDenoising\5CDisocclusionBlur3x3CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 47, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 47, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 102, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 102, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 102, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 102, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !{!23, !27, !31, !34, !37, !49, !52, !55, !58, !61}
!23 = !DISubprogram(name: "main", scope: !1, file: !1, line: 244, type: !24, isLocal: false, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !4, !4, !26}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 46, baseType: !8)
!27 = !DISubprogram(name: "??__EKernel@FilterKernel@@YAXXZ", scope: !28, file: !28, line: 48, type: !29, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!28 = !DIFile(filename: "RTAO\5CShaders\5CDenoising/Kernels.hlsli", directory: "")
!29 = !DISubroutineType(types: !30)
!30 = !{null}
!31 = !DISubprogram(name: "GetPixelIndex", linkageName: "\01?GetPixelIndex@@YA?AV?$vector@I$01@@V1@0@Z", scope: !1, file: !1, line: 51, type: !32, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DISubroutineType(types: !33)
!33 = !{!4, !4, !4}
!34 = !DISubprogram(name: "FilterHorizontally", linkageName: "\01?FilterHorizontally@@YAXV?$vector@I$01@@I@Z", scope: !1, file: !1, line: 63, type: !35, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !4, !26}
!37 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@H$01@@0@Z", scope: !38, file: !38, line: 62, type: !39, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !42, !42}
!41 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 71, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 71, size: 64, align: 32, elements: !44, templateParams: !47)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 71, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 71, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!47 = !{!48, !12}
!48 = !DITemplateTypeParameter(name: "element", type: !13)
!49 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NIIM@Z", scope: !38, file: !38, line: 95, type: !50, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!41, !26, !26, !18}
!52 = !DISubprogram(name: "Float2ToHalf", linkageName: "\01?Float2ToHalf@@YAIV?$vector@M$01@@@Z", scope: !38, file: !38, line: 36, type: !53, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!26, !14}
!55 = !DISubprogram(name: "FilterVertically", linkageName: "\01?FilterVertically@@YAXV?$vector@I$01@@0M@Z", scope: !1, file: !1, line: 193, type: !56, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !4, !4, !18}
!58 = !DISubprogram(name: "HalfToFloat2", linkageName: "\01?HalfToFloat2@@YA?AV?$vector@M$01@@I@Z", scope: !38, file: !38, line: 44, type: !59, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!14, !26}
!61 = !DISubprogram(linkageName: "_GLOBAL__sub_I_DisocclusionBlur3x3CS.hlsl", scope: !1, file: !1, type: !62, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!62 = !DISubroutineType(types: !2)
!63 = !{!64, !70, !75, !76, !78, !80, !85, !86, !88, !100, !104, !105, !108, !109, !113, !116, !119, !120, !122, !126, !127, !137, !139, !141, !142, !144, !146, !148, !150, !152, !154, !159}
!64 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !65, file: !66, line: 506, type: !67, isLocal: true, isDefinition: true)
!65 = !DINamespace(name: "TraceRayParameters", scope: null, file: !66, line: 504)
!66 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !69, line: 20, baseType: !26)
!69 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!70 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !71, file: !66, line: 508, type: !72, isLocal: true, isDefinition: true)
!71 = !DINamespace(name: "HitGroup", scope: !65, file: !66, line: 507)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, align: 32, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 2)
!75 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !71, file: !66, line: 513, type: !67, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !77, file: !66, line: 516, type: !72, isLocal: true, isDefinition: true)
!77 = !DINamespace(name: "MissShader", scope: !65, file: !66, line: 515)
!78 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !79, file: !66, line: 526, type: !67, isLocal: true, isDefinition: true)
!79 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !66, line: 524)
!80 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !81, file: !66, line: 528, type: !82, isLocal: true, isDefinition: true)
!81 = !DINamespace(name: "HitGroup", scope: !79, file: !66, line: 527)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 32, align: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1)
!85 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !81, file: !66, line: 534, type: !67, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !87, file: !66, line: 537, type: !82, isLocal: true, isDefinition: true)
!87 = !DINamespace(name: "MissShader", scope: !79, file: !66, line: 536)
!88 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !66, line: 544, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !69, line: 17, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 544, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 544, size: 128, align: 32, elements: !93, templateParams: !98)
!93 = !{!94, !95, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !92, file: !1, line: 544, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !92, file: !1, line: 544, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !92, file: !1, line: 544, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !92, file: !1, line: 544, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!98 = !{!21, !99}
!99 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!100 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !101, file: !102, line: 15, type: !103, isLocal: true, isDefinition: true)
!101 = !DINamespace(name: "RTAO", scope: null, file: !102, line: 14)
!102 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!104 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !101, file: !102, line: 16, type: !103, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariable(name: "Radius", linkageName: "\01?Radius@FilterKernel@@3IB", scope: !106, file: !28, line: 45, type: !107, isLocal: true, isDefinition: true)
!106 = !DINamespace(name: "FilterKernel", scope: null, file: !28, line: 16)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!108 = !DIGlobalVariable(name: "Width", linkageName: "\01?Width@FilterKernel@@3IB", scope: !106, file: !28, line: 46, type: !107, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariable(name: "Kernel1D", linkageName: "\01?Kernel1D@FilterKernel@@3QBMB", scope: !106, file: !28, line: 47, type: !110, isLocal: true, isDefinition: true, variable: [3 x float]* @"\01?Kernel1D@FilterKernel@@3QBMB")
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 96, align: 32, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 3)
!113 = !DIGlobalVariable(name: "Kernel", linkageName: "\01?Kernel@FilterKernel@@3QAY02$$CBMA", scope: !106, file: !28, line: 48, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 288, align: 32, elements: !115)
!115 = !{!112, !112}
!116 = !DIGlobalVariable(name: "g_inDepth", linkageName: "\01?g_inDepth@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 32, type: !117, isLocal: false, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 32, size: 64, align: 32, elements: !2, templateParams: !118)
!118 = !{!21}
!119 = !DIGlobalVariable(name: "g_inBlurStrength", linkageName: "\01?g_inBlurStrength@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 33, type: !117, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "g_inOutValue", linkageName: "\01?g_inOutValue@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 34, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 34, size: 32, align: 32, elements: !2, templateParams: !118)
!122 = !DIGlobalVariable(name: "g_outDebug1", linkageName: "\01?g_outDebug1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 36, type: !123, isLocal: false, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 36, size: 128, align: 32, elements: !2, templateParams: !124)
!124 = !{!125}
!125 = !DITemplateTypeParameter(name: "element", type: !92)
!126 = !DIGlobalVariable(name: "g_outDebug2", linkageName: "\01?g_outDebug2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 37, type: !123, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UFilterConstantBuffer@@@@A", scope: !0, file: !1, line: 40, type: !128, isLocal: false, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<FilterConstantBuffer>", file: !1, line: 40, size: 32, align: 32, elements: !2, templateParams: !129)
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "T", type: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilterConstantBuffer", file: !66, line: 347, size: 128, align: 32, elements: !132)
!132 = !{!133, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !131, file: !66, line: 349, baseType: !134, size: 64, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !69, line: 21, baseType: !4)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !131, file: !66, line: 350, baseType: !68, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !131, file: !66, line: 351, baseType: !18, size: 32, align: 32, offset: 96)
!137 = !DIGlobalVariable(name: "NumValuesToLoadPerRowOrColumn", scope: !0, file: !1, line: 43, type: !138, isLocal: true, isDefinition: true)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!139 = !DIGlobalVariable(name: "GroupDim", scope: !34, file: !1, line: 65, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!141 = !DIGlobalVariable(name: "NumRowsToLoadPerThread", scope: !34, file: !1, line: 72, type: !138, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !66, line: 544, type: !143, isLocal: false, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !89, size: 32, align: 4, offset: 32)
!144 = !DIGlobalVariable(name: "GroupDim.0", linkageName: "\01?GroupDim@?1??FilterHorizontally@@YAXV?$vector@I$01@@I@Z@3V2@B.0", scope: !34, file: !1, line: 65, type: !145, isLocal: false, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !140, size: 32, align: 4)
!146 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !66, line: 544, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !89, size: 32, align: 4, offset: 64)
!148 = !DIGlobalVariable(name: "GroupDim.1", linkageName: "\01?GroupDim@?1??FilterHorizontally@@YAXV?$vector@I$01@@I@Z@3V2@B.1", scope: !34, file: !1, line: 65, type: !149, isLocal: false, isDefinition: true)
!149 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !140, size: 32, align: 4, offset: 32)
!150 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !66, line: 544, type: !151, isLocal: false, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !89, size: 32, align: 4, offset: 96)
!152 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !66, line: 544, type: !153, isLocal: false, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !89, size: 32, align: 4)
!154 = !DIGlobalVariable(name: "PackedValueDepthCache", linkageName: "\01?PackedValueDepthCache@@3PAY07$$CAIA.1dim", scope: !0, file: !1, line: 46, type: !155, isLocal: false, isDefinition: true, variable: [80 x i32] addrspace(3)* @"\01?PackedValueDepthCache@@3PAY07$$CAIA.1dim")
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2560, align: 32, elements: !156)
!156 = !{!157, !158}
!157 = !DISubrange(count: 10)
!158 = !DISubrange(count: 8)
!159 = !DIGlobalVariable(name: "FilteredResultCache", linkageName: "\01?FilteredResultCache@@3PAY07$$CAMA.1dim", scope: !0, file: !1, line: 47, type: !160, isLocal: false, isDefinition: true, variable: [80 x float] addrspace(3)* @"\01?FilteredResultCache@@3PAY07$$CAMA.1dim")
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 2560, align: 32, elements: !156)
!161 = !{i32 2, !"Dwarf Version", i32 4}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
