#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 47df30b58c46d09a3317a45485c10efc.pdb
; shader hash: 47df30b58c46d09a3317a45485c10efc
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.TextureDimConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           float2 invTextureDim;                     ; Offset:    8
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; cb                                cbuffer      NA          NA     CB0            cb0     1
; ClampSampler                      sampler      NA          NA      S0             s0     1
; g_inNormalDepth                   texture     f32          2d      T0             t1     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !43)
!1 = !DIFile(filename: "SampleCore\5CShaders\5Cutil\5CDownsampleGBufferDataBilateralFilter2x2CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !17, !32, !36, !37, !40}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 56, type: !5, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !9, templateParams: !13)
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !{!14, !15}
!14 = !DITemplateTypeParameter(name: "element", type: !11)
!15 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 2)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DISubprogram(name: "GetIndexFromDepthAwareBilateralDownsample2x2", linkageName: "\01?GetIndexFromDepthAwareBilateralDownsample2x2@@YAIV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 42, type: !18, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !21, !7}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 63, baseType: !11)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 61, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 61, size: 128, align: 32, elements: !23, templateParams: !29)
!23 = !{!24, !26, !27, !28}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 61, baseType: !25, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 61, baseType: !25, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !22, file: !1, line: 61, baseType: !25, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !22, file: !1, line: 61, baseType: !25, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!30, !31}
!30 = !DITemplateTypeParameter(name: "element", type: !25)
!31 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 4)
!32 = !DISubprogram(name: "min4", linkageName: "\01?min4@@YAMV?$vector@M$03@@@Z", scope: !33, file: !33, line: 644, type: !34, isLocal: false, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!25, !21}
!36 = !DISubprogram(name: "max4", linkageName: "\01?max4@@YAMV?$vector@M$03@@@Z", scope: !33, file: !33, line: 649, type: !34, isLocal: false, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: false)
!37 = !DISubprogram(name: "GetIndexOfValueClosestToTheReference", linkageName: "\01?GetIndexOfValueClosestToTheReference@@YAIMV?$vector@M$03@@@Z", scope: !33, file: !33, line: 669, type: !38, isLocal: false, isDefinition: true, scopeLine: 670, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DISubroutineType(types: !39)
!39 = !{!20, !25, !21}
!40 = !DISubprogram(name: "Get2DQuadIndexOffset", linkageName: "\01?Get2DQuadIndexOffset@@YA?AV?$vector@I$01@@I@Z", scope: !33, file: !33, line: 654, type: !41, isLocal: false, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DISubroutineType(types: !42)
!42 = !{!7, !20}
!43 = !{!44, !50, !55, !56, !58, !60, !65, !66, !68, !71, !75, !76, !80, !81, !90, !93, !94, !97, !98, !100, !101, !103, !105, !106, !108, !109, !111, !122, !124, !126, !128, !130}
!44 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !45, file: !46, line: 506, type: !47, isLocal: true, isDefinition: true)
!45 = !DINamespace(name: "TraceRayParameters", scope: null, file: !46, line: 504)
!46 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !49, line: 20, baseType: !20)
!49 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!50 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !51, file: !46, line: 508, type: !52, isLocal: true, isDefinition: true)
!51 = !DINamespace(name: "HitGroup", scope: !45, file: !46, line: 507)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, align: 32, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 2)
!55 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !51, file: !46, line: 513, type: !47, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !57, file: !46, line: 516, type: !52, isLocal: true, isDefinition: true)
!57 = !DINamespace(name: "MissShader", scope: !45, file: !46, line: 515)
!58 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !59, file: !46, line: 526, type: !47, isLocal: true, isDefinition: true)
!59 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !46, line: 524)
!60 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !61, file: !46, line: 528, type: !62, isLocal: true, isDefinition: true)
!61 = !DINamespace(name: "HitGroup", scope: !59, file: !46, line: 527)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, align: 32, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !61, file: !46, line: 534, type: !47, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !67, file: !46, line: 537, type: !62, isLocal: true, isDefinition: true)
!67 = !DINamespace(name: "MissShader", scope: !59, file: !46, line: 536)
!68 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !46, line: 544, type: !69, isLocal: true, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !49, line: 17, baseType: !21)
!71 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !72, file: !73, line: 15, type: !74, isLocal: true, isDefinition: true)
!72 = !DINamespace(name: "RTAO", scope: null, file: !73, line: 14)
!73 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!75 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !72, file: !73, line: 16, type: !74, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariable(name: "g_inNormalDepth", linkageName: "\01?g_inNormalDepth@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 16, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 16, size: 160, align: 32, elements: !2, templateParams: !78)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "element", type: !22)
!80 = !DIGlobalVariable(name: "g_inHitPosition", linkageName: "\01?g_inHitPosition@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 17, type: !77, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "g_inPartialDistanceDerivatives", linkageName: "\01?g_inPartialDistanceDerivatives@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 18, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 18, size: 96, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "element", type: !85)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 60, size: 64, align: 32, elements: !86, templateParams: !89)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !85, file: !1, line: 60, baseType: !25, size: 32, align: 32, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !85, file: !1, line: 60, baseType: !25, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!89 = !{!30, !15}
!90 = !DIGlobalVariable(name: "g_inDepth", linkageName: "\01?g_inDepth@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 19, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 19, size: 64, align: 32, elements: !2, templateParams: !92)
!92 = !{!30}
!93 = !DIGlobalVariable(name: "g_inMotionVector", linkageName: "\01?g_inMotionVector@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 20, type: !82, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "g_inReprojectedNormalDepth", linkageName: "\01?g_inReprojectedNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 21, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<unsigned int>", file: !1, line: 21, size: 64, align: 32, elements: !2, templateParams: !96)
!96 = !{!14}
!97 = !DIGlobalVariable(name: "g_inSurfaceAlbedo", linkageName: "\01?g_inSurfaceAlbedo@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !77, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "g_outNormalDepth", linkageName: "\01?g_outNormalDepth@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 23, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 23, size: 128, align: 32, elements: !2, templateParams: !78)
!100 = !DIGlobalVariable(name: "g_outHitPosition", linkageName: "\01?g_outHitPosition@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 24, type: !99, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "g_outPartialDistanceDerivatives", linkageName: "\01?g_outPartialDistanceDerivatives@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 25, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 25, size: 64, align: 32, elements: !2, templateParams: !83)
!103 = !DIGlobalVariable(name: "g_outDepth", linkageName: "\01?g_outDepth@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 26, type: !104, isLocal: false, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !92)
!105 = !DIGlobalVariable(name: "g_outMotionVector", linkageName: "\01?g_outMotionVector@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 27, type: !102, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "g_outReprojectedNormalDepth", linkageName: "\01?g_outReprojectedNormalDepth@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 28, type: !107, isLocal: false, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 28, size: 32, align: 32, elements: !2, templateParams: !96)
!108 = !DIGlobalVariable(name: "g_outSurfaceAlbedo", linkageName: "\01?g_outSurfaceAlbedo@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 29, type: !99, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "ClampSampler", linkageName: "\01?ClampSampler@@3USamplerState@@A", scope: !0, file: !1, line: 31, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 31, size: 32, align: 32, elements: !2)
!111 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UTextureDimConstantBuffer@@@@A", scope: !0, file: !1, line: 33, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TextureDimConstantBuffer>", file: !1, line: 33, size: 32, align: 32, elements: !2, templateParams: !113)
!113 = !{!114}
!114 = !DITemplateTypeParameter(name: "T", type: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextureDimConstantBuffer", file: !46, line: 341, size: 128, align: 32, elements: !116)
!116 = !{!117, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !115, file: !46, line: 343, baseType: !118, size: 64, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !49, line: 21, baseType: !7)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "invTextureDim", scope: !115, file: !46, line: 344, baseType: !120, size: 64, align: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT2", file: !49, line: 15, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 60, baseType: !85)
!122 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !46, line: 544, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !69, size: 32, align: 4, offset: 64)
!124 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !46, line: 544, type: !125, isLocal: false, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !69, size: 32, align: 4, offset: 32)
!126 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !46, line: 544, type: !127, isLocal: false, isDefinition: true)
!127 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !69, size: 32, align: 4)
!128 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !46, line: 544, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !69, size: 32, align: 4, offset: 96)
!130 = !DIGlobalVariable(name: "indexOffsets", linkageName: "\01?indexOffsets@?1??Get2DQuadIndexOffset@@YA?AV?$vector@I$01@@I@Z@3QBV2@B.v.1dim", scope: !40, file: !33, line: 656, type: !131, isLocal: false, isDefinition: true, variable: [8 x i32]* @"\01?indexOffsets@?1??Get2DQuadIndexOffset@@YA?AV?$vector@I$01@@I@Z@3QBV2@B.v.1dim")
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 256, align: 32, elements: !133)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!133 = !{!134}
!134 = !DISubrange(count: 4)
!135 = !{i32 2, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
