#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: c6c02bffd734a8887f2f788bcf55c2cc.pdb
; shader hash: c6c02bffd734a8887f2f788bcf55c2cc
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.AtrousWaveletTransformFilterConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           float depthWeightCutoff;                  ; Offset:    8
;           bool usingBilateralDownsampledBuffers;    ; Offset:   12
;           int useAdaptiveKernelSize;                ; Offset:   16
;           float kernelRadiusLerfCoef;               ; Offset:   20
;           uint minKernelWidth;                      ; Offset:   24
;           uint maxKernelWidth;                      ; Offset:   28
;           float rayHitDistanceToKernelWidthScale;   ; Offset:   32
;           float rayHitDistanceToKernelSizeScaleExponent;; Offset:   36
;           int perspectiveCorrectDepthInterpolation; ; Offset:   40
;           float minVarianceToDenoise;               ; Offset:   44
;           float valueSigma;                         ; Offset:   48

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !29, globals: !89)
!1 = !DIFile(filename: "RTAO\5CShaders\5CDenoising\5CEdgeStoppingFilter_Gaussian5x5CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !23}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 152, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 152, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 152, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 152, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 152, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 36, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 36, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 36, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 36, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !22}
!21 = !DITemplateTypeParameter(name: "element", type: !14)
!22 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 162, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 162, size: 64, align: 32, elements: !25, templateParams: !28)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 162, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 162, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !{!12, !22}
!29 = !{!30, !42, !46, !51, !59, !60, !63, !66, !69, !72, !75, !78, !81, !84, !87}
!30 = !DISubprogram(name: "main", scope: !31, file: !31, line: 143, type: !32, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!31 = !DIFile(filename: "RTAO\5CShaders\5CDenoising/AtrousWaveletTransfromCrossBilateralFilterCS.hlsli", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, baseType: !38, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, baseType: !38, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !{!41, !22}
!41 = !DITemplateTypeParameter(name: "element", type: !38)
!42 = !DISubprogram(name: "??__EKernel@FilterKernel@@YAXXZ", scope: !43, file: !43, line: 59, type: !44, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DIFile(filename: "RTAO\5CShaders\5CDenoising/Kernels.hlsli", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{null}
!46 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@H$01@@0@Z", scope: !47, file: !47, line: 62, type: !48, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !15, !15}
!50 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!51 = !DISubprogram(name: "DecodeNormalDepth", linkageName: "\01?DecodeNormalDepth@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !47, file: !47, line: 438, type: !52, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !55, !57}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 210, baseType: !38)
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4)
!57 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !8)
!59 = !DISubprogram(name: "DecodeNormalDepth_N16D16", linkageName: "\01?DecodeNormalDepth_N16D16@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !47, file: !47, line: 426, type: !52, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubprogram(name: "Unpack_R8G8B16_FLOAT", linkageName: "\01?Unpack_R8G8B16_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !47, file: !47, line: 393, type: !61, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!4, !54}
!63 = !DISubprogram(name: "Unpack_R8_FLOAT", linkageName: "\01?Unpack_R8_FLOAT@@YAMI@Z", scope: !47, file: !47, line: 364, type: !64, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!8, !54}
!66 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !47, file: !47, line: 344, type: !67, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!4, !23}
!69 = !DISubprogram(name: "ApproximateProjectedSurfaceDimensionsPerPixel", linkageName: "\01?ApproximateProjectedSurfaceDimensionsPerPixel@@YA?AV?$vector@M$01@@MV1@M@Z", scope: !47, file: !47, line: 706, type: !70, isLocal: false, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{!23, !8, !23, !8}
!72 = !DISubprogram(name: "AddFilterContribution", linkageName: "\01?AddFilterContribution@@YAXAIAM0MMMV?$vector@M$02@@V?$vector@M$01@@IIV?$vector@I$01@@3@Z", scope: !31, file: !31, line: 55, type: !73, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !57, !57, !8, !8, !8, !4, !23, !54, !54, !34, !34}
!75 = !DISubprogram(name: "FloatPrecision", linkageName: "\01?FloatPrecision@@YAMMI@Z", scope: !47, file: !47, line: 300, type: !76, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!8, !8, !54}
!78 = !DISubprogram(name: "SmallestPowerOf2GreaterThan", linkageName: "\01?SmallestPowerOf2GreaterThan@@YAII@Z", scope: !47, file: !47, line: 281, type: !79, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!54, !54}
!81 = !DISubprogram(name: "DepthThreshold", linkageName: "\01?DepthThreshold@@YAMMV?$vector@M$01@@0@Z", scope: !31, file: !31, line: 38, type: !82, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!8, !8, !23, !23}
!84 = !DISubprogram(name: "RemapDdxy", linkageName: "\01?RemapDdxy@@YA?AV?$vector@M$01@@MV1@0@Z", scope: !47, file: !47, line: 681, type: !85, isLocal: false, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!23, !8, !23, !23}
!87 = !DISubprogram(linkageName: "_GLOBAL__sub_I_EdgeStoppingFilter_Gaussian5x5CS.hlsl", scope: !1, file: !1, type: !88, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!88 = !DISubroutineType(types: !2)
!89 = !{!90, !94, !97, !98, !104, !109, !110, !112, !114, !119, !120, !122, !134, !135, !136, !137, !138, !142, !145, !148, !151, !152, !153, !157, !158, !160, !164, !165, !188, !189, !191, !193, !195}
!90 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", scope: !91, file: !92, line: 16, type: !93, isLocal: true, isDefinition: true, variable: float -1.000000e+00)
!91 = !DINamespace(name: "RTAO", scope: null, file: !92, line: 14)
!92 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!94 = !DIGlobalVariable(name: "Radius", scope: !95, file: !43, line: 56, type: !96, isLocal: true, isDefinition: true, variable: i32 2)
!95 = !DINamespace(name: "FilterKernel", scope: null, file: !43, line: 16)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!97 = !DIGlobalVariable(name: "Width", scope: !95, file: !43, line: 57, type: !96, isLocal: true, isDefinition: true, variable: i32 5)
!98 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !99, file: !100, line: 506, type: !101, isLocal: true, isDefinition: true)
!99 = !DINamespace(name: "TraceRayParameters", scope: null, file: !100, line: 504)
!100 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !103, line: 20, baseType: !54)
!103 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!104 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !105, file: !100, line: 508, type: !106, isLocal: true, isDefinition: true)
!105 = !DINamespace(name: "HitGroup", scope: !99, file: !100, line: 507)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, align: 32, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 2)
!109 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !105, file: !100, line: 513, type: !101, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !111, file: !100, line: 516, type: !106, isLocal: true, isDefinition: true)
!111 = !DINamespace(name: "MissShader", scope: !99, file: !100, line: 515)
!112 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !113, file: !100, line: 526, type: !101, isLocal: true, isDefinition: true)
!113 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !100, line: 524)
!114 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !115, file: !100, line: 528, type: !116, isLocal: true, isDefinition: true)
!115 = !DINamespace(name: "HitGroup", scope: !113, file: !100, line: 527)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 32, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !115, file: !100, line: 534, type: !101, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !121, file: !100, line: 537, type: !116, isLocal: true, isDefinition: true)
!121 = !DINamespace(name: "MissShader", scope: !113, file: !100, line: 536)
!122 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !100, line: 544, type: !123, isLocal: true, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !103, line: 17, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 544, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 544, size: 128, align: 32, elements: !127, templateParams: !132)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !126, file: !1, line: 544, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !126, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !126, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !126, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!132 = !{!12, !133}
!133 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!134 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !91, file: !92, line: 15, type: !93, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !91, file: !92, line: 16, type: !93, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariable(name: "Radius", linkageName: "\01?Radius@FilterKernel@@3IB", scope: !95, file: !43, line: 56, type: !96, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariable(name: "Width", linkageName: "\01?Width@FilterKernel@@3IB", scope: !95, file: !43, line: 57, type: !96, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariable(name: "Kernel1D", linkageName: "\01?Kernel1D@FilterKernel@@3QBMB", scope: !95, file: !43, line: 58, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 160, align: 32, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 5)
!142 = !DIGlobalVariable(name: "Kernel", linkageName: "\01?Kernel@FilterKernel@@3QAY04$$CBMA", scope: !95, file: !43, line: 59, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 800, align: 32, elements: !144)
!144 = !{!141, !141}
!145 = !DIGlobalVariable(name: "g_inValue", linkageName: "\01?g_inValue@@3V?$Texture2D@M@@A", scope: !0, file: !31, line: 25, type: !146, isLocal: false, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 25, size: 64, align: 32, elements: !2, templateParams: !147)
!147 = !{!12}
!148 = !DIGlobalVariable(name: "g_inNormalDepth", linkageName: "\01?g_inNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !31, line: 26, type: !149, isLocal: false, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<unsigned int>", file: !1, line: 26, size: 64, align: 32, elements: !2, templateParams: !150)
!150 = !{!41}
!151 = !DIGlobalVariable(name: "g_inVariance", linkageName: "\01?g_inVariance@@3V?$Texture2D@M@@A", scope: !0, file: !31, line: 27, type: !146, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariable(name: "g_inHitDistance", linkageName: "\01?g_inHitDistance@@3V?$Texture2D@M@@A", scope: !0, file: !31, line: 28, type: !146, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariable(name: "g_inPartialDistanceDerivatives", linkageName: "\01?g_inPartialDistanceDerivatives@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !31, line: 29, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 29, size: 96, align: 32, elements: !2, templateParams: !155)
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "element", type: !24)
!157 = !DIGlobalVariable(name: "g_inTspp", linkageName: "\01?g_inTspp@@3V?$Texture2D@I@@A", scope: !0, file: !31, line: 30, type: !149, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "g_outFilteredValue", linkageName: "\01?g_outFilteredValue@@3V?$RWTexture2D@M@@A", scope: !0, file: !31, line: 32, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 32, size: 32, align: 32, elements: !2, templateParams: !147)
!160 = !DIGlobalVariable(name: "g_outDebug1", linkageName: "\01?g_outDebug1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !31, line: 33, type: !161, isLocal: false, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 33, size: 128, align: 32, elements: !2, templateParams: !162)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "element", type: !126)
!164 = !DIGlobalVariable(name: "g_outDebug2", linkageName: "\01?g_outDebug2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !31, line: 34, type: !161, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UAtrousWaveletTransformFilterConstantBuffer@@@@A", scope: !0, file: !31, line: 36, type: !166, isLocal: false, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<AtrousWaveletTransformFilterConstantBuffer>", file: !1, line: 36, size: 32, align: 32, elements: !2, templateParams: !167)
!167 = !{!168}
!168 = !DITemplateTypeParameter(name: "T", type: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtrousWaveletTransformFilterConstantBuffer", file: !100, line: 113, size: 512, align: 32, elements: !170)
!170 = !{!171, !173, !174, !175, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !169, file: !100, line: 115, baseType: !172, size: 64, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !103, line: 21, baseType: !34)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "depthWeightCutoff", scope: !169, file: !100, line: 116, baseType: !8, size: 32, align: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "usingBilateralDownsampledBuffers", scope: !169, file: !100, line: 117, baseType: !50, size: 32, align: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "useAdaptiveKernelSize", scope: !169, file: !100, line: 119, baseType: !176, size: 32, align: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !103, line: 24, baseType: !14)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "kernelRadiusLerfCoef", scope: !169, file: !100, line: 120, baseType: !8, size: 32, align: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "minKernelWidth", scope: !169, file: !100, line: 121, baseType: !102, size: 32, align: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "maxKernelWidth", scope: !169, file: !100, line: 122, baseType: !102, size: 32, align: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "rayHitDistanceToKernelWidthScale", scope: !169, file: !100, line: 124, baseType: !8, size: 32, align: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "rayHitDistanceToKernelSizeScaleExponent", scope: !169, file: !100, line: 125, baseType: !8, size: 32, align: 32, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "perspectiveCorrectDepthInterpolation", scope: !169, file: !100, line: 126, baseType: !176, size: 32, align: 32, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "minVarianceToDenoise", scope: !169, file: !100, line: 127, baseType: !8, size: 32, align: 32, offset: 352)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "valueSigma", scope: !169, file: !100, line: 129, baseType: !8, size: 32, align: 32, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "depthSigma", scope: !169, file: !100, line: 130, baseType: !8, size: 32, align: 32, offset: 416)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "normalSigma", scope: !169, file: !100, line: 131, baseType: !8, size: 32, align: 32, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "DepthNumMantissaBits", scope: !169, file: !100, line: 132, baseType: !102, size: 32, align: 32, offset: 480)
!188 = !DIGlobalVariable(name: "errorOffset", scope: !72, file: !31, line: 99, type: !93, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !100, line: 544, type: !190, isLocal: false, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !123, size: 32, align: 4, offset: 96)
!191 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !100, line: 544, type: !192, isLocal: false, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !123, size: 32, align: 4)
!193 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !100, line: 544, type: !194, isLocal: false, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !123, size: 32, align: 4, offset: 64)
!195 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !100, line: 544, type: !196, isLocal: false, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !123, size: 32, align: 4, offset: 32)
!197 = !{i32 2, !"Dwarf Version", i32 4}
!198 = !{i32 2, !"Debug Info Version", i32 3}
!199 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!200 = !{!"RTAO\5CShaders\5CDenoising\5CEdgeStoppingFilter_Gaussian5x5CS.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#define HLSL\0D\0A#define GAUSSIAN_KERNEL_5X5\0D\0A#include \22AtrousWaveletTransfromCrossBilateralFilterCS.hlsli\22"}
