#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 3adcc32377f40c5d9c69b2015238ac9b.pdb
; shader hash: 3adcc32377f40c5d9c69b2015238ac9b
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.TextureDimConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           float2 invTextureDim;                     ; Offset:    8
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; cb                                cbuffer      NA          NA     CB0            cb0     1
; MirroredLinearSampler             sampler      NA          NA      S0             s0     1
; g_input                           texture     f32          2d      T0             t0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !35)
!1 = !DIFile(filename: "RTAO\5CShaders\5CDenoising\5CGaussianFilterRG3x3CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 35, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 35, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 35, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 86, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 86, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 86, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!13, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!23 = !{!24}
!24 = !DISubprogram(name: "main", scope: !1, file: !1, line: 32, type: !25, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !29, templateParams: !33)
!29 = !{!30, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, baseType: !31, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, baseType: !31, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !{!34, !22}
!34 = !DITemplateTypeParameter(name: "element", type: !31)
!35 = !{!36, !43, !48, !49, !51, !53, !58, !59, !61, !64, !68, !70, !80, !82, !87, !89, !91, !93}
!36 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !37, file: !38, line: 506, type: !39, isLocal: true, isDefinition: true)
!37 = !DINamespace(name: "TraceRayParameters", scope: null, file: !38, line: 504)
!38 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !41, line: 20, baseType: !42)
!41 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 506, baseType: !31)
!43 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !44, file: !38, line: 508, type: !45, isLocal: true, isDefinition: true)
!44 = !DINamespace(name: "HitGroup", scope: !37, file: !38, line: 507)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, align: 32, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 2)
!48 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !44, file: !38, line: 513, type: !39, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !50, file: !38, line: 516, type: !45, isLocal: true, isDefinition: true)
!50 = !DINamespace(name: "MissShader", scope: !37, file: !38, line: 515)
!51 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !52, file: !38, line: 526, type: !39, isLocal: true, isDefinition: true)
!52 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !38, line: 524)
!53 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !54, file: !38, line: 528, type: !55, isLocal: true, isDefinition: true)
!54 = !DINamespace(name: "HitGroup", scope: !52, file: !38, line: 527)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, align: 32, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1)
!58 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !54, file: !38, line: 534, type: !39, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !60, file: !38, line: 537, type: !55, isLocal: true, isDefinition: true)
!60 = !DINamespace(name: "MissShader", scope: !52, file: !38, line: 536)
!61 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !38, line: 544, type: !62, isLocal: true, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !41, line: 17, baseType: !4)
!64 = !DIGlobalVariable(name: "g_input", linkageName: "\01?g_input@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 15, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 15, size: 96, align: 32, elements: !2, templateParams: !66)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "element", type: !17)
!68 = !DIGlobalVariable(name: "g_output", linkageName: "\01?g_output@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 16, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 16, size: 64, align: 32, elements: !2, templateParams: !66)
!70 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UTextureDimConstantBuffer@@@@A", scope: !0, file: !1, line: 17, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TextureDimConstantBuffer>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !72)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "T", type: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "TextureDimConstantBuffer", file: !38, line: 341, size: 128, align: 32, elements: !75)
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !74, file: !38, line: 343, baseType: !77, size: 64, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !41, line: 21, baseType: !27)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "invTextureDim", scope: !74, file: !38, line: 344, baseType: !79, size: 64, align: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT2", file: !41, line: 15, baseType: !16)
!80 = !DIGlobalVariable(name: "MirroredLinearSampler", linkageName: "\01?MirroredLinearSampler@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!82 = !DIGlobalVariable(name: "weights", scope: !0, file: !1, line: 21, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 288, align: 32, elements: !85)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!85 = !{!86, !86}
!86 = !DISubrange(count: 3)
!87 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !38, line: 544, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !62, size: 32, align: 4)
!89 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !38, line: 544, type: !90, isLocal: false, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !62, size: 32, align: 4, offset: 32)
!91 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !38, line: 544, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !62, size: 32, align: 4, offset: 64)
!93 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !38, line: 544, type: !94, isLocal: false, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !62, size: 32, align: 4, offset: 96)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
