#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 043b3f61bcfd9abe2bd873b16a3eec69.pdb
; shader hash: 043b3f61bcfd9abe2bd873b16a3eec69
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.GenerateGrassStrawsConstantBuffer
;       {
;
;           float2 invActivePatchDim;                 ; Offset:    0
;           float padding1;                           ; Offset:    8
;           float padding2;                           ; Offset:   12
;           struct struct.GenerateGrassStrawsConstantBuffer_AppParams
;           {
;
;               uint2 activePatchDim;                 ; Offset:   16
;               uint2 maxPatchDim;                    ; Offset:   24
;               float2 timeOffset;                    ; Offset:   32
;               float grassHeight;                    ; Offset:   40
;               float grassScale;                     ; Offset:   44
;               float3 patchSize;                     ; Offset:   48
;               float grassThickness;                 ; Offset:   60
;               float3 windDirection;                 ; Offset:   64

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22, globals: !54)
!1 = !DIFile(filename: "SampleCore\5CShaders\5Cutil\5CGenerateGrassStrawsCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 181, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 181, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 181, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 181, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 181, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 183, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 183, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 183, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 183, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !{!23, !34, !41, !46, !51}
!23 = !DISubprogram(name: "main", scope: !1, file: !1, line: 170, type: !24, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !{!33, !21}
!33 = !DITemplateTypeParameter(name: "element", type: !30)
!34 = !DISubprogram(name: "GenerateGrassStraw", linkageName: "\01?GenerateGrassStraw@@YAXIV?$vector@M$01@@V?$vector@M$02@@111Y06M2@Z", scope: !1, file: !1, line: 86, type: !35, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !15, !4, !4, !4, !4, !38, !38}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 187, baseType: !30)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 224, align: 32, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 7)
!41 = !DISubprogram(name: "SeedThread", linkageName: "\01?SeedThread@RNG@@YAII@Z", scope: !43, file: !42, line: 19, type: !44, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DIFile(filename: "./RTAO/shaders\5CRandomNumberGenerator.hlsli", directory: "")
!43 = !DINamespace(name: "RNG", scope: null, file: !42, line: 16)
!44 = !DISubroutineType(types: !45)
!45 = !{!37, !37}
!46 = !DISubprogram(name: "Random01", linkageName: "\01?Random01@RNG@@YAMAIAI@Z", scope: !43, file: !42, line: 42, type: !47, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!8, !49}
!49 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !37)
!51 = !DISubprogram(name: "Random", linkageName: "\01?Random@RNG@@YAIAIAI@Z", scope: !43, file: !42, line: 32, type: !52, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!37, !49}
!54 = !{!55, !61, !66, !67, !69, !71, !76, !77, !79, !91, !95, !107, !133, !135, !137, !139, !141, !143, !148, !149}
!55 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !56, file: !57, line: 506, type: !58, isLocal: true, isDefinition: true)
!56 = !DINamespace(name: "TraceRayParameters", scope: null, file: !57, line: 504)
!57 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !60, line: 20, baseType: !37)
!60 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!61 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !62, file: !57, line: 508, type: !63, isLocal: true, isDefinition: true)
!62 = !DINamespace(name: "HitGroup", scope: !56, file: !57, line: 507)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64, align: 32, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 2)
!66 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !62, file: !57, line: 513, type: !58, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !68, file: !57, line: 516, type: !63, isLocal: true, isDefinition: true)
!68 = !DINamespace(name: "MissShader", scope: !56, file: !57, line: 515)
!69 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !70, file: !57, line: 526, type: !58, isLocal: true, isDefinition: true)
!70 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !57, line: 524)
!71 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !72, file: !57, line: 528, type: !73, isLocal: true, isDefinition: true)
!72 = !DINamespace(name: "HitGroup", scope: !70, file: !57, line: 527)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, align: 32, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !72, file: !57, line: 534, type: !58, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !78, file: !57, line: 537, type: !73, isLocal: true, isDefinition: true)
!78 = !DINamespace(name: "MissShader", scope: !70, file: !57, line: 536)
!79 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !57, line: 544, type: !80, isLocal: true, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !60, line: 17, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 544, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 544, size: 128, align: 32, elements: !84, templateParams: !89)
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !83, file: !1, line: 544, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !83, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !83, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !83, file: !1, line: 544, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!89 = !{!12, !90}
!90 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!91 = !DIGlobalVariable(name: "g_windMap", linkageName: "\01?g_windMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 44, type: !92, isLocal: false, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 44, size: 160, align: 32, elements: !2, templateParams: !93)
!93 = !{!94}
!94 = !DITemplateTypeParameter(name: "element", type: !83)
!95 = !DIGlobalVariable(name: "g_outVertexBuffer", linkageName: "\01?g_outVertexBuffer@@3V?$RWStructuredBuffer@UVertexPositionNormalTextureTangent@@@@A", scope: !0, file: !1, line: 45, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<VertexPositionNormalTextureTangent>", file: !1, line: 45, size: 352, align: 32, elements: !2, templateParams: !97)
!97 = !{!98}
!98 = !DITemplateTypeParameter(name: "element", type: !99)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalTextureTangent", file: !57, line: 479, size: 352, align: 32, elements: !100)
!100 = !{!101, !103, !104, !106}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !99, file: !57, line: 481, baseType: !102, size: 96, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !60, line: 16, baseType: !4)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !99, file: !57, line: 482, baseType: !102, size: 96, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "textureCoordinate", scope: !99, file: !57, line: 483, baseType: !105, size: 64, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT2", file: !60, line: 15, baseType: !15)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !99, file: !57, line: 484, baseType: !102, size: 96, align: 32, offset: 256)
!107 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UGenerateGrassStrawsConstantBuffer@@@@A", scope: !0, file: !1, line: 47, type: !108, isLocal: false, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<GenerateGrassStrawsConstantBuffer>", file: !1, line: 47, size: 32, align: 32, elements: !2, templateParams: !109)
!109 = !{!110}
!110 = !DITemplateTypeParameter(name: "T", type: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenerateGrassStrawsConstantBuffer", file: !57, line: 419, size: 768, align: 32, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "invActivePatchDim", scope: !111, file: !57, line: 421, baseType: !105, size: 64, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "padding1", scope: !111, file: !57, line: 422, baseType: !8, size: 32, align: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "padding2", scope: !111, file: !57, line: 423, baseType: !8, size: 32, align: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !111, file: !57, line: 424, baseType: !117, size: 640, align: 32, offset: 128)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenerateGrassStrawsConstantBuffer_AppParams", file: !57, line: 399, size: 640, align: 32, elements: !118)
!118 = !{!119, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "activePatchDim", scope: !117, file: !57, line: 401, baseType: !120, size: 64, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !60, line: 21, baseType: !26)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "maxPatchDim", scope: !117, file: !57, line: 402, baseType: !120, size: 64, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "timeOffset", scope: !117, file: !57, line: 404, baseType: !105, size: 64, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "grassHeight", scope: !117, file: !57, line: 405, baseType: !8, size: 32, align: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "grassScale", scope: !117, file: !57, line: 406, baseType: !8, size: 32, align: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "patchSize", scope: !117, file: !57, line: 408, baseType: !102, size: 96, align: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "grassThickness", scope: !117, file: !57, line: 409, baseType: !8, size: 32, align: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "windDirection", scope: !117, file: !57, line: 411, baseType: !102, size: 96, align: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "windStrength", scope: !117, file: !57, line: 412, baseType: !8, size: 32, align: 32, offset: 480)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "positionJitterStrength", scope: !117, file: !57, line: 414, baseType: !8, size: 32, align: 32, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "bendStrengthAlongTangent", scope: !117, file: !57, line: 415, baseType: !8, size: 32, align: 32, offset: 544)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !117, file: !57, line: 416, baseType: !132, size: 64, align: 32, offset: 576)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, align: 32, elements: !64)
!133 = !DIGlobalVariable(name: "WrapLinearSampler", linkageName: "\01?WrapLinearSampler@@3USamplerState@@A", scope: !0, file: !1, line: 48, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
!135 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !57, line: 544, type: !136, isLocal: false, isDefinition: true)
!136 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !80, size: 32, align: 4, offset: 96)
!137 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !57, line: 544, type: !138, isLocal: false, isDefinition: true)
!138 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !80, size: 32, align: 4)
!139 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !57, line: 544, type: !140, isLocal: false, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !80, size: 32, align: 4, offset: 32)
!141 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !57, line: 544, type: !142, isLocal: false, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !80, size: 32, align: 4, offset: 64)
!143 = !DIGlobalVariable(name: "GRASS_X", linkageName: "GRASS_X.1dim", scope: !0, file: !1, line: 56, type: !144, isLocal: false, isDefinition: true, variable: [21 x float]* @GRASS_X.1dim)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 672, align: 32, elements: !146)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!146 = !{!147, !40}
!147 = !DISubrange(count: 3)
!148 = !DIGlobalVariable(name: "GRASS_Y", linkageName: "GRASS_Y.1dim", scope: !0, file: !1, line: 65, type: !144, isLocal: false, isDefinition: true, variable: [21 x float]* @GRASS_Y.1dim)
!149 = !DIGlobalVariable(name: "TRIANGLE_INDICES", linkageName: "TRIANGLE_INDICES.v.1dim", scope: !0, file: !1, line: 74, type: !150, isLocal: false, isDefinition: true, variable: [15 x i32]* @TRIANGLE_INDICES.v.1dim)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 480, align: 32, elements: !159)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 74, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 74, size: 96, align: 32, elements: !154, templateParams: !158)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !153, file: !1, line: 74, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !153, file: !1, line: 74, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !153, file: !1, line: 74, baseType: !30, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!158 = !{!33, !13}
!159 = !{!160}
!160 = !DISubrange(count: 5)
!161 = !{i32 2, !"Dwarf Version", i32 4}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
