#if 0
;
; Note: shader requires additional functionality:
;       Double-precision floating point
;       UAVs at every shader stage
;
; shader debug name: 567c69551c6f430c53303cc07da8954a.pdb
; shader hash: 567c69551c6f430c53303cc07da8954a
;
; Buffer Definitions:
;
; cbuffer g_cb
; {
;
;   struct hostlayout.g_cb
;   {
;
;       struct hostlayout.struct.PathtracerConstantBuffer
;       {
;
;           row_major float4x4 projectionToWorldWithCameraAtOrigin;; Offset:    0
;           float3 cameraPosition;                    ; Offset:   64
;           int useBaseAlbedoFromMaterial;            ; Offset:   76
;           float3 lightPosition;                     ; Offset:   80
;           int useNormalMaps;                        ; Offset:   92
;           float3 lightColor;                        ; Offset:   96
;           float defaultAmbientIntensity;            ; Offset:  108
;           row_major float4x4 prevFrameViewProj;     ; Offset:  112
;           row_major float4x4 prevFrameProjToViewCameraAtOrigin;; Offset:  176
;           float3 prevFrameCameraPosition;           ; Offset:  240
;           float padding;                            ; Offset:  252
;           float Znear;                              ; Offset:  256
;           float Zfar;                               ; Offset:  260
;           uint maxRadianceRayRecursionDepth;        ; Offset:  264
;           uint maxShadowRayRecursionDepth;          ; Offset:  268
;       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !76, globals: !493)
!1 = !DIFile(filename: "SampleCore\5CShaders\5CPathtracer.hlsl", directory: "")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", scope: !5, file: !4, line: 437, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!5 = !DINamespace(name: "MaterialType", scope: null, file: !4, line: 436)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "Default", value: 0)
!8 = !DIEnumerator(name: "Matte", value: 1)
!9 = !DIEnumerator(name: "Mirror", value: 2)
!10 = !DIEnumerator(name: "AnalyticalCheckerboardTexture", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !12, file: !4, line: 489, size: 32, align: 32, elements: !13)
!12 = !DINamespace(name: "PathtracerRayType", scope: null, file: !4, line: 488)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "Radiance", value: 0)
!15 = !DIEnumerator(name: "Shadow", value: 1)
!16 = !DIEnumerator(name: "Count", value: 2)
!17 = !{!18, !28, !38, !39, !54, !61, !32, !67}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 50, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 50, size: 64, align: 32, elements: !20, templateParams: !24)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !19, file: !1, line: 50, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !19, file: !1, line: 50, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!24 = !{!25, !26}
!25 = !DITemplateTypeParameter(name: "element", type: !22)
!26 = !DITemplateValueParameter(name: "element_count", type: !27, value: i32 2)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 29, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 29, size: 96, align: 32, elements: !30, templateParams: !35)
!30 = !{!31, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 29, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 29, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 29, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!36, !37}
!36 = !DITemplateTypeParameter(name: "element", type: !32)
!37 = !DITemplateValueParameter(name: "element_count", type: !27, value: i32 3)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 34, baseType: !22)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 479, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 479, size: 288, align: 32, elements: !41, templateParams: !51)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !{!36, !52, !53}
!52 = !DITemplateValueParameter(name: "row_count", type: !27, value: i32 3)
!53 = !DITemplateValueParameter(name: "col_count", type: !27, value: i32 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 60, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 60, size: 64, align: 32, elements: !56, templateParams: !59)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !55, file: !1, line: 60, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !55, file: !1, line: 60, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !{!60, !26}
!60 = !DITemplateTypeParameter(name: "element", type: !27)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 20, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 20, size: 64, align: 32, elements: !63, templateParams: !66)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !62, file: !1, line: 20, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !62, file: !1, line: 20, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !{!36, !26}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 153, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 153, size: 128, align: 32, elements: !69, templateParams: !74)
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!74 = !{!36, !75}
!75 = !DITemplateValueParameter(name: "element_count", type: !27, value: i32 4)
!76 = !{!77, !83, !87, !90, !93, !96, !99, !102, !109, !112, !115, !120, !123, !126, !127, !130, !131, !134, !143, !147, !150, !177, !180, !183, !186, !187, !190, !193, !196, !197, !198, !201, !202, !205, !208, !211, !214, !217, !220, !223, !224, !225, !228, !231, !232, !233, !236, !239, !240, !241, !244, !247, !262, !265, !268, !271, !280, !284, !287, !288, !291, !294, !297, !300, !303, !306, !309, !312, !315, !318, !319, !322, !326, !329, !334, !337, !341, !344, !349, !353, !355, !359, !363, !366, !370, !373, !374, !375, !403, !406, !410, !413, !430, !433, !437, !438, !441, !458, !461, !471, !474, !481, !484, !487, !490}
!77 = !DISubprogram(name: "HasAORayHitAnyGeometry", linkageName: "\01?HasAORayHitAnyGeometry@RTAO@@YA_NM@Z", scope: !79, file: !78, line: 17, type: !80, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!79 = !DINamespace(name: "RTAO", scope: null, file: !78, line: 14)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !32}
!82 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!83 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$01@@@Z", scope: !84, file: !84, line: 26, type: !85, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!85 = !DISubroutineType(types: !86)
!86 = !{!32, !61}
!87 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$02@@@Z", scope: !84, file: !84, line: 31, type: !88, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!32, !28}
!90 = !DISubprogram(name: "Float2ToHalf", linkageName: "\01?Float2ToHalf@@YAIV?$vector@M$01@@@Z", scope: !84, file: !84, line: 36, type: !91, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!38, !61}
!93 = !DISubprogram(name: "HalfToFloat2", linkageName: "\01?HalfToFloat2@@YA?AV?$vector@M$01@@I@Z", scope: !84, file: !84, line: 44, type: !94, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!61, !38}
!96 = !DISubprogram(name: "EncodeMaterial16b", linkageName: "\01?EncodeMaterial16b@@YA?AV?$vector@I$01@@IV?$vector@M$02@@@Z", scope: !84, file: !84, line: 52, type: !97, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!18, !38, !28}
!99 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@H$01@@0@Z", scope: !84, file: !84, line: 62, type: !100, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!82, !54, !54}
!102 = !DISubprogram(name: "DecodeMaterial16b", linkageName: "\01?DecodeMaterial16b@@YAXV?$vector@I$01@@AIAIAIAV?$vector@M$02@@@Z", scope: !84, file: !84, line: 67, type: !103, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !18, !105, !107}
!105 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !38)
!107 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !28)
!109 = !DISubprogram(name: "RemapToRange", linkageName: "\01?RemapToRange@@YAMMMM@Z", scope: !84, file: !84, line: 75, type: !110, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!110 = !DISubroutineType(types: !111)
!111 = !{!32, !32, !32, !32}
!112 = !DISubprogram(name: "CalculateAnimationInterpolant", linkageName: "\01?CalculateAnimationInterpolant@@YAMMM@Z", scope: !84, file: !84, line: 81, type: !113, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false)
!113 = !DISubroutineType(types: !114)
!114 = !{!32, !32, !32}
!115 = !DISubprogram(name: "swap", linkageName: "\01?swap@@YAXAIAM0@Z", scope: !84, file: !84, line: 88, type: !116, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118, !118}
!118 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !32)
!120 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NIIM@Z", scope: !84, file: !84, line: 95, type: !121, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!121 = !DISubroutineType(types: !122)
!122 = !{!82, !38, !38, !32}
!123 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NMMM@Z", scope: !84, file: !84, line: 100, type: !124, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!124 = !DISubroutineType(types: !125)
!125 = !{!82, !32, !32, !32}
!126 = !DISubprogram(name: "RGBtoLuminance", linkageName: "\01?RGBtoLuminance@@YAMV?$vector@M$02@@@Z", scope: !84, file: !84, line: 105, type: !88, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!127 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !84, file: !84, line: 144, type: !128, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false)
!128 = !DISubroutineType(types: !129)
!129 = !{!28}
!130 = !DISubprogram(name: "HitObjectPosition", linkageName: "\01?HitObjectPosition@@YA?AV?$vector@M$02@@XZ", scope: !84, file: !84, line: 150, type: !128, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!131 = !DISubprogram(name: "ClipSpaceToTexturePosition", linkageName: "\01?ClipSpaceToTexturePosition@@YA?AV?$vector@M$01@@V?$vector@M$03@@@Z", scope: !84, file: !84, line: 155, type: !132, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!61, !67}
!134 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !84, file: !84, line: 164, type: !135, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!28, !137, !140}
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 288, align: 32, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 161, size: 64, align: 32, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !140, file: !1, line: 161, baseType: !62, size: 64, align: 32)
!143 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$01@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !84, file: !84, line: 172, type: !144, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false)
!144 = !DISubroutineType(types: !145)
!145 = !{!61, !146, !140}
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, align: 32, elements: !138)
!147 = !DISubprogram(name: "TexCoords", linkageName: "\01?TexCoords@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !84, file: !84, line: 229, type: !148, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: false)
!148 = !DISubroutineType(types: !149)
!149 = !{!61, !28}
!150 = !DISubprogram(name: "CalculateRayDifferentials", linkageName: "\01?CalculateRayDifferentials@@YAXAIAV?$vector@M$01@@0V1@V?$vector@M$02@@22V?$matrix@M$03$03@@@Z", scope: !84, file: !84, line: 235, type: !151, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153, !153, !61, !28, !28, !28, !155}
!153 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !61)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 232, baseType: !156)
!156 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 232, size: 512, align: 32, elements: !157, templateParams: !174)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!174 = !{!36, !175, !176}
!175 = !DITemplateValueParameter(name: "row_count", type: !27, value: i32 4)
!176 = !DITemplateValueParameter(name: "col_count", type: !27, value: i32 4)
!177 = !DISubprogram(name: "AnalyticalCheckersGridTexture", linkageName: "\01?AnalyticalCheckersGridTexture@@YAMV?$vector@M$02@@00V?$matrix@M$03$03@@@Z", scope: !84, file: !84, line: 254, type: !178, isLocal: false, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: false)
!178 = !DISubroutineType(types: !179)
!179 = !{!32, !28, !28, !28, !155}
!180 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !84, file: !84, line: 265, type: !181, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false)
!181 = !DISubroutineType(types: !182)
!182 = !{!28, !28, !28, !28}
!183 = !DISubprogram(name: "RemoveSRGB", linkageName: "\01?RemoveSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !84, file: !84, line: 271, type: !184, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: false)
!184 = !DISubroutineType(types: !185)
!185 = !{!28, !28}
!186 = !DISubprogram(name: "ApplySRGB", linkageName: "\01?ApplySRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !84, file: !84, line: 276, type: !184, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false)
!187 = !DISubprogram(name: "SmallestPowerOf2GreaterThan", linkageName: "\01?SmallestPowerOf2GreaterThan@@YAII@Z", scope: !84, file: !84, line: 281, type: !188, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false)
!188 = !DISubroutineType(types: !189)
!189 = !{!38, !38}
!190 = !DISubprogram(name: "FloatPrecision", linkageName: "\01?FloatPrecision@@YAMMI@Z", scope: !84, file: !84, line: 300, type: !191, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false)
!191 = !DISubroutineType(types: !192)
!192 = !{!32, !32, !38}
!193 = !DISubprogram(name: "FloatPrecisionR10", linkageName: "\01?FloatPrecisionR10@@YAMM@Z", scope: !84, file: !84, line: 311, type: !194, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false)
!194 = !DISubroutineType(types: !195)
!195 = !{!32, !32}
!196 = !DISubprogram(name: "FloatPrecisionR16", linkageName: "\01?FloatPrecisionR16@@YAMM@Z", scope: !84, file: !84, line: 316, type: !194, isLocal: false, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: false)
!197 = !DISubprogram(name: "FloatPrecisionR32", linkageName: "\01?FloatPrecisionR32@@YAMM@Z", scope: !84, file: !84, line: 321, type: !194, isLocal: false, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: false)
!198 = !DISubprogram(name: "OctWrap", linkageName: "\01?OctWrap@@YA?AV?$vector@M$01@@V1@@Z", scope: !84, file: !84, line: 330, type: !199, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false)
!199 = !DISubroutineType(types: !200)
!200 = !{!61, !61}
!201 = !DISubprogram(name: "EncodeNormal", linkageName: "\01?EncodeNormal@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !84, file: !84, line: 336, type: !148, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false)
!202 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !84, file: !84, line: 344, type: !203, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!203 = !DISubroutineType(types: !204)
!204 = !{!28, !61}
!205 = !DISubprogram(name: "Pack_R8_FLOAT", linkageName: "\01?Pack_R8_FLOAT@@YAIM@Z", scope: !84, file: !84, line: 359, type: !206, isLocal: false, isDefinition: true, scopeLine: 360, flags: DIFlagPrototyped, isOptimized: false)
!206 = !DISubroutineType(types: !207)
!207 = !{!38, !32}
!208 = !DISubprogram(name: "Unpack_R8_FLOAT", linkageName: "\01?Unpack_R8_FLOAT@@YAMI@Z", scope: !84, file: !84, line: 364, type: !209, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false)
!209 = !DISubroutineType(types: !210)
!210 = !{!32, !38}
!211 = !DISubprogram(name: "Pack_R8G8_to_R16_UINT", linkageName: "\01?Pack_R8G8_to_R16_UINT@@YAIII@Z", scope: !84, file: !84, line: 370, type: !212, isLocal: false, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: false)
!212 = !DISubroutineType(types: !213)
!213 = !{!38, !38, !38}
!214 = !DISubprogram(name: "Unpack_R16_to_R8G8_UINT", linkageName: "\01?Unpack_R16_to_R8G8_UINT@@YAXIAIAI0@Z", scope: !84, file: !84, line: 375, type: !215, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !38, !105, !105}
!217 = !DISubprogram(name: "Pack_R8G8B16_FLOAT", linkageName: "\01?Pack_R8G8B16_FLOAT@@YAIV?$vector@M$02@@@Z", scope: !84, file: !84, line: 385, type: !218, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: false)
!218 = !DISubroutineType(types: !219)
!219 = !{!38, !28}
!220 = !DISubprogram(name: "Unpack_R8G8B16_FLOAT", linkageName: "\01?Unpack_R8G8B16_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !84, file: !84, line: 393, type: !221, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false)
!221 = !DISubroutineType(types: !222)
!222 = !{!28, !38}
!223 = !DISubprogram(name: "NormalizedFloat3ToByte3", linkageName: "\01?NormalizedFloat3ToByte3@@YAIV?$vector@M$02@@@Z", scope: !84, file: !84, line: 401, type: !218, isLocal: false, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: false)
!224 = !DISubprogram(name: "Byte3ToNormalizedFloat3", linkageName: "\01?Byte3ToNormalizedFloat3@@YA?AV?$vector@M$02@@I@Z", scope: !84, file: !84, line: 409, type: !221, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: false)
!225 = !DISubprogram(name: "EncodeNormalDepth_N16D16", linkageName: "\01?EncodeNormalDepth_N16D16@@YAIV?$vector@M$02@@M@Z", scope: !84, file: !84, line: 418, type: !226, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: false)
!226 = !DISubroutineType(types: !227)
!227 = !{!38, !28, !32}
!228 = !DISubprogram(name: "DecodeNormalDepth_N16D16", linkageName: "\01?DecodeNormalDepth_N16D16@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !84, file: !84, line: 426, type: !229, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !38, !107, !118}
!231 = !DISubprogram(name: "EncodeNormalDepth", linkageName: "\01?EncodeNormalDepth@@YAIV?$vector@M$02@@M@Z", scope: !84, file: !84, line: 433, type: !226, isLocal: false, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: false)
!232 = !DISubprogram(name: "DecodeNormalDepth", linkageName: "\01?DecodeNormalDepth@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !84, file: !84, line: 438, type: !229, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false)
!233 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YAXIAIAV?$vector@M$02@@@Z", scope: !84, file: !84, line: 443, type: !234, isLocal: false, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: false)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !38, !107}
!236 = !DISubprogram(name: "UnpackEncodedNormalDepth", linkageName: "\01?UnpackEncodedNormalDepth@@YAXIAIAV?$vector@M$01@@AIAM@Z", scope: !84, file: !84, line: 449, type: !237, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: false)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !38, !153, !118}
!239 = !DISubprogram(name: "hash", linkageName: "\01?hash@@YAMV?$vector@M$02@@@Z", scope: !84, file: !84, line: 462, type: !88, isLocal: false, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: false)
!240 = !DISubprogram(name: "BumpMapNormalToWorldSpaceNormal", linkageName: "\01?BumpMapNormalToWorldSpaceNormal@@YA?AV?$vector@M$02@@V1@00@Z", scope: !84, file: !84, line: 472, type: !181, isLocal: false, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: false)
!241 = !DISubprogram(name: "CalculateTangent", linkageName: "\01?CalculateTangent@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@11@Z", scope: !84, file: !84, line: 486, type: !242, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: false)
!242 = !DISubroutineType(types: !243)
!243 = !{!28, !28, !28, !28, !61, !61, !61}
!244 = !DISubprogram(name: "RayPlaneIntersection", linkageName: "\01?RayPlaneIntersection@@YA?AV?$vector@M$02@@V1@000@Z", scope: !84, file: !84, line: 501, type: !245, isLocal: false, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: false)
!245 = !DISubroutineType(types: !246)
!246 = !{!28, !28, !28, !28, !28}
!247 = !DISubprogram(name: "Inverse2x2", linkageName: "\01?Inverse2x2@@YA_NV?$matrix@M$01$01@@AIAV1@@Z", scope: !84, file: !84, line: 508, type: !248, isLocal: false, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false)
!248 = !DISubroutineType(types: !249)
!249 = !{!82, !250, !260}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x2", file: !1, line: 506, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 2>", file: !1, line: 506, size: 128, align: 32, elements: !252, templateParams: !257)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!257 = !{!36, !258, !259}
!258 = !DITemplateValueParameter(name: "row_count", type: !27, value: i32 2)
!259 = !DITemplateValueParameter(name: "col_count", type: !27, value: i32 2)
!260 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !250)
!262 = !DISubprogram(name: "CalculateTrianglePartialDerivatives", linkageName: "\01?CalculateTrianglePartialDerivatives@@YAXV?$vector@M$01@@00V?$vector@M$02@@11AIAV2@2@Z", scope: !84, file: !84, line: 537, type: !263, isLocal: false, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: false)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !61, !61, !61, !28, !28, !28, !107, !107}
!265 = !DISubprogram(name: "CalculateUVDerivatives", linkageName: "\01?CalculateUVDerivatives@@YAXV?$vector@M$02@@00000AIAV?$vector@M$01@@1@Z", scope: !84, file: !84, line: 571, type: !266, isLocal: false, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: false)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !28, !28, !28, !28, !28, !28, !153, !153}
!268 = !DISubprogram(name: "CalculateUVDerivatives", linkageName: "\01?CalculateUVDerivatives@@YAXV?$vector@M$01@@V?$vector@M$02@@11110001V?$matrix@M$03$03@@AIAV1@3@Z", scope: !84, file: !84, line: 603, type: !269, isLocal: false, isDefinition: true, scopeLine: 609, flags: DIFlagPrototyped, isOptimized: false)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !61, !28, !28, !28, !28, !28, !61, !61, !61, !28, !155, !153, !153}
!271 = !DISubprogram(name: "CalculateUVDerivatives", linkageName: "\01?CalculateUVDerivatives@@YAXV?$vector@M$02@@V?$vector@M$01@@0000URay@@21110V?$matrix@M$03$03@@AIAV2@4AIAV1@5@Z", scope: !84, file: !84, line: 622, type: !272, isLocal: false, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: false)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !28, !61, !28, !28, !28, !28, !274, !274, !61, !61, !61, !28, !155, !153, !153, !107, !107}
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !4, line: 74, size: 192, align: 32, elements: !275)
!275 = !{!276, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !274, file: !4, line: 76, baseType: !277, size: 96, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !278, line: 16, baseType: !28)
!278 = !DIFile(filename: "SampleCore\5CShaders/HlslCompat.hlsli", directory: "")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !274, file: !4, line: 77, baseType: !277, size: 96, align: 32, offset: 96)
!280 = !DISubprogram(name: "GetAuxilaryCameraRays", linkageName: "\01?GetAuxilaryCameraRays@@YAXV?$vector@M$02@@V?$matrix@M$03$03@@URay@@2@Z", scope: !84, file: !84, line: 638, type: !281, isLocal: false, isDefinition: true, scopeLine: 639, flags: DIFlagPrototyped, isOptimized: false)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !28, !155, !283, !283}
!283 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !274)
!284 = !DISubprogram(name: "min4", linkageName: "\01?min4@@YAMV?$vector@M$03@@@Z", scope: !84, file: !84, line: 644, type: !285, isLocal: false, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false)
!285 = !DISubroutineType(types: !286)
!286 = !{!32, !67}
!287 = !DISubprogram(name: "max4", linkageName: "\01?max4@@YAMV?$vector@M$03@@@Z", scope: !84, file: !84, line: 649, type: !285, isLocal: false, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: false)
!288 = !DISubprogram(name: "Get2DQuadIndexOffset", linkageName: "\01?Get2DQuadIndexOffset@@YA?AV?$vector@I$01@@I@Z", scope: !84, file: !84, line: 654, type: !289, isLocal: false, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: false)
!289 = !DISubroutineType(types: !290)
!290 = !{!18, !38}
!291 = !DISubprogram(name: "GetIndexOfValueClosestToTheReference", linkageName: "\01?GetIndexOfValueClosestToTheReference@@YAIMV?$vector@M$01@@@Z", scope: !84, file: !84, line: 660, type: !292, isLocal: false, isDefinition: true, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: false)
!292 = !DISubroutineType(types: !293)
!293 = !{!38, !32, !61}
!294 = !DISubprogram(name: "GetIndexOfValueClosestToTheReference", linkageName: "\01?GetIndexOfValueClosestToTheReference@@YAIMV?$vector@M$03@@@Z", scope: !84, file: !84, line: 669, type: !295, isLocal: false, isDefinition: true, scopeLine: 670, flags: DIFlagPrototyped, isOptimized: false)
!295 = !DISubroutineType(types: !296)
!296 = !{!38, !32, !67}
!297 = !DISubprogram(name: "RemapDdxy", linkageName: "\01?RemapDdxy@@YA?AV?$vector@M$01@@MV1@0@Z", scope: !84, file: !84, line: 681, type: !298, isLocal: false, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false)
!298 = !DISubroutineType(types: !299)
!299 = !{!61, !32, !61, !61}
!300 = !DISubprogram(name: "GetDepthAtPixelOffset", linkageName: "\01?GetDepthAtPixelOffset@@YAMMV?$vector@M$01@@0@Z", scope: !84, file: !84, line: 695, type: !301, isLocal: false, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: false)
!301 = !DISubroutineType(types: !302)
!302 = !{!32, !32, !61, !61}
!303 = !DISubprogram(name: "ApproximateProjectedSurfaceDimensionsPerPixel", linkageName: "\01?ApproximateProjectedSurfaceDimensionsPerPixel@@YA?AV?$vector@M$01@@MV1@M@Z", scope: !84, file: !84, line: 706, type: !304, isLocal: false, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: false)
!304 = !DISubroutineType(types: !305)
!305 = !{!61, !32, !61, !32}
!306 = !DISubprogram(name: "InterpolateValidValues", linkageName: "\01?InterpolateValidValues@@YAMV?$vector@M$03@@0MM@Z", scope: !84, file: !84, line: 719, type: !307, isLocal: false, isDefinition: true, scopeLine: 724, flags: DIFlagPrototyped, isOptimized: false)
!307 = !DISubroutineType(types: !308)
!308 = !{!32, !67, !67, !32, !32}
!309 = !DISubprogram(name: "SeedThread", linkageName: "\01?SeedThread@RNG@@YAII@Z", scope: !311, file: !310, line: 19, type: !188, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!310 = !DIFile(filename: "./RTAO/shaders\5CRandomNumberGenerator.hlsli", directory: "")
!311 = !DINamespace(name: "RNG", scope: null, file: !310, line: 16)
!312 = !DISubprogram(name: "Random", linkageName: "\01?Random@RNG@@YAIAIAI@Z", scope: !311, file: !310, line: 32, type: !313, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!313 = !DISubroutineType(types: !314)
!314 = !{!38, !105}
!315 = !DISubprogram(name: "Random01", linkageName: "\01?Random01@RNG@@YAMAIAI@Z", scope: !311, file: !310, line: 42, type: !316, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!316 = !DISubroutineType(types: !317)
!317 = !{!32, !105}
!318 = !DISubprogram(name: "Random01inclusive", linkageName: "\01?Random01inclusive@RNG@@YAMAIAI@Z", scope: !311, file: !310, line: 48, type: !316, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!319 = !DISubprogram(name: "Random", linkageName: "\01?Random@RNG@@YAIAIAIII@Z", scope: !311, file: !310, line: 55, type: !320, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!320 = !DISubroutineType(types: !321)
!321 = !{!38, !105, !38, !38}
!322 = !DISubprogram(name: "CheckersTextureBoxFilter", linkageName: "\01?CheckersTextureBoxFilter@@YAMV?$vector@M$01@@00@Z", scope: !323, file: !323, line: 48, type: !324, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!323 = !DIFile(filename: "./SampleCore/shaders/util\5CAnalyticalTextures.hlsli", directory: "")
!324 = !DISubroutineType(types: !325)
!325 = !{!32, !61, !61, !61}
!326 = !DISubprogram(name: "CheckersGridTextureBoxFilter", linkageName: "\01?CheckersGridTextureBoxFilter@@YAMV?$vector@M$01@@00I@Z", scope: !323, file: !323, line: 63, type: !327, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!327 = !DISubroutineType(types: !328)
!328 = !{!32, !61, !61, !61, !38}
!329 = !DISubprogram(name: "IsBlack", linkageName: "\01?IsBlack@BxDF@@YA_NV?$vector@M$02@@@Z", scope: !331, file: !330, line: 43, type: !332, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!330 = !DIFile(filename: "SampleCore\5CShaders/BxDF.hlsli", directory: "")
!331 = !DINamespace(name: "BxDF", scope: null, file: !330, line: 39)
!332 = !DISubroutineType(types: !333)
!333 = !{!82, !28}
!334 = !DISubprogram(name: "F", linkageName: "\01?F@Lambert@Diffuse@BxDF@@YA?AV?$vector@M$02@@V4@@Z", scope: !335, file: !330, line: 52, type: !184, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!335 = !DINamespace(name: "Lambert", scope: !336, file: !330, line: 50)
!336 = !DINamespace(name: "Diffuse", scope: !331, file: !330, line: 48)
!337 = !DISubprogram(name: "F", linkageName: "\01?F@Hammon@Diffuse@BxDF@@YA?AV?$vector@M$02@@V4@M0000@Z", scope: !338, file: !330, line: 62, type: !339, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!338 = !DINamespace(name: "Hammon", scope: !336, file: !330, line: 58)
!339 = !DISubroutineType(types: !340)
!340 = !{!28, !28, !32, !28, !28, !28, !28}
!341 = !DISubprogram(name: "Fresnel", linkageName: "\01?Fresnel@BxDF@@YA?AV?$vector@M$02@@V2@M@Z", scope: !331, file: !330, line: 92, type: !342, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!342 = !DISubroutineType(types: !343)
!343 = !{!28, !28, !32}
!344 = !DISubprogram(name: "Sample_Fr", linkageName: "\01?Sample_Fr@Reflection@Specular@BxDF@@YA?AV?$vector@M$02@@V4@AIAV4@00@Z", scope: !345, file: !330, line: 106, type: !347, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false)
!345 = !DINamespace(name: "Reflection", scope: !346, file: !330, line: 100)
!346 = !DINamespace(name: "Specular", scope: !331, file: !330, line: 97)
!347 = !DISubroutineType(types: !348)
!348 = !{!28, !28, !107, !28, !28}
!349 = !DISubprogram(name: "IsTotalInternalReflection", linkageName: "\01?IsTotalInternalReflection@Reflection@Specular@BxDF@@YAHV?$vector@M$02@@0@Z", scope: !345, file: !330, line: 115, type: !350, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !28, !28}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !278, line: 24, baseType: !27)
!353 = !DISubprogram(name: "Sample_Ft", linkageName: "\01?Sample_Ft@Transmission@Specular@BxDF@@YA?AV?$vector@M$02@@V4@AIAV4@00@Z", scope: !354, file: !330, line: 135, type: !347, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false)
!354 = !DINamespace(name: "Transmission", scope: !346, file: !330, line: 129)
!355 = !DISubprogram(name: "F", linkageName: "\01?F@GGX@Specular@BxDF@@YA?AV?$vector@M$02@@MV4@000@Z", scope: !356, file: !330, line: 150, type: !357, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!356 = !DINamespace(name: "GGX", scope: !346, file: !330, line: 147)
!357 = !DISubroutineType(types: !358)
!358 = !{!28, !32, !28, !28, !28, !28}
!359 = !DISubprogram(name: "Shade", linkageName: "\01?Shade@DirectLighting@BxDF@@YA?AV?$vector@M$02@@W4Type@MaterialType@@V3@11_NM111@Z", scope: !360, file: !330, line: 195, type: !361, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: false)
!360 = !DINamespace(name: "DirectLighting", scope: !331, file: !330, line: 191)
!361 = !DISubroutineType(types: !362)
!362 = !{!28, !3, !28, !28, !28, !82, !32, !28, !28, !28}
!363 = !DISubprogram(name: "Shade", linkageName: "\01?Shade@BxDF@@YA?AV?$vector@M$02@@W4Type@MaterialType@@V2@11_NMM111@Z", scope: !331, file: !330, line: 238, type: !364, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false)
!364 = !DISubroutineType(types: !365)
!365 = !{!28, !3, !28, !28, !28, !82, !32, !32, !28, !28, !28}
!366 = !DISubprogram(name: "GetPlaneConstant", linkageName: "\01?GetPlaneConstant@@YAMV?$vector@M$02@@0@Z", scope: !367, file: !367, line: 18, type: !368, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false)
!367 = !DIFile(filename: "SampleCore\5CShaders/MotionVector.hlsli", directory: "")
!368 = !DISubroutineType(types: !369)
!369 = !{!32, !28, !28}
!370 = !DISubprogram(name: "IsPointOnTheNormalSideOfPlane", linkageName: "\01?IsPointOnTheNormalSideOfPlane@@YA_NV?$vector@M$02@@00@Z", scope: !367, file: !367, line: 25, type: !371, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!371 = !DISubroutineType(types: !372)
!372 = !{!82, !28, !28, !28}
!373 = !DISubprogram(name: "ReflectPointThroughPlane", linkageName: "\01?ReflectPointThroughPlane@@YA?AV?$vector@M$02@@V1@00@Z", scope: !367, file: !367, line: 31, type: !181, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!374 = !DISubprogram(name: "ReflectFrontPointThroughPlane", linkageName: "\01?ReflectFrontPointThroughPlane@@YA?AV?$vector@M$02@@V1@00@Z", scope: !367, file: !367, line: 62, type: !181, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!375 = !DISubprogram(name: "GetWorldHitPositionInPreviousFrame", linkageName: "\01?GetWorldHitPositionInPreviousFrame@@YA?AV?$vector@M$02@@V1@IV?$vector@I$02@@UBuiltInTriangleIntersectionAttributes@@AIAV?$matrix@M$02$03@@@Z", scope: !367, file: !367, line: 75, type: !376, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false)
!376 = !DISubroutineType(types: !377)
!377 = !{!28, !28, !38, !378, !140, !385}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 73, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 73, size: 96, align: 32, elements: !380, templateParams: !384)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !379, file: !1, line: 73, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !379, file: !1, line: 73, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !379, file: !1, line: 73, baseType: !22, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!384 = !{!25, !37}
!385 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x4", file: !1, line: 73, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 4>", file: !1, line: 73, size: 384, align: 32, elements: !389, templateParams: !402)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !388, file: !1, line: 73, baseType: !32, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!402 = !{!36, !52, !176}
!403 = !DISubprogram(name: "CalculateMotionVector", linkageName: "\01?CalculateMotionVector@@YA?AV?$vector@M$01@@V?$vector@M$02@@AIAMV?$vector@I$01@@@Z", scope: !367, file: !367, line: 105, type: !404, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!404 = !DISubroutineType(types: !405)
!405 = !{!61, !28, !118, !18}
!406 = !DISubprogram(name: "TraceShadowRayAndReportIfHit", linkageName: "\01?TraceShadowRayAndReportIfHit@@YA_NAIAMURay@@I_NM@Z", scope: !1, file: !1, line: 68, type: !407, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!407 = !DISubroutineType(types: !408)
!408 = !{!82, !118, !274, !409, !82, !32}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !278, line: 20, baseType: !38)
!410 = !DISubprogram(name: "TraceShadowRayAndReportIfHit", linkageName: "\01?TraceShadowRayAndReportIfHit@@YA_NAIAMURay@@V?$vector@M$02@@I_NM@Z", scope: !1, file: !1, line: 118, type: !411, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false)
!411 = !DISubroutineType(types: !412)
!412 = !{!82, !118, !274, !28, !409, !82, !32}
!413 = !DISubprogram(name: "TraceShadowRayAndReportIfHit", linkageName: "\01?TraceShadowRayAndReportIfHit@@YA_NV?$vector@M$02@@00UPathtracerRayPayload@@M@Z", scope: !1, file: !1, line: 128, type: !414, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!414 = !DISubroutineType(types: !415)
!415 = !{!82, !28, !28, !28, !416, !32}
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathtracerRayPayload", file: !4, line: 101, size: 512, align: 32, elements: !417)
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rayRecursionDepth", scope: !416, file: !4, line: 103, baseType: !409, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "radiance", scope: !416, file: !4, line: 104, baseType: !277, size: 96, align: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "AOGBuffer", scope: !416, file: !4, line: 105, baseType: !421, size: 384, align: 32, offset: 128)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AmbientOcclusionGBuffer", file: !4, line: 82, size: 384, align: 32, elements: !422)
!422 = !{!423, !424, !425, !426, !428, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tHit", scope: !421, file: !4, line: 84, baseType: !32, size: 32, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hitPosition", scope: !421, file: !4, line: 85, baseType: !277, size: 96, align: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseByte3", scope: !421, file: !4, line: 86, baseType: !409, size: 32, align: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "encodedNormal", scope: !421, file: !4, line: 90, baseType: !427, size: 64, align: 32, offset: 160)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT2", file: !278, line: 15, baseType: !61)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_virtualHitPosition", scope: !421, file: !4, line: 93, baseType: !277, size: 96, align: 32, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_encodedNormal", scope: !421, file: !4, line: 97, baseType: !427, size: 64, align: 32, offset: 320)
!430 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AUPathtracerRayPayload@@URay@@IMMM_N@Z", scope: !1, file: !1, line: 136, type: !431, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!431 = !DISubroutineType(types: !432)
!432 = !{!416, !274, !409, !32, !32, !32, !82}
!433 = !DISubprogram(name: "TraceReflectedGBufferRay", linkageName: "\01?TraceReflectedGBufferRay@@YA?AV?$vector@M$02@@V1@000UPathtracerRayPayload@@M@Z", scope: !1, file: !1, line: 175, type: !434, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false)
!434 = !DISubroutineType(types: !435)
!435 = !{!28, !28, !28, !28, !28, !436, !32}
!436 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !416)
!437 = !DISubprogram(name: "TraceRefractedGBufferRay", linkageName: "\01?TraceRefractedGBufferRay@@YA?AV?$vector@M$02@@V1@000UPathtracerRayPayload@@M@Z", scope: !1, file: !1, line: 212, type: !434, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false)
!438 = !DISubprogram(name: "UpdateAOGBufferOnLargerDiffuseComponent", linkageName: "\01?UpdateAOGBufferOnLargerDiffuseComponent@@YAXUPathtracerRayPayload@@U1@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 250, type: !439, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !436, !416, !28}
!441 = !DISubprogram(name: "Shade", linkageName: "\01?Shade@@YA?AV?$vector@M$02@@UPathtracerRayPayload@@V1@11UPrimitiveMaterialBuffer@@@Z", scope: !1, file: !1, line: 264, type: !442, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false)
!442 = !DISubroutineType(types: !443)
!443 = !{!28, !436, !28, !28, !28, !444}
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveMaterialBuffer", file: !4, line: 445, size: 768, align: 32, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Kd", scope: !444, file: !4, line: 447, baseType: !277, size: 96, align: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Ks", scope: !444, file: !4, line: 448, baseType: !277, size: 96, align: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Kr", scope: !444, file: !4, line: 449, baseType: !277, size: 96, align: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Kt", scope: !444, file: !4, line: 450, baseType: !277, size: 96, align: 32, offset: 288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !444, file: !4, line: 451, baseType: !277, size: 96, align: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "eta", scope: !444, file: !4, line: 452, baseType: !277, size: 96, align: 32, offset: 480)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !444, file: !4, line: 453, baseType: !32, size: 32, align: 32, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "hasDiffuseTexture", scope: !444, file: !4, line: 454, baseType: !352, size: 32, align: 32, offset: 608)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hasNormalTexture", scope: !444, file: !4, line: 455, baseType: !352, size: 32, align: 32, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "hasPerVertexTangents", scope: !444, file: !4, line: 456, baseType: !352, size: 32, align: 32, offset: 672)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !444, file: !4, line: 457, baseType: !3, size: 32, align: 32, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !444, file: !4, line: 458, baseType: !32, size: 32, align: 32, offset: 736)
!458 = !DISubprogram(name: "MyRayGenShader_RadianceRay", linkageName: "\01?MyRayGenShader_RadianceRay@@YAXXZ", scope: !1, file: !1, line: 363, type: !459, isLocal: false, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRayGenShader_RadianceRay@@YAXXZ")
!459 = !DISubroutineType(types: !460)
!460 = !{null}
!461 = !DISubprogram(name: "NormalMap", linkageName: "\01?NormalMap@@YA?AV?$vector@M$02@@V1@V?$vector@M$01@@Y02UVertexPositionNormalTextureTangent@@UPrimitiveMaterialBuffer@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 417, type: !462, isLocal: false, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false)
!462 = !DISubroutineType(types: !463)
!463 = !{!28, !28, !61, !464, !444, !140}
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 1056, align: 32, elements: !138)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalTextureTangent", file: !4, line: 479, size: 352, align: 32, elements: !466)
!466 = !{!467, !468, !469, !470}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !465, file: !4, line: 481, baseType: !277, size: 96, align: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !465, file: !4, line: 482, baseType: !277, size: 96, align: 32, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "textureCoordinate", scope: !465, file: !4, line: 483, baseType: !427, size: 64, align: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !465, file: !4, line: 484, baseType: !277, size: 96, align: 32, offset: 256)
!471 = !DISubprogram(name: "MyClosestHitShader_RadianceRay", linkageName: "\01?MyClosestHitShader_RadianceRay@@YAXUPathtracerRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 447, type: !472, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.PathtracerRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader_RadianceRay@@YAXUPathtracerRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!472 = !DISubroutineType(types: !473)
!473 = !{null, !436, !140}
!474 = !DISubprogram(name: "MyClosestHitShader_ShadowRay", linkageName: "\01?MyClosestHitShader_ShadowRay@@YAXUShadowRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 526, type: !475, isLocal: false, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader_ShadowRay@@YAXUShadowRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!475 = !DISubroutineType(types: !476)
!476 = !{null, !477, !140}
!477 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowRayPayload", file: !4, line: 108, size: 32, align: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tHit", scope: !478, file: !4, line: 110, baseType: !32, size: 32, align: 32)
!481 = !DISubprogram(name: "MyMissShader_RadianceRay", linkageName: "\01?MyMissShader_RadianceRay@@YAXUPathtracerRayPayload@@@Z", scope: !1, file: !1, line: 536, type: !482, isLocal: false, isDefinition: true, scopeLine: 537, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.PathtracerRayPayload*)* @"\01?MyMissShader_RadianceRay@@YAXUPathtracerRayPayload@@@Z")
!482 = !DISubroutineType(types: !483)
!483 = !{null, !436}
!484 = !DISubprogram(name: "MyMissShader_ShadowRay", linkageName: "\01?MyMissShader_ShadowRay@@YAXUShadowRayPayload@@@Z", scope: !1, file: !1, line: 542, type: !485, isLocal: false, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*)* @"\01?MyMissShader_ShadowRay@@YAXUShadowRayPayload@@@Z")
!485 = !DISubroutineType(types: !486)
!486 = !{null, !477}
!487 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@V?$vector@M$01@@@Z", scope: !84, file: !84, line: 207, type: !488, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false)
!488 = !DISubroutineType(types: !489)
!489 = !{!274, !18, !28, !155, !61}
!490 = !DISubprogram(name: "GenerateForwardCameraRayDirection", linkageName: "\01?GenerateForwardCameraRayDirection@@YA?AV?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !84, file: !84, line: 180, type: !491, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false)
!491 = !DISubroutineType(types: !492)
!492 = !{!28, !155}
!493 = !{!494, !496, !501, !503, !504, !505, !509, !510, !511, !512, !516, !517, !519, !521, !526, !527, !529, !532, !533, !534, !537, !541, !544, !547, !551, !552, !553, !554, !555, !556, !558, !580, !584, !592, !596, !598, !608, !610, !614, !615, !619, !620, !622, !624, !626}
!494 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", scope: !79, file: !78, line: 15, type: !495, isLocal: true, isDefinition: true, variable: float 0.000000e+00)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!496 = !DIGlobalVariable(name: "indexOffsets", scope: !288, file: !84, line: 656, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 256, align: 32, elements: !499)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!499 = !{!500}
!500 = !DISubrange(count: 4)
!501 = !DIGlobalVariable(name: "RAY_FLAG_CULL_NON_OPAQUE", scope: !0, file: !1, line: 88, type: !502, isLocal: true, isDefinition: true, variable: i32 128)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!503 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 95, type: !502, isLocal: true, isDefinition: true, variable: i32 4)
!504 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 101, type: !502, isLocal: true, isDefinition: true, variable: i32 8)
!505 = !DIGlobalVariable(name: "GeometryStride", scope: !506, file: !4, line: 513, type: !508, isLocal: true, isDefinition: true, variable: i32 2)
!506 = !DINamespace(name: "HitGroup", scope: !507, file: !4, line: 507)
!507 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 504)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!509 = !DIGlobalVariable(name: "InstanceMask", scope: !507, file: !4, line: 506, type: !508, isLocal: true, isDefinition: true, variable: i32 -1)
!510 = !DIGlobalVariable(name: "HIT_KIND_TRIANGLE_FRONT_FACE", scope: !0, file: !1, line: 472, type: !502, isLocal: true, isDefinition: true, variable: i32 254)
!511 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !507, file: !4, line: 506, type: !508, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !506, file: !4, line: 508, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 64, align: 32, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 2)
!516 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !506, file: !4, line: 513, type: !508, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !518, file: !4, line: 516, type: !513, isLocal: true, isDefinition: true)
!518 = !DINamespace(name: "MissShader", scope: !507, file: !4, line: 515)
!519 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !520, file: !4, line: 526, type: !508, isLocal: true, isDefinition: true)
!520 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !4, line: 524)
!521 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !522, file: !4, line: 528, type: !523, isLocal: true, isDefinition: true)
!522 = !DINamespace(name: "HitGroup", scope: !520, file: !4, line: 527)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 32, align: 32, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 1)
!526 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !522, file: !4, line: 534, type: !508, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !528, file: !4, line: 537, type: !523, isLocal: true, isDefinition: true)
!528 = !DINamespace(name: "MissShader", scope: !520, file: !4, line: 536)
!529 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !4, line: 544, type: !530, isLocal: true, isDefinition: true)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !278, line: 17, baseType: !67)
!532 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !79, file: !78, line: 15, type: !495, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !79, file: !78, line: 16, type: !495, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 30, type: !535, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 30, size: 32, align: 32, elements: !536)
!536 = !{}
!537 = !DIGlobalVariable(name: "g_rtGBufferPosition", linkageName: "\01?g_rtGBufferPosition@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 32, type: !538, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_rtGBufferPosition@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!538 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 32, size: 128, align: 32, elements: !536, templateParams: !539)
!539 = !{!540}
!540 = !DITemplateTypeParameter(name: "element", type: !68)
!541 = !DIGlobalVariable(name: "g_rtGBufferNormalDepth", linkageName: "\01?g_rtGBufferNormalDepth@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 33, type: !542, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<unsigned int>"* @"\01?g_rtGBufferNormalDepth@@3V?$RWTexture2D@I@@A")
!542 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 33, size: 32, align: 32, elements: !536, templateParams: !543)
!543 = !{!25}
!544 = !DIGlobalVariable(name: "g_rtGBufferDepth", linkageName: "\01?g_rtGBufferDepth@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 34, type: !545, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<float>"* @"\01?g_rtGBufferDepth@@3V?$RWTexture2D@M@@A")
!545 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 34, size: 32, align: 32, elements: !536, templateParams: !546)
!546 = !{!36}
!547 = !DIGlobalVariable(name: "g_rtTextureSpaceMotionVector", linkageName: "\01?g_rtTextureSpaceMotionVector@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 36, type: !548, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 2> >"* @"\01?g_rtTextureSpaceMotionVector@@3V?$RWTexture2D@V?$vector@M$01@@@@A")
!548 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 36, size: 64, align: 32, elements: !536, templateParams: !549)
!549 = !{!550}
!550 = !DITemplateTypeParameter(name: "element", type: !62)
!551 = !DIGlobalVariable(name: "g_rtReprojectedNormalDepth", linkageName: "\01?g_rtReprojectedNormalDepth@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 37, type: !542, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<unsigned int>"* @"\01?g_rtReprojectedNormalDepth@@3V?$RWTexture2D@I@@A")
!552 = !DIGlobalVariable(name: "g_rtColor", linkageName: "\01?g_rtColor@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 38, type: !538, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_rtColor@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!553 = !DIGlobalVariable(name: "g_rtAOSurfaceAlbedo", linkageName: "\01?g_rtAOSurfaceAlbedo@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 39, type: !538, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_rtAOSurfaceAlbedo@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!554 = !DIGlobalVariable(name: "g_outDebug1", linkageName: "\01?g_outDebug1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 40, type: !538, isLocal: false, isDefinition: true)
!555 = !DIGlobalVariable(name: "g_outDebug2", linkageName: "\01?g_outDebug2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 41, type: !538, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariable(name: "g_texEnvironmentMap", linkageName: "\01?g_texEnvironmentMap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 43, type: !557, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 4> >"* @"\01?g_texEnvironmentMap@@3V?$TextureCube@V?$vector@M$03@@@@A")
!557 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 43, size: 128, align: 32, elements: !536, templateParams: !539)
!558 = !DIGlobalVariable(name: "g_cb", linkageName: "\01?g_cb@@3U?$ConstantBuffer@UPathtracerConstantBuffer@@@@A", scope: !0, file: !1, line: 44, type: !559, isLocal: false, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PathtracerConstantBuffer>", file: !1, line: 44, size: 32, align: 32, elements: !536, templateParams: !560)
!560 = !{!561}
!561 = !DITemplateTypeParameter(name: "T", type: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathtracerConstantBuffer", file: !4, line: 197, size: 2176, align: 32, elements: !563)
!563 = !{!564, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "projectionToWorldWithCameraAtOrigin", scope: !562, file: !4, line: 199, baseType: !565, size: 512, align: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !278, line: 19, baseType: !155)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !562, file: !4, line: 200, baseType: !277, size: 96, align: 32, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "useBaseAlbedoFromMaterial", scope: !562, file: !4, line: 201, baseType: !352, size: 32, align: 32, offset: 608)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !562, file: !4, line: 202, baseType: !277, size: 96, align: 32, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "useNormalMaps", scope: !562, file: !4, line: 203, baseType: !352, size: 32, align: 32, offset: 736)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lightColor", scope: !562, file: !4, line: 204, baseType: !277, size: 96, align: 32, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "defaultAmbientIntensity", scope: !562, file: !4, line: 205, baseType: !32, size: 32, align: 32, offset: 864)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prevFrameViewProj", scope: !562, file: !4, line: 207, baseType: !565, size: 512, align: 32, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "prevFrameProjToViewCameraAtOrigin", scope: !562, file: !4, line: 208, baseType: !565, size: 512, align: 32, offset: 1408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prevFrameCameraPosition", scope: !562, file: !4, line: 209, baseType: !277, size: 96, align: 32, offset: 1920)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !562, file: !4, line: 210, baseType: !32, size: 32, align: 32, offset: 2016)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Znear", scope: !562, file: !4, line: 212, baseType: !32, size: 32, align: 32, offset: 2048)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Zfar", scope: !562, file: !4, line: 213, baseType: !32, size: 32, align: 32, offset: 2080)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "maxRadianceRayRecursionDepth", scope: !562, file: !4, line: 214, baseType: !409, size: 32, align: 32, offset: 2112)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "maxShadowRayRecursionDepth", scope: !562, file: !4, line: 215, baseType: !409, size: 32, align: 32, offset: 2144)
!580 = !DIGlobalVariable(name: "g_materials", linkageName: "\01?g_materials@@3V?$StructuredBuffer@UPrimitiveMaterialBuffer@@@@A", scope: !0, file: !1, line: 45, type: !581, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<PrimitiveMaterialBuffer>"* @"\01?g_materials@@3V?$StructuredBuffer@UPrimitiveMaterialBuffer@@@@A")
!581 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PrimitiveMaterialBuffer>", file: !1, line: 45, size: 768, align: 32, elements: !536, templateParams: !582)
!582 = !{!583}
!583 = !DITemplateTypeParameter(name: "element", type: !444)
!584 = !DIGlobalVariable(name: "g_sampleSets", linkageName: "\01?g_sampleSets@@3V?$StructuredBuffer@UAlignedHemisphereSample3D@@@@A", scope: !0, file: !1, line: 46, type: !585, isLocal: false, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AlignedHemisphereSample3D>", file: !1, line: 46, size: 128, align: 32, elements: !536, templateParams: !586)
!586 = !{!587}
!587 = !DITemplateTypeParameter(name: "element", type: !588)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "AlignedHemisphereSample3D", file: !4, line: 467, size: 128, align: 32, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !588, file: !4, line: 469, baseType: !277, size: 96, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !588, file: !4, line: 470, baseType: !409, size: 32, align: 32, offset: 96)
!592 = !DIGlobalVariable(name: "g_prevFrameBottomLevelASInstanceTransform", linkageName: "\01?g_prevFrameBottomLevelASInstanceTransform@@3V?$StructuredBuffer@V?$matrix@M$02$03@@@@A", scope: !0, file: !1, line: 47, type: !593, isLocal: false, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<matrix<float, 3, 4> >", file: !1, line: 47, size: 384, align: 32, elements: !536, templateParams: !594)
!594 = !{!595}
!595 = !DITemplateTypeParameter(name: "element", type: !388)
!596 = !DIGlobalVariable(name: "LinearWrapSampler", linkageName: "\01?LinearWrapSampler@@3USamplerState@@A", scope: !0, file: !1, line: 49, type: !597, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearWrapSampler@@3USamplerState@@A")
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 49, size: 32, align: 32, elements: !536)
!598 = !DIGlobalVariable(name: "l_materialCB", linkageName: "\01?l_materialCB@@3U?$ConstantBuffer@UPrimitiveConstantBuffer@@@@A", scope: !0, file: !1, line: 54, type: !599, isLocal: false, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<PrimitiveConstantBuffer>", file: !1, line: 54, size: 32, align: 32, elements: !536, templateParams: !600)
!600 = !{!601}
!601 = !DITemplateTypeParameter(name: "T", type: !602)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveConstantBuffer", file: !4, line: 429, size: 128, align: 32, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "materialID", scope: !602, file: !4, line: 431, baseType: !409, size: 32, align: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "isVertexAnimated", scope: !602, file: !4, line: 432, baseType: !409, size: 32, align: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !602, file: !4, line: 433, baseType: !607, size: 64, align: 32, offset: 64)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 64, align: 32, elements: !514)
!608 = !DIGlobalVariable(name: "l_indices", linkageName: "\01?l_indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 56, type: !609, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?l_indices@@3V?$StructuredBuffer@I@@A")
!609 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 56, size: 32, align: 32, elements: !536, templateParams: !543)
!610 = !DIGlobalVariable(name: "l_vertices", linkageName: "\01?l_vertices@@3V?$StructuredBuffer@UVertexPositionNormalTextureTangent@@@@A", scope: !0, file: !1, line: 57, type: !611, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalTextureTangent>"* @"\01?l_vertices@@3V?$StructuredBuffer@UVertexPositionNormalTextureTangent@@@@A")
!611 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalTextureTangent>", file: !1, line: 57, size: 352, align: 32, elements: !536, templateParams: !612)
!612 = !{!613}
!613 = !DITemplateTypeParameter(name: "element", type: !465)
!614 = !DIGlobalVariable(name: "l_verticesPrevFrame", linkageName: "\01?l_verticesPrevFrame@@3V?$StructuredBuffer@UVertexPositionNormalTextureTangent@@@@A", scope: !0, file: !1, line: 58, type: !611, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalTextureTangent>"* @"\01?l_verticesPrevFrame@@3V?$StructuredBuffer@UVertexPositionNormalTextureTangent@@@@A")
!615 = !DIGlobalVariable(name: "l_texDiffuse", linkageName: "\01?l_texDiffuse@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 60, type: !616, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 3> >"* @"\01?l_texDiffuse@@3V?$Texture2D@V?$vector@M$02@@@@A")
!616 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 60, size: 128, align: 32, elements: !536, templateParams: !617)
!617 = !{!618}
!618 = !DITemplateTypeParameter(name: "element", type: !29)
!619 = !DIGlobalVariable(name: "l_texNormalMap", linkageName: "\01?l_texNormalMap@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 61, type: !616, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 3> >"* @"\01?l_texNormalMap@@3V?$Texture2D@V?$vector@M$02@@@@A")
!620 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !4, line: 544, type: !621, isLocal: false, isDefinition: true)
!621 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !530, size: 32, align: 4, offset: 96)
!622 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !4, line: 544, type: !623, isLocal: false, isDefinition: true)
!623 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !530, size: 32, align: 4, offset: 64)
!624 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !4, line: 544, type: !625, isLocal: false, isDefinition: true)
!625 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !530, size: 32, align: 4)
!626 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !4, line: 544, type: !627, isLocal: false, isDefinition: true)
!627 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !530, size: 32, align: 4, offset: 32)
!628 = !{i32 2, !"Dwarf Version", i32 4}
!629 = !{i32 2, !"Debug Info Version", i32 3}
!630 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
