#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 2c9a15aab122b83d9b368fb5d2900a19.pdb
; shader hash: 2c9a15aab122b83d9b368fb5d2900a19
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.RTAOConstantBuffer
;       {
;
;           uint seed;                                ; Offset:    0
;           uint numSamplesPerSet;                    ; Offset:    4
;           uint numSampleSets;                       ; Offset:    8
;           uint numPixelsPerDimPerSet;               ; Offset:   12
;           float maxAORayHitTime;                    ; Offset:   16
;           int approximateInterreflections;          ; Offset:   20
;           float diffuseReflectanceScale;            ; Offset:   24
;           float minimumAmbientIllumination;         ; Offset:   28
;           float maxTheoreticalAORayHitTime;         ; Offset:   32
;           int useSortedRays;                        ; Offset:   36
;           uint2 raytracingDim;                      ; Offset:   40
;           int applyExponentialFalloff;              ; Offset:   48
;           float exponentialFalloffDecayConstant;    ; Offset:   52
;           int doCheckerboardSampling;               ; Offset:   56
;           int areEvenPixelsActive;                  ; Offset:   60
;           uint spp;                                 ; Offset:   64
;           float padding[3];                         ; Offset:   80

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !76, globals: !354)
!1 = !DIFile(filename: "RTAO\5CShaders\5CRTAO.hlsl", directory: "")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !5, file: !4, line: 497, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!5 = !DINamespace(name: "RTAORayType", scope: null, file: !4, line: 496)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "AO", value: 0)
!8 = !DIEnumerator(name: "Count", value: 1)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !10, file: !4, line: 188, size: 32, align: 32, elements: !12)
!10 = !DINamespace(name: "RayGroup", scope: !11, file: !4, line: 187)
!11 = !DINamespace(name: "SortRays", scope: null, file: !4, line: 182)
!12 = !{!13, !14, !15, !16}
!13 = !DIEnumerator(name: "NumElementPairsPerThread", value: 4)
!14 = !DIEnumerator(name: "Width", value: 64)
!15 = !DIEnumerator(name: "Height", value: 128)
!16 = !DIEnumerator(name: "Size", value: 8192)
!17 = !{!18, !28, !38, !39, !54, !61, !32, !67}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 50, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 50, size: 64, align: 32, elements: !20, templateParams: !24)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !19, file: !1, line: 50, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !19, file: !1, line: 50, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!24 = !{!25, !26}
!25 = !DITemplateTypeParameter(name: "element", type: !22)
!26 = !DITemplateValueParameter(name: "element_count", type: !27, value: i32 2)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 29, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 29, size: 96, align: 32, elements: !30, templateParams: !35)
!30 = !{!31, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 29, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 29, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 29, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!36, !37}
!36 = !DITemplateTypeParameter(name: "element", type: !32)
!37 = !DITemplateValueParameter(name: "element_count", type: !27, value: i32 3)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 34, baseType: !22)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 479, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 479, size: 288, align: 32, elements: !41, templateParams: !51)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 479, baseType: !32, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !{!36, !52, !53}
!52 = !DITemplateValueParameter(name: "row_count", type: !27, value: i32 3)
!53 = !DITemplateValueParameter(name: "col_count", type: !27, value: i32 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 60, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 60, size: 64, align: 32, elements: !56, templateParams: !59)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !55, file: !1, line: 60, baseType: !27, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !55, file: !1, line: 60, baseType: !27, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !{!60, !26}
!60 = !DITemplateTypeParameter(name: "element", type: !27)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 20, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 20, size: 64, align: 32, elements: !63, templateParams: !66)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !62, file: !1, line: 20, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !62, file: !1, line: 20, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !{!36, !26}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 153, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 153, size: 128, align: 32, elements: !69, templateParams: !74)
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !68, file: !1, line: 153, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!74 = !{!36, !75}
!75 = !DITemplateValueParameter(name: "element_count", type: !27, value: i32 4)
!76 = !{!77, !83, !87, !90, !93, !96, !99, !102, !109, !112, !115, !120, !123, !126, !127, !130, !131, !134, !143, !147, !150, !177, !180, !183, !186, !187, !190, !193, !196, !197, !198, !201, !202, !205, !208, !211, !214, !217, !220, !223, !224, !225, !228, !231, !232, !233, !236, !239, !240, !241, !244, !247, !262, !265, !268, !271, !280, !284, !287, !288, !291, !294, !297, !300, !303, !306, !309, !312, !315, !318, !319, !322, !326, !329, !332, !335, !340, !341, !348, !351}
!77 = !DISubprogram(name: "HasAORayHitAnyGeometry", linkageName: "\01?HasAORayHitAnyGeometry@RTAO@@YA_NM@Z", scope: !79, file: !78, line: 17, type: !80, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!79 = !DINamespace(name: "RTAO", scope: null, file: !78, line: 14)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !32}
!82 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!83 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$01@@@Z", scope: !84, file: !84, line: 26, type: !85, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DIFile(filename: "RTAO\5CShaders/RaytracingShaderHelper.hlsli", directory: "")
!85 = !DISubroutineType(types: !86)
!86 = !{!32, !61}
!87 = !DISubprogram(name: "length_toPow2", linkageName: "\01?length_toPow2@@YAMV?$vector@M$02@@@Z", scope: !84, file: !84, line: 31, type: !88, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!32, !28}
!90 = !DISubprogram(name: "Float2ToHalf", linkageName: "\01?Float2ToHalf@@YAIV?$vector@M$01@@@Z", scope: !84, file: !84, line: 36, type: !91, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!38, !61}
!93 = !DISubprogram(name: "HalfToFloat2", linkageName: "\01?HalfToFloat2@@YA?AV?$vector@M$01@@I@Z", scope: !84, file: !84, line: 44, type: !94, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!61, !38}
!96 = !DISubprogram(name: "EncodeMaterial16b", linkageName: "\01?EncodeMaterial16b@@YA?AV?$vector@I$01@@IV?$vector@M$02@@@Z", scope: !84, file: !84, line: 52, type: !97, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!18, !38, !28}
!99 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@H$01@@0@Z", scope: !84, file: !84, line: 62, type: !100, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!82, !54, !54}
!102 = !DISubprogram(name: "DecodeMaterial16b", linkageName: "\01?DecodeMaterial16b@@YAXV?$vector@I$01@@AIAIAIAV?$vector@M$02@@@Z", scope: !84, file: !84, line: 67, type: !103, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !18, !105, !107}
!105 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !38)
!107 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !28)
!109 = !DISubprogram(name: "RemapToRange", linkageName: "\01?RemapToRange@@YAMMMM@Z", scope: !84, file: !84, line: 75, type: !110, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!110 = !DISubroutineType(types: !111)
!111 = !{!32, !32, !32, !32}
!112 = !DISubprogram(name: "CalculateAnimationInterpolant", linkageName: "\01?CalculateAnimationInterpolant@@YAMMM@Z", scope: !84, file: !84, line: 81, type: !113, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false)
!113 = !DISubroutineType(types: !114)
!114 = !{!32, !32, !32}
!115 = !DISubprogram(name: "swap", linkageName: "\01?swap@@YAXAIAM0@Z", scope: !84, file: !84, line: 88, type: !116, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118, !118}
!118 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !32)
!120 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NIIM@Z", scope: !84, file: !84, line: 95, type: !121, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false)
!121 = !DISubroutineType(types: !122)
!122 = !{!82, !38, !38, !32}
!123 = !DISubprogram(name: "IsInRange", linkageName: "\01?IsInRange@@YA_NMMM@Z", scope: !84, file: !84, line: 100, type: !124, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!124 = !DISubroutineType(types: !125)
!125 = !{!82, !32, !32, !32}
!126 = !DISubprogram(name: "RGBtoLuminance", linkageName: "\01?RGBtoLuminance@@YAMV?$vector@M$02@@@Z", scope: !84, file: !84, line: 105, type: !88, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!127 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !84, file: !84, line: 144, type: !128, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false)
!128 = !DISubroutineType(types: !129)
!129 = !{!28}
!130 = !DISubprogram(name: "HitObjectPosition", linkageName: "\01?HitObjectPosition@@YA?AV?$vector@M$02@@XZ", scope: !84, file: !84, line: 150, type: !128, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!131 = !DISubprogram(name: "ClipSpaceToTexturePosition", linkageName: "\01?ClipSpaceToTexturePosition@@YA?AV?$vector@M$01@@V?$vector@M$03@@@Z", scope: !84, file: !84, line: 155, type: !132, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!61, !67}
!134 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !84, file: !84, line: 164, type: !135, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!28, !137, !140}
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 288, align: 32, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 161, size: 64, align: 32, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !140, file: !1, line: 161, baseType: !62, size: 64, align: 32)
!143 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$01@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !84, file: !84, line: 172, type: !144, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false)
!144 = !DISubroutineType(types: !145)
!145 = !{!61, !146, !140}
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, align: 32, elements: !138)
!147 = !DISubprogram(name: "TexCoords", linkageName: "\01?TexCoords@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !84, file: !84, line: 229, type: !148, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: false)
!148 = !DISubroutineType(types: !149)
!149 = !{!61, !28}
!150 = !DISubprogram(name: "CalculateRayDifferentials", linkageName: "\01?CalculateRayDifferentials@@YAXAIAV?$vector@M$01@@0V1@V?$vector@M$02@@22V?$matrix@M$03$03@@@Z", scope: !84, file: !84, line: 235, type: !151, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153, !153, !61, !28, !28, !28, !155}
!153 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !61)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 232, baseType: !156)
!156 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 232, size: 512, align: 32, elements: !157, templateParams: !174)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !156, file: !1, line: 232, baseType: !32, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!174 = !{!36, !175, !176}
!175 = !DITemplateValueParameter(name: "row_count", type: !27, value: i32 4)
!176 = !DITemplateValueParameter(name: "col_count", type: !27, value: i32 4)
!177 = !DISubprogram(name: "AnalyticalCheckersGridTexture", linkageName: "\01?AnalyticalCheckersGridTexture@@YAMV?$vector@M$02@@00V?$matrix@M$03$03@@@Z", scope: !84, file: !84, line: 254, type: !178, isLocal: false, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: false)
!178 = !DISubroutineType(types: !179)
!179 = !{!32, !28, !28, !28, !155}
!180 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !84, file: !84, line: 265, type: !181, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false)
!181 = !DISubroutineType(types: !182)
!182 = !{!28, !28, !28, !28}
!183 = !DISubprogram(name: "RemoveSRGB", linkageName: "\01?RemoveSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !84, file: !84, line: 271, type: !184, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: false)
!184 = !DISubroutineType(types: !185)
!185 = !{!28, !28}
!186 = !DISubprogram(name: "ApplySRGB", linkageName: "\01?ApplySRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !84, file: !84, line: 276, type: !184, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false)
!187 = !DISubprogram(name: "SmallestPowerOf2GreaterThan", linkageName: "\01?SmallestPowerOf2GreaterThan@@YAII@Z", scope: !84, file: !84, line: 281, type: !188, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false)
!188 = !DISubroutineType(types: !189)
!189 = !{!38, !38}
!190 = !DISubprogram(name: "FloatPrecision", linkageName: "\01?FloatPrecision@@YAMMI@Z", scope: !84, file: !84, line: 300, type: !191, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false)
!191 = !DISubroutineType(types: !192)
!192 = !{!32, !32, !38}
!193 = !DISubprogram(name: "FloatPrecisionR10", linkageName: "\01?FloatPrecisionR10@@YAMM@Z", scope: !84, file: !84, line: 311, type: !194, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false)
!194 = !DISubroutineType(types: !195)
!195 = !{!32, !32}
!196 = !DISubprogram(name: "FloatPrecisionR16", linkageName: "\01?FloatPrecisionR16@@YAMM@Z", scope: !84, file: !84, line: 316, type: !194, isLocal: false, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: false)
!197 = !DISubprogram(name: "FloatPrecisionR32", linkageName: "\01?FloatPrecisionR32@@YAMM@Z", scope: !84, file: !84, line: 321, type: !194, isLocal: false, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: false)
!198 = !DISubprogram(name: "OctWrap", linkageName: "\01?OctWrap@@YA?AV?$vector@M$01@@V1@@Z", scope: !84, file: !84, line: 330, type: !199, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false)
!199 = !DISubroutineType(types: !200)
!200 = !{!61, !61}
!201 = !DISubprogram(name: "EncodeNormal", linkageName: "\01?EncodeNormal@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !84, file: !84, line: 336, type: !148, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false)
!202 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !84, file: !84, line: 344, type: !203, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!203 = !DISubroutineType(types: !204)
!204 = !{!28, !61}
!205 = !DISubprogram(name: "Pack_R8_FLOAT", linkageName: "\01?Pack_R8_FLOAT@@YAIM@Z", scope: !84, file: !84, line: 359, type: !206, isLocal: false, isDefinition: true, scopeLine: 360, flags: DIFlagPrototyped, isOptimized: false)
!206 = !DISubroutineType(types: !207)
!207 = !{!38, !32}
!208 = !DISubprogram(name: "Unpack_R8_FLOAT", linkageName: "\01?Unpack_R8_FLOAT@@YAMI@Z", scope: !84, file: !84, line: 364, type: !209, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false)
!209 = !DISubroutineType(types: !210)
!210 = !{!32, !38}
!211 = !DISubprogram(name: "Pack_R8G8_to_R16_UINT", linkageName: "\01?Pack_R8G8_to_R16_UINT@@YAIII@Z", scope: !84, file: !84, line: 370, type: !212, isLocal: false, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: false)
!212 = !DISubroutineType(types: !213)
!213 = !{!38, !38, !38}
!214 = !DISubprogram(name: "Unpack_R16_to_R8G8_UINT", linkageName: "\01?Unpack_R16_to_R8G8_UINT@@YAXIAIAI0@Z", scope: !84, file: !84, line: 375, type: !215, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !38, !105, !105}
!217 = !DISubprogram(name: "Pack_R8G8B16_FLOAT", linkageName: "\01?Pack_R8G8B16_FLOAT@@YAIV?$vector@M$02@@@Z", scope: !84, file: !84, line: 385, type: !218, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: false)
!218 = !DISubroutineType(types: !219)
!219 = !{!38, !28}
!220 = !DISubprogram(name: "Unpack_R8G8B16_FLOAT", linkageName: "\01?Unpack_R8G8B16_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !84, file: !84, line: 393, type: !221, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false)
!221 = !DISubroutineType(types: !222)
!222 = !{!28, !38}
!223 = !DISubprogram(name: "NormalizedFloat3ToByte3", linkageName: "\01?NormalizedFloat3ToByte3@@YAIV?$vector@M$02@@@Z", scope: !84, file: !84, line: 401, type: !218, isLocal: false, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: false)
!224 = !DISubprogram(name: "Byte3ToNormalizedFloat3", linkageName: "\01?Byte3ToNormalizedFloat3@@YA?AV?$vector@M$02@@I@Z", scope: !84, file: !84, line: 409, type: !221, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: false)
!225 = !DISubprogram(name: "EncodeNormalDepth_N16D16", linkageName: "\01?EncodeNormalDepth_N16D16@@YAIV?$vector@M$02@@M@Z", scope: !84, file: !84, line: 418, type: !226, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: false)
!226 = !DISubroutineType(types: !227)
!227 = !{!38, !28, !32}
!228 = !DISubprogram(name: "DecodeNormalDepth_N16D16", linkageName: "\01?DecodeNormalDepth_N16D16@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !84, file: !84, line: 426, type: !229, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !38, !107, !118}
!231 = !DISubprogram(name: "EncodeNormalDepth", linkageName: "\01?EncodeNormalDepth@@YAIV?$vector@M$02@@M@Z", scope: !84, file: !84, line: 433, type: !226, isLocal: false, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: false)
!232 = !DISubprogram(name: "DecodeNormalDepth", linkageName: "\01?DecodeNormalDepth@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !84, file: !84, line: 438, type: !229, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false)
!233 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YAXIAIAV?$vector@M$02@@@Z", scope: !84, file: !84, line: 443, type: !234, isLocal: false, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: false)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !38, !107}
!236 = !DISubprogram(name: "UnpackEncodedNormalDepth", linkageName: "\01?UnpackEncodedNormalDepth@@YAXIAIAV?$vector@M$01@@AIAM@Z", scope: !84, file: !84, line: 449, type: !237, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: false)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !38, !153, !118}
!239 = !DISubprogram(name: "hash", linkageName: "\01?hash@@YAMV?$vector@M$02@@@Z", scope: !84, file: !84, line: 462, type: !88, isLocal: false, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: false)
!240 = !DISubprogram(name: "BumpMapNormalToWorldSpaceNormal", linkageName: "\01?BumpMapNormalToWorldSpaceNormal@@YA?AV?$vector@M$02@@V1@00@Z", scope: !84, file: !84, line: 472, type: !181, isLocal: false, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: false)
!241 = !DISubprogram(name: "CalculateTangent", linkageName: "\01?CalculateTangent@@YA?AV?$vector@M$02@@V1@00V?$vector@M$01@@11@Z", scope: !84, file: !84, line: 486, type: !242, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: false)
!242 = !DISubroutineType(types: !243)
!243 = !{!28, !28, !28, !28, !61, !61, !61}
!244 = !DISubprogram(name: "RayPlaneIntersection", linkageName: "\01?RayPlaneIntersection@@YA?AV?$vector@M$02@@V1@000@Z", scope: !84, file: !84, line: 501, type: !245, isLocal: false, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: false)
!245 = !DISubroutineType(types: !246)
!246 = !{!28, !28, !28, !28, !28}
!247 = !DISubprogram(name: "Inverse2x2", linkageName: "\01?Inverse2x2@@YA_NV?$matrix@M$01$01@@AIAV1@@Z", scope: !84, file: !84, line: 508, type: !248, isLocal: false, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false)
!248 = !DISubroutineType(types: !249)
!249 = !{!82, !250, !260}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x2", file: !1, line: 506, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 2>", file: !1, line: 506, size: 128, align: 32, elements: !252, templateParams: !257)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !251, file: !1, line: 506, baseType: !32, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!257 = !{!36, !258, !259}
!258 = !DITemplateValueParameter(name: "row_count", type: !27, value: i32 2)
!259 = !DITemplateValueParameter(name: "col_count", type: !27, value: i32 2)
!260 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !250)
!262 = !DISubprogram(name: "CalculateTrianglePartialDerivatives", linkageName: "\01?CalculateTrianglePartialDerivatives@@YAXV?$vector@M$01@@00V?$vector@M$02@@11AIAV2@2@Z", scope: !84, file: !84, line: 537, type: !263, isLocal: false, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: false)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !61, !61, !61, !28, !28, !28, !107, !107}
!265 = !DISubprogram(name: "CalculateUVDerivatives", linkageName: "\01?CalculateUVDerivatives@@YAXV?$vector@M$02@@00000AIAV?$vector@M$01@@1@Z", scope: !84, file: !84, line: 571, type: !266, isLocal: false, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: false)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !28, !28, !28, !28, !28, !28, !153, !153}
!268 = !DISubprogram(name: "CalculateUVDerivatives", linkageName: "\01?CalculateUVDerivatives@@YAXV?$vector@M$01@@V?$vector@M$02@@11110001V?$matrix@M$03$03@@AIAV1@3@Z", scope: !84, file: !84, line: 603, type: !269, isLocal: false, isDefinition: true, scopeLine: 609, flags: DIFlagPrototyped, isOptimized: false)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !61, !28, !28, !28, !28, !28, !61, !61, !61, !28, !155, !153, !153}
!271 = !DISubprogram(name: "CalculateUVDerivatives", linkageName: "\01?CalculateUVDerivatives@@YAXV?$vector@M$02@@V?$vector@M$01@@0000URay@@21110V?$matrix@M$03$03@@AIAV2@4AIAV1@5@Z", scope: !84, file: !84, line: 622, type: !272, isLocal: false, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: false)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !28, !61, !28, !28, !28, !28, !274, !274, !61, !61, !61, !28, !155, !153, !153, !107, !107}
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray", file: !4, line: 74, size: 192, align: 32, elements: !275)
!275 = !{!276, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !274, file: !4, line: 76, baseType: !277, size: 96, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !278, line: 16, baseType: !28)
!278 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !274, file: !4, line: 77, baseType: !277, size: 96, align: 32, offset: 96)
!280 = !DISubprogram(name: "GetAuxilaryCameraRays", linkageName: "\01?GetAuxilaryCameraRays@@YAXV?$vector@M$02@@V?$matrix@M$03$03@@URay@@2@Z", scope: !84, file: !84, line: 638, type: !281, isLocal: false, isDefinition: true, scopeLine: 639, flags: DIFlagPrototyped, isOptimized: false)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !28, !155, !283, !283}
!283 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !274)
!284 = !DISubprogram(name: "min4", linkageName: "\01?min4@@YAMV?$vector@M$03@@@Z", scope: !84, file: !84, line: 644, type: !285, isLocal: false, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false)
!285 = !DISubroutineType(types: !286)
!286 = !{!32, !67}
!287 = !DISubprogram(name: "max4", linkageName: "\01?max4@@YAMV?$vector@M$03@@@Z", scope: !84, file: !84, line: 649, type: !285, isLocal: false, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: false)
!288 = !DISubprogram(name: "Get2DQuadIndexOffset", linkageName: "\01?Get2DQuadIndexOffset@@YA?AV?$vector@I$01@@I@Z", scope: !84, file: !84, line: 654, type: !289, isLocal: false, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: false)
!289 = !DISubroutineType(types: !290)
!290 = !{!18, !38}
!291 = !DISubprogram(name: "GetIndexOfValueClosestToTheReference", linkageName: "\01?GetIndexOfValueClosestToTheReference@@YAIMV?$vector@M$01@@@Z", scope: !84, file: !84, line: 660, type: !292, isLocal: false, isDefinition: true, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: false)
!292 = !DISubroutineType(types: !293)
!293 = !{!38, !32, !61}
!294 = !DISubprogram(name: "GetIndexOfValueClosestToTheReference", linkageName: "\01?GetIndexOfValueClosestToTheReference@@YAIMV?$vector@M$03@@@Z", scope: !84, file: !84, line: 669, type: !295, isLocal: false, isDefinition: true, scopeLine: 670, flags: DIFlagPrototyped, isOptimized: false)
!295 = !DISubroutineType(types: !296)
!296 = !{!38, !32, !67}
!297 = !DISubprogram(name: "RemapDdxy", linkageName: "\01?RemapDdxy@@YA?AV?$vector@M$01@@MV1@0@Z", scope: !84, file: !84, line: 681, type: !298, isLocal: false, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false)
!298 = !DISubroutineType(types: !299)
!299 = !{!61, !32, !61, !61}
!300 = !DISubprogram(name: "GetDepthAtPixelOffset", linkageName: "\01?GetDepthAtPixelOffset@@YAMMV?$vector@M$01@@0@Z", scope: !84, file: !84, line: 695, type: !301, isLocal: false, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: false)
!301 = !DISubroutineType(types: !302)
!302 = !{!32, !32, !61, !61}
!303 = !DISubprogram(name: "ApproximateProjectedSurfaceDimensionsPerPixel", linkageName: "\01?ApproximateProjectedSurfaceDimensionsPerPixel@@YA?AV?$vector@M$01@@MV1@M@Z", scope: !84, file: !84, line: 706, type: !304, isLocal: false, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: false)
!304 = !DISubroutineType(types: !305)
!305 = !{!61, !32, !61, !32}
!306 = !DISubprogram(name: "InterpolateValidValues", linkageName: "\01?InterpolateValidValues@@YAMV?$vector@M$03@@0MM@Z", scope: !84, file: !84, line: 719, type: !307, isLocal: false, isDefinition: true, scopeLine: 724, flags: DIFlagPrototyped, isOptimized: false)
!307 = !DISubroutineType(types: !308)
!308 = !{!32, !67, !67, !32, !32}
!309 = !DISubprogram(name: "SeedThread", linkageName: "\01?SeedThread@RNG@@YAII@Z", scope: !311, file: !310, line: 19, type: !188, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!310 = !DIFile(filename: "RTAO\5CShaders/RandomNumberGenerator.hlsli", directory: "")
!311 = !DINamespace(name: "RNG", scope: null, file: !310, line: 16)
!312 = !DISubprogram(name: "Random", linkageName: "\01?Random@RNG@@YAIAIAI@Z", scope: !311, file: !310, line: 32, type: !313, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!313 = !DISubroutineType(types: !314)
!314 = !{!38, !105}
!315 = !DISubprogram(name: "Random01", linkageName: "\01?Random01@RNG@@YAMAIAI@Z", scope: !311, file: !310, line: 42, type: !316, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!316 = !DISubroutineType(types: !317)
!317 = !{!32, !105}
!318 = !DISubprogram(name: "Random01inclusive", linkageName: "\01?Random01inclusive@RNG@@YAMAIAI@Z", scope: !311, file: !310, line: 48, type: !316, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!319 = !DISubprogram(name: "Random", linkageName: "\01?Random@RNG@@YAIAIAIII@Z", scope: !311, file: !310, line: 55, type: !320, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!320 = !DISubroutineType(types: !321)
!321 = !{!38, !105, !38, !38}
!322 = !DISubprogram(name: "GetRandomRayDirection", linkageName: "\01?GetRandomRayDirection@@YA?AV?$vector@M$02@@V?$vector@I$01@@V1@0I@Z", scope: !323, file: !323, line: 16, type: !324, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!323 = !DIFile(filename: "RTAO\5CShaders/RayGen.hlsli", directory: "")
!324 = !DISubroutineType(types: !325)
!325 = !{!28, !18, !28, !18, !38}
!326 = !DISubprogram(name: "TraceAORayAndReportIfHit", linkageName: "\01?TraceAORayAndReportIfHit@@YA_NAIAMURay@@MV?$vector@M$02@@@Z", scope: !1, file: !1, line: 43, type: !327, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!327 = !DISubroutineType(types: !328)
!328 = !{!82, !118, !274, !32, !28}
!329 = !DISubprogram(name: "CalculateAO", linkageName: "\01?CalculateAO@@YAMAIAMV?$vector@I$01@@URay@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 82, type: !330, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false)
!330 = !DISubroutineType(types: !331)
!331 = !{!32, !118, !18, !274, !28}
!332 = !DISubprogram(name: "RayGenShader", linkageName: "\01?RayGenShader@@YAXXZ", scope: !1, file: !1, line: 124, type: !333, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader@@YAXXZ")
!333 = !DISubroutineType(types: !334)
!334 = !{null}
!335 = !DISubprogram(name: "Get2DRayIndices", linkageName: "\01?Get2DRayIndices@@YA_NAIAV?$vector@I$01@@0I@Z", scope: !1, file: !1, line: 158, type: !336, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!336 = !DISubroutineType(types: !337)
!337 = !{!82, !338, !338, !38}
!338 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !18)
!340 = !DISubprogram(name: "RayGenShader_sortedRays", linkageName: "\01?RayGenShader_sortedRays@@YAXXZ", scope: !1, file: !1, line: 192, type: !333, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGenShader_sortedRays@@YAXXZ")
!341 = !DISubprogram(name: "ClosestHitShader", linkageName: "\01?ClosestHitShader@@YAXUShadowRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 236, type: !342, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHitShader@@YAXUShadowRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!342 = !DISubroutineType(types: !343)
!343 = !{null, !344, !140}
!344 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowRayPayload", file: !4, line: 108, size: 32, align: 32, elements: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tHit", scope: !345, file: !4, line: 110, baseType: !32, size: 32, align: 32)
!348 = !DISubprogram(name: "MissShader", linkageName: "\01?MissShader@@YAXUShadowRayPayload@@@Z", scope: !1, file: !1, line: 246, type: !349, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*)* @"\01?MissShader@@YAXUShadowRayPayload@@@Z")
!349 = !DISubroutineType(types: !350)
!350 = !{null, !344}
!351 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AURay@@V?$vector@I$01@@V?$vector@M$02@@V?$matrix@M$03$03@@V?$vector@M$01@@@Z", scope: !84, file: !84, line: 207, type: !352, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false)
!352 = !DISubroutineType(types: !353)
!353 = !{!274, !18, !28, !155, !61}
!354 = !{!355, !357, !362, !364, !369, !370, !371, !373, !378, !379, !381, !382, !386, !387, !389, !392, !393, !394, !397, !401, !404, !405, !409, !410, !413, !414, !440, !448, !450, !452, !454}
!355 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", scope: !79, file: !78, line: 15, type: !356, isLocal: true, isDefinition: true, variable: float 0.000000e+00)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!357 = !DIGlobalVariable(name: "indexOffsets", scope: !288, file: !84, line: 656, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 256, align: 32, elements: !360)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!360 = !{!361}
!361 = !DISubrange(count: 4)
!362 = !DIGlobalVariable(name: "RAY_FLAG_CULL_NON_OPAQUE", scope: !0, file: !1, line: 64, type: !363, isLocal: true, isDefinition: true, variable: i32 128)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!364 = !DIGlobalVariable(name: "GeometryStride", scope: !365, file: !4, line: 534, type: !367, isLocal: true, isDefinition: true, variable: i32 0)
!365 = !DINamespace(name: "HitGroup", scope: !366, file: !4, line: 527)
!366 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !4, line: 524)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !278, line: 20, baseType: !38)
!369 = !DIGlobalVariable(name: "InstanceMask", scope: !366, file: !4, line: 526, type: !367, isLocal: true, isDefinition: true, variable: i32 -1)
!370 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", scope: !79, file: !78, line: 16, type: !356, isLocal: true, isDefinition: true, variable: float -1.000000e+00)
!371 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !372, file: !4, line: 506, type: !367, isLocal: true, isDefinition: true)
!372 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 504)
!373 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !374, file: !4, line: 508, type: !375, isLocal: true, isDefinition: true)
!374 = !DINamespace(name: "HitGroup", scope: !372, file: !4, line: 507)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 64, align: 32, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 2)
!378 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !374, file: !4, line: 513, type: !367, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !380, file: !4, line: 516, type: !375, isLocal: true, isDefinition: true)
!380 = !DINamespace(name: "MissShader", scope: !372, file: !4, line: 515)
!381 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !366, file: !4, line: 526, type: !367, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !365, file: !4, line: 528, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 32, align: 32, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !365, file: !4, line: 534, type: !367, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !388, file: !4, line: 537, type: !383, isLocal: true, isDefinition: true)
!388 = !DINamespace(name: "MissShader", scope: !366, file: !4, line: 536)
!389 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !4, line: 544, type: !390, isLocal: true, isDefinition: true)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !278, line: 17, baseType: !67)
!392 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !79, file: !78, line: 15, type: !356, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !79, file: !78, line: 16, type: !356, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariable(name: "g_scene", linkageName: "\01?g_scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 22, type: !395, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_scene@@3URaytracingAccelerationStructure@@A")
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 22, size: 32, align: 32, elements: !396)
!396 = !{}
!397 = !DIGlobalVariable(name: "g_texRayOriginPosition", linkageName: "\01?g_texRayOriginPosition@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 23, type: !398, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?g_texRayOriginPosition@@3V?$Texture2D@V?$vector@M$03@@@@A")
!398 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 23, size: 160, align: 32, elements: !396, templateParams: !399)
!399 = !{!400}
!400 = !DITemplateTypeParameter(name: "element", type: !68)
!401 = !DIGlobalVariable(name: "g_texRayOriginSurfaceNormalDepth", linkageName: "\01?g_texRayOriginSurfaceNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 24, type: !402, isLocal: false, isDefinition: true, variable: %"class.Texture2D<unsigned int>"* @"\01?g_texRayOriginSurfaceNormalDepth@@3V?$Texture2D@I@@A")
!402 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<unsigned int>", file: !1, line: 24, size: 64, align: 32, elements: !396, templateParams: !403)
!403 = !{!25}
!404 = !DIGlobalVariable(name: "g_texAORaysDirectionOriginDepth", linkageName: "\01?g_texAORaysDirectionOriginDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 25, type: !402, isLocal: false, isDefinition: true, variable: %"class.Texture2D<unsigned int>"* @"\01?g_texAORaysDirectionOriginDepth@@3V?$Texture2D@I@@A")
!405 = !DIGlobalVariable(name: "g_texAOSortedToSourceRayIndexOffset", linkageName: "\01?g_texAOSortedToSourceRayIndexOffset@@3V?$Texture2D@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 26, type: !406, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<unsigned int, 2> >"* @"\01?g_texAOSortedToSourceRayIndexOffset@@3V?$Texture2D@V?$vector@I$01@@@@A")
!406 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<unsigned int, 2> >", file: !1, line: 26, size: 96, align: 32, elements: !396, templateParams: !407)
!407 = !{!408}
!408 = !DITemplateTypeParameter(name: "element", type: !19)
!409 = !DIGlobalVariable(name: "g_texAOSurfaceAlbedo", linkageName: "\01?g_texAOSurfaceAlbedo@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !398, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?g_texAOSurfaceAlbedo@@3V?$Texture2D@V?$vector@M$03@@@@A")
!410 = !DIGlobalVariable(name: "g_outAOAmbientCoefficient", linkageName: "\01?g_outAOAmbientCoefficient@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 29, type: !411, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<float>"* @"\01?g_outAOAmbientCoefficient@@3V?$RWTexture2D@M@@A")
!411 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 29, size: 32, align: 32, elements: !396, templateParams: !412)
!412 = !{!36}
!413 = !DIGlobalVariable(name: "g_outAORayHitDistance", linkageName: "\01?g_outAORayHitDistance@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 30, type: !411, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<float>"* @"\01?g_outAORayHitDistance@@3V?$RWTexture2D@M@@A")
!414 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@URTAOConstantBuffer@@@@A", scope: !0, file: !1, line: 32, type: !415, isLocal: false, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<RTAOConstantBuffer>", file: !1, line: 32, size: 32, align: 32, elements: !396, templateParams: !416)
!416 = !{!417}
!417 = !DITemplateTypeParameter(name: "T", type: !418)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "RTAOConstantBuffer", file: !4, line: 219, size: 640, align: 32, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !427, !428, !429, !430, !431, !433, !434, !435, !436, !437, !438}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !418, file: !4, line: 221, baseType: !368, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "numSamplesPerSet", scope: !418, file: !4, line: 222, baseType: !368, size: 32, align: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "numSampleSets", scope: !418, file: !4, line: 223, baseType: !368, size: 32, align: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "numPixelsPerDimPerSet", scope: !418, file: !4, line: 224, baseType: !368, size: 32, align: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "maxAORayHitTime", scope: !418, file: !4, line: 226, baseType: !32, size: 32, align: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "approximateInterreflections", scope: !418, file: !4, line: 227, baseType: !426, size: 32, align: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !278, line: 24, baseType: !27)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseReflectanceScale", scope: !418, file: !4, line: 228, baseType: !32, size: 32, align: 32, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "minimumAmbientIllumination", scope: !418, file: !4, line: 229, baseType: !32, size: 32, align: 32, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "maxTheoreticalAORayHitTime", scope: !418, file: !4, line: 231, baseType: !32, size: 32, align: 32, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "useSortedRays", scope: !418, file: !4, line: 233, baseType: !426, size: 32, align: 32, offset: 288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "raytracingDim", scope: !418, file: !4, line: 234, baseType: !432, size: 64, align: 32, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !278, line: 21, baseType: !18)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "applyExponentialFalloff", scope: !418, file: !4, line: 236, baseType: !426, size: 32, align: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "exponentialFalloffDecayConstant", scope: !418, file: !4, line: 237, baseType: !32, size: 32, align: 32, offset: 416)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "doCheckerboardSampling", scope: !418, file: !4, line: 238, baseType: !426, size: 32, align: 32, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "areEvenPixelsActive", scope: !418, file: !4, line: 239, baseType: !426, size: 32, align: 32, offset: 480)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "spp", scope: !418, file: !4, line: 241, baseType: !368, size: 32, align: 32, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !418, file: !4, line: 242, baseType: !439, size: 96, align: 32, offset: 544)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, align: 32, elements: !138)
!440 = !DIGlobalVariable(name: "g_sampleSets", linkageName: "\01?g_sampleSets@@3V?$StructuredBuffer@UAlignedHemisphereSample3D@@@@A", scope: !0, file: !1, line: 33, type: !441, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<AlignedHemisphereSample3D>"* @"\01?g_sampleSets@@3V?$StructuredBuffer@UAlignedHemisphereSample3D@@@@A")
!441 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<AlignedHemisphereSample3D>", file: !1, line: 33, size: 128, align: 32, elements: !396, templateParams: !442)
!442 = !{!443}
!443 = !DITemplateTypeParameter(name: "element", type: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "AlignedHemisphereSample3D", file: !4, line: 467, size: 128, align: 32, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !444, file: !4, line: 469, baseType: !277, size: 96, align: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !444, file: !4, line: 470, baseType: !368, size: 32, align: 32, offset: 96)
!448 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !4, line: 544, type: !449, isLocal: false, isDefinition: true)
!449 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !390, size: 32, align: 4, offset: 96)
!450 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !4, line: 544, type: !451, isLocal: false, isDefinition: true)
!451 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !390, size: 32, align: 4, offset: 32)
!452 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !4, line: 544, type: !453, isLocal: false, isDefinition: true)
!453 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !390, size: 32, align: 4)
!454 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !4, line: 544, type: !455, isLocal: false, isDefinition: true)
!455 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !390, size: 32, align: 4, offset: 64)
!456 = !{i32 2, !"Dwarf Version", i32 4}
!457 = !{i32 2, !"Debug Info Version", i32 3}
!458 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!459 = !{!"RTAO\5CShaders\5CRTAO.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A#include \22RaytracingShaderHelper.hlsli\22\0D\0A#include \22RandomNumberGenerator.hlsli\22\0D\0A#include \22Ray Sorting/RaySorting.hlsli\22\0D\0A#include \22RTAO.hlsli\22\0D\0A\0D\0ARaytracingAccelerationStructure g_scene : register(t0);\0D\0ATexture2D<float4> g_texRayOriginPosition : register(t7);\0D\0ATexture2D<NormalDepthTexFormat> g_texRayOriginSurfaceNormalDepth : register(t8);\0D\0ATexture2D<NormalDepthTexFormat> g_texAORaysDirectionOriginDepth : register(t22);\0D\0ATexture2D<uint2> g_texAOSortedToSourceRayIndexOffset : register(t23);\0D\0ATexture2D<float4> g_texAOSurfaceAlbedo : register(t24);\0D\0A\0D\0ARWTexture2D<float> g_outAOAmbientCoefficient : register(u10);\0D\0ARWTexture2D<float> g_outAORayHitDistance : register(u15);\0D\0A\0D\0AConstantBuffer<RTAOConstantBuffer> cb : register(b0);\0D\0AStructuredBuffer<AlignedHemisphereSample3D> g_sampleSets : register(t4);\0D\0A\0D\0A// Delay the include so that resource references resolve.\0D\0A#include \22RayGen.hlsli\22\0D\0A\0D\0A//***************************************************************************\0D\0A//*********************------ TraceRay wrappers. -------*********************\0D\0A//***************************************************************************\0D\0A\0D\0A// Trace an AO ray and return true if it hits any geometry.\0D\0Abool TraceAORayAndReportIfHit(out float tHit, in Ray ray, in float TMax, in float3 surfaceNormal)\0D\0A{\0D\0A    RayDesc rayDesc;\0D\0A\0D\0A    // Nudge the origin along the surface normal a bit to avoid \0D\0A    // starting from behind the surface\0D\0A    // due to float calculations imprecision.\0D\0A    rayDesc.Origin = ray.origin + 0.001 * surfaceNormal;\0D\0A    rayDesc.Direction = ray.direction;\0D\0A\0D\0A    // Set the ray's extents.\0D\0A    rayDesc.TMin = 0.0;\0D\0A\09rayDesc.TMax = TMax;\0D\0A\0D\0A    // Initialize shadow ray payload.\0D\0A    // Set the initial value to a hit at TMax. \0D\0A    // This way closest and any hit shaders can be skipped if true tHit is not needed. \0D\0A    ShadowRayPayload shadowPayload = { TMax };\0D\0A\0D\0A    UINT rayFlags =\0D\0A        // Ignore transparent surfaces for occlusion testing.\0D\0A        RAY_FLAG_CULL_NON_OPAQUE;        \0D\0A\0D\0A    TraceRay(g_scene,\0D\0A        rayFlags,\0D\0A        RTAOTraceRayParameters::InstanceMask,\0D\0A        RTAOTraceRayParameters::HitGroup::Offset[RTAORayType::AO],\0D\0A        RTAOTraceRayParameters::HitGroup::GeometryStride,\0D\0A        RTAOTraceRayParameters::MissShader::Offset[RTAORayType::AO],\0D\0A        rayDesc, shadowPayload);\0D\0A    \0D\0A    tHit = shadowPayload.tHit;\0D\0A\0D\0A    // Report a hit if Miss Shader didn't set the value to HitDistanceOnMiss.\0D\0A    return RTAO::HasAORayHitAnyGeometry(tHit);\0D\0A}\0D\0A\0D\0A// Traces a given AO ray. \0D\0A// Returns its tHit and a calculated ambient coefficient.\0D\0Afloat CalculateAO(out float tHit, in uint2 srcPixelIndex, in Ray AOray, in float3 surfaceNormal)\0D\0A{\0D\0A    float ambientCoef = 1;\0D\0A    const float tMax = cb.maxAORayHitTime; \0D\0A    if (TraceAORayAndReportIfHit(tHit, AOray, tMax, surfaceNormal))\0D\0A    {\0D\0A        float occlusionCoef = 1;\0D\0A        if (cb.applyExponentialFalloff)\0D\0A        {\0D\0A            float theoreticalTMax = cb.maxTheoreticalAORayHitTime;\0D\0A            float t = tHit / theoreticalTMax;\0D\0A            float lambda = cb.exponentialFalloffDecayConstant;\0D\0A            occlusionCoef = exp(-lambda * t * t);\0D\0A        }\0D\0A        ambientCoef = 1 - (1 - cb.minimumAmbientIllumination) * occlusionCoef;\0D\0A\0D\0A        // Approximate interreflections of light from blocking surfaces which are generally not completely dark and tend to have similar radiance.\0D\0A        // Ref: Ch 11.3.3 Accounting for Interreflections, Real-Time Rendering (4th edition).\0D\0A        // The approximation assumes:\0D\0A        //      o All surfaces' incoming and outgoing radiance is the same \0D\0A        //      o Current surface color is the same as that of the occluders\0D\0A        // Since this sample uses scalar ambient coefficient, it usse the scalar luminance of the surface color.\0D\0A        // This will generally brighten the AO making it closer to the result of full Global Illumination, including interreflections.\0D\0A        if (cb.approximateInterreflections)\0D\0A        {\0D\0A            float3 surfaceAlbedo = g_texAOSurfaceAlbedo[srcPixelIndex].xyz;\0D\0A\0D\0A            float kA = ambientCoef;\0D\0A            float rho = cb.diffuseReflectanceScale * RGBtoLuminance(surfaceAlbedo);\0D\0A\0D\0A            ambientCoef = kA / (1 - rho * (1 - kA));\0D\0A        }\0D\0A    }\0D\0A\0D\0A    return ambientCoef;\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//********************------ Ray gen shader.. -------************************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGenShader()\0D\0A{\0D\0A    uint2 srcRayIndex = DispatchRaysIndex().xy;\0D\0A\0D\0A    float3 surfaceNormal;\0D\0A    float depth;\0D\0A    DecodeNormalDepth(g_texRayOriginSurfaceNormalDepth[srcRayIndex], surfaceNormal, depth);\0D\0A\09bool isValidHit = depth != HitDistanceOnMiss;\0D\0A    float tHit = RTAO::RayHitDistanceOnMiss;\0D\0A    float ambientCoef = RTAO::InvalidAOCoefficientValue;\0D\0A\09if (isValidHit)\0D\0A\09{\0D\0A        float3 hitPosition = g_texRayOriginPosition[srcRayIndex].xyz;\0D\0A        ambientCoef = 0;\0D\0A        for (uint r = 0; r < cb.spp; r++)\0D\0A        {\0D\0A            float3 rayDirection = GetRandomRayDirection(srcRayIndex, surfaceNormal, cb.raytracingDim, r);\0D\0A            Ray AORay = { hitPosition, rayDirection };\0D\0A            ambientCoef += CalculateAO(tHit, srcRayIndex, AORay, surfaceNormal);\0D\0A        }\0D\0A        ambientCoef /= cb.spp;\0D\0A    }\0D\0A\0D\0A    g_outAOAmbientCoefficient[srcRayIndex] = ambientCoef;\0D\0A    g_outAORayHitDistance[srcRayIndex] = RTAO::HasAORayHitAnyGeometry(tHit) ? tHit : cb.maxTheoreticalAORayHitTime;\0D\0A}\0D\0A\0D\0A// Retrieves 2D source and sorted ray indices from a 1D ray index where\0D\0A// - every valid (i.e. is within ray tracing buffer dimensions) 1D index maps to a valid 2D index.\0D\0A// - pixels are row major within a ray group.\0D\0A// - ray groups are row major within the raytracing buffer dimensions.\0D\0A// - rays are sorted per ray group.\0D\0A// Overflowing ray group dimensions on the borders are clipped to valid raytracing dimnesions.\0D\0A// Returns whether the retrieved ray is active.\0D\0Abool Get2DRayIndices(out uint2 sortedRayIndex2D, out uint2 srcRayIndex2D, in uint index1D)\0D\0A{\0D\0A    uint2 rayGroupDim = uint2(SortRays::RayGroup::Width, SortRays::RayGroup::Height);\0D\0A\0D\0A    // Find the ray group row index.\0D\0A    uint numValidPixelsInRow = cb.raytracingDim.x;\0D\0A    uint rowOfRayGroupSize = rayGroupDim.y * numValidPixelsInRow;\0D\0A    uint rayGroupRowIndex = index1D / rowOfRayGroupSize;\0D\0A\0D\0A    // Find the ray group column index.\0D\0A    uint numValidPixelsInColumn = cb.raytracingDim.y;\0D\0A    uint numRowsInCurrentRayGroup = min((rayGroupRowIndex + 1) * rayGroupDim.y, numValidPixelsInColumn) - rayGroupRowIndex * rayGroupDim.y;\0D\0A    uint currentRow_RayGroupSize = numRowsInCurrentRayGroup * rayGroupDim.x;\0D\0A    uint index1DWithinRayGroupRow = index1D - rayGroupRowIndex * rowOfRayGroupSize;\0D\0A    uint rayGroupColumnIndex = index1DWithinRayGroupRow / currentRow_RayGroupSize;\0D\0A    uint2 rayGroupIndex = uint2(rayGroupColumnIndex, rayGroupRowIndex);\0D\0A\0D\0A    // Find the thread offset index within the ray group.\0D\0A    uint currentRayGroup_index1D = index1DWithinRayGroupRow - rayGroupIndex.x * currentRow_RayGroupSize;\0D\0A    uint currentRayGroupWidth = min((rayGroupIndex.x + 1) * rayGroupDim.x, numValidPixelsInRow) - rayGroupIndex.x * rayGroupDim.x;\0D\0A    uint rayThreadRowIndex = currentRayGroup_index1D / currentRayGroupWidth;\0D\0A    uint rayThreadColumnIndex = currentRayGroup_index1D - rayThreadRowIndex * currentRayGroupWidth;\0D\0A    uint2 rayThreadIndex = uint2(rayThreadColumnIndex, rayThreadRowIndex);\0D\0A\0D\0A    // Get the corresponding source index\0D\0A    sortedRayIndex2D = rayGroupIndex * rayGroupDim + rayThreadIndex;\0D\0A    uint2 rayGroupBase = rayGroupIndex * rayGroupDim;\0D\0A    uint2 rayGroupRayIndexOffset = g_texAOSortedToSourceRayIndexOffset[sortedRayIndex2D];\0D\0A    srcRayIndex2D = rayGroupBase + GetRawRayIndexOffset(rayGroupRayIndexOffset);\0D\0A\0D\0A    return IsActiveRay(rayGroupRayIndexOffset);\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGenShader_sortedRays()\0D\0A{\0D\0A    uint DTid_1D = DispatchRaysIndex().x; \0D\0A    uint2 srcRayIndex;\0D\0A    uint2 sortedRayIndex;\0D\0A    bool isActiveRay = Get2DRayIndices(sortedRayIndex, srcRayIndex, DTid_1D);\0D\0A\0D\0A    uint2 srcRayIndexFullRes = srcRayIndex;\0D\0A    if (cb.doCheckerboardSampling)\0D\0A    {\0D\0A        UINT pixelStepX = 2;\0D\0A        bool isEvenPixelY = (srcRayIndex.y & 1) == 0;\0D\0A        UINT pixelOffsetX = isEvenPixelY != cb.areEvenPixelsActive;\0D\0A        srcRayIndexFullRes.x = srcRayIndex.x * pixelStepX + pixelOffsetX;\0D\0A    }\0D\0A\0D\0A    float tHit = RTAO::RayHitDistanceOnMiss;\0D\0A    float ambientCoef = RTAO::InvalidAOCoefficientValue;\0D\0A    if (isActiveRay)\0D\0A    {\0D\0A        float dummy;\0D\0A        float3 rayDirection;\0D\0A        DecodeNormalDepth(g_texAORaysDirectionOriginDepth[srcRayIndex], rayDirection, dummy);\0D\0A        float3 hitPosition = g_texRayOriginPosition[srcRayIndexFullRes].xyz;\0D\0A\0D\0A        float3 surfaceNormal;\0D\0A        float depth;\0D\0A        DecodeNormalDepth(g_texRayOriginSurfaceNormalDepth[srcRayIndexFullRes], surfaceNormal, depth);\0D\0A\0D\0A        Ray AORay = { hitPosition, rayDirection };\0D\0A        ambientCoef = CalculateAO(tHit, srcRayIndexFullRes, AORay, surfaceNormal);\0D\0A    }\0D\0A\0D\0A    uint2 outPixel = srcRayIndexFullRes;\0D\0A\0D\0A    g_outAOAmbientCoefficient[outPixel] = ambientCoef;\0D\0A    g_outAORayHitDistance[outPixel] = RTAO::HasAORayHitAnyGeometry(tHit) ? tHit : cb.maxTheoreticalAORayHitTime;\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//******************------ Closest hit shaders -------***********************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHitShader(inout ShadowRayPayload rayPayload, in BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    rayPayload.tHit = RayTCurrent();\0D\0A}\0D\0A\0D\0A//***************************************************************************\0D\0A//**********************------ Miss shaders -------**************************\0D\0A//***************************************************************************\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MissShader(inout ShadowRayPayload rayPayload)\0D\0A{\0D\0A    rayPayload.tHit = RTAO::RayHitDistanceOnMiss;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!460 = !{!".\5CSampleCore\5Cshaders\5CHlslCompat.hlsli", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float2 XMFLOAT2;\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0Atypedef uint2 XMUINT2;\0D\0Atypedef uint3 XMUINT3;\0D\0Atypedef int2 XMINT2;\0D\0Atypedef int BOOL;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!461 = !{!"C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO\5CShaders\5CRTAO.hlsli", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A#ifndef RTAO_HLSLI\0D\0A#define RTAO_HLSLI\0D\0A\0D\0Anamespace RTAO {\0D\0A    static const float RayHitDistanceOnMiss = 0;\0D\0A    static const float InvalidAOCoefficientValue = -1;\0D\0A    bool HasAORayHitAnyGeometry(in float tHit)\0D\0A    {\0D\0A        return tHit != RayHitDistanceOnMiss;\0D\0A    }\0D\0A}\0D\0A\0D\0A#endif // RTAO_HLSLI"}
!462 = !{!"C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRayTracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A//**********************************************************************************************\0D\0A//\0D\0A// RaytracingHLSLCompat.h\0D\0A//\0D\0A// A header with shared definitions for C++ and HLSL source files. \0D\0A//\0D\0A//**********************************************************************************************\0D\0A\0D\0A//************************** Global Overrides **************************************************\0D\0A#define RENDER_GRASS_GEOMETRY 1\0D\0A#define PRINT_OUT_CAMERA_CONFIG 0\0D\0A\0D\0A#ifdef _DEBUG\0D\0A#define LOAD_ONLY_ONE_PBRT_MESH 0 // Set to 1 to speed up application start on debug.\0D\0A#else\0D\0A#define LOAD_ONLY_ONE_PBRT_MESH 0 \0D\0A#endif\0D\0A//**********************************************************************************************\0D\0A\0D\0A#define FOVY 45.f\0D\0A#define NEAR_PLANE 0.001f\0D\0A#define FAR_PLANE 1000.0f\0D\0A#define HitDistanceOnMiss 0\0D\0A#define SAMPLER_FILTER D3D12_FILTER_ANISOTROPIC\0D\0A\0D\0A#ifdef HLSL\0D\0Atypedef uint NormalDepthTexFormat;\0D\0A#else\0D\0A#define COMPACT_NORMAL_DEPTH_DXGI_FORMAT DXGI_FORMAT_R32_UINT\0D\0A#endif\0D\0A\0D\0Anamespace ReduceSumCS {\0D\0A\09namespace ThreadGroup {\0D\0A\09\09enum Enum { Width = 8, Height = 16, Size = Width * Height, NumElementsToLoadPerThread = 10 };\09\0D\0A\09}\0D\0A}\0D\0A\0D\0Anamespace AtrousWaveletTransformFilterCS {\0D\0A    namespace ThreadGroup {\0D\0A        enum Enum { Width = 16, Height = 16, Size = Width * Height };\0D\0A    }\0D\0A}\0D\0A\0D\0Anamespace DefaultComputeShaderParams {\0D\0A    namespace ThreadGroup {\0D\0A        enum Enum { Width = 8, Height = 8, Size = Width * Height };\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.hlsli\22\0D\0Atypedef UINT Index;\0D\0A#else\0D\0Ausing namespace DirectX;\0D\0A\0D\0Atypedef UINT Index;\0D\0A#endif\0D\0A\0D\0Astruct Ray\0D\0A{\0D\0A    XMFLOAT3 origin;\0D\0A    XMFLOAT3 direction;\0D\0A};\0D\0A\0D\0A// GBuffer data collected during pathtracing \0D\0A// for subsequent Ambient Occlusion ray trace pass and denoising.\0D\0Astruct AmbientOcclusionGBuffer\0D\0A{\0D\0A    float tHit;\0D\0A    XMFLOAT3 hitPosition;           // Position of the hit for which to calculate Ambient coefficient.\0D\0A    UINT diffuseByte3;              // Diffuse reflectivity of the hit surface.\0D\0A    // TODO: RTAO pipeline uses 16b encoded normal, therefore same bit enconding could be applied here \0D\0A    //  to lower the struct's size and potentially improve Pathtracer's perf without much/any quality loss in RTAO.\0D\0A    //  Furthermore, _encodedNormal below could use lower bit range too.\0D\0A    XMFLOAT2 encodedNormal;         // Normal of the hit surface. \0D\0A\0D\0A    // Members for Motion Vector calculation.\0D\0A    XMFLOAT3 _virtualHitPosition;   // virtual hitPosition in the previous frame.\0D\0A                                    // For non-reflected points this is a true world position of a hit.\0D\0A                                    // For reflected points, this is a world position of a hit reflected across the reflected surface \0D\0A                                    //   ultimately giving the same screen space coords when projected and the depth corresponding to the ray depth.\0D\0A    XMFLOAT2 _encodedNormal;        // surface normal in the previous frame\0D\0A};\0D\0A\0D\0A\0D\0Astruct PathtracerRayPayload\0D\0A{\0D\0A    UINT rayRecursionDepth;\0D\0A    XMFLOAT3 radiance;              // TODO encode\0D\0A    AmbientOcclusionGBuffer AOGBuffer;\0D\0A};\0D\0A\0D\0Astruct ShadowRayPayload\0D\0A{\0D\0A    float tHit;         // Hit time <0,..> on Hit. -1 on miss.\0D\0A};\0D\0A\0D\0Astruct AtrousWaveletTransformFilterConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    float depthWeightCutoff;\0D\0A    bool usingBilateralDownsampledBuffers;\0D\0A\0D\0A    BOOL useAdaptiveKernelSize;\0D\0A    float kernelRadiusLerfCoef;\0D\0A    UINT minKernelWidth;\0D\0A    UINT maxKernelWidth;\0D\0A\0D\0A    float rayHitDistanceToKernelWidthScale;\0D\0A    float rayHitDistanceToKernelSizeScaleExponent;\0D\0A    BOOL perspectiveCorrectDepthInterpolation;\0D\0A    float minVarianceToDenoise;\0D\0A\0D\0A    float valueSigma;\0D\0A    float depthSigma;\0D\0A    float normalSigma;\0D\0A    UINT DepthNumMantissaBits;\0D\0A};\0D\0A\0D\0Astruct CalculateVariance_BilateralFilterConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    float normalSigma;\0D\0A    float depthSigma;\0D\0A\0D\0A    BOOL outputMean;\0D\0A    BOOL useDepthWeights;\0D\0A    BOOL useNormalWeights;\0D\0A    UINT kernelWidth;\0D\0A\0D\0A    UINT kernelRadius;\0D\0A    float padding[3];\0D\0A};\0D\0A\0D\0Astruct CalculateMeanVarianceConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    UINT kernelWidth;\0D\0A    UINT kernelRadius;\0D\0A\0D\0A    BOOL doCheckerboardSampling;\0D\0A    BOOL areEvenPixelsActive;\0D\0A    UINT pixelStepY;\0D\0A    float padding;\0D\0A};\0D\0A\0D\0Astruct RayGenConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    BOOL doCheckerboardRayGeneration;\0D\0A    BOOL checkerboardGenerateRaysForEvenPixels;\0D\0A    \0D\0A    UINT seed;\0D\0A    UINT numSamplesPerSet;\0D\0A    UINT numSampleSets;\0D\0A    UINT numPixelsPerDimPerSet;\0D\0A};\0D\0A\0D\0Astruct SortRaysConstantBuffer\0D\0A{\0D\0A    XMUINT2 dim;\0D\0A    BOOL useOctahedralRayDirectionQuantization;\0D\0A    // Depth for a bin within which to sort further based on direction.\0D\0A    float binDepthSize;\0D\0A};\0D\0A\0D\0Anamespace SortRays {\0D\0A    namespace ThreadGroup {\0D\0A        enum Enum { Width = 64, Height = 16, Size = Width * Height };\0D\0A    }\0D\0A\0D\0A    namespace RayGroup {\0D\0A        enum Enum { NumElementPairsPerThread = 4, Width = ThreadGroup::Width, Height = NumElementPairsPerThread * 2 * ThreadGroup::Height, Size = Width * Height };\0D\0A    }\0D\0A#ifndef HLSL\0D\0A    static_assert( RayGroup::Width <= 64 \0D\0A                && RayGroup::Height <= 128\0D\0A                && RayGroup::Size <= 8192, \22Ray group dimensions are outside the supported limits set by the Counting Sort shader.\22);\0D\0A#endif\0D\0A}\0D\0A\0D\0Astruct PathtracerConstantBuffer\0D\0A{\0D\0A    XMMATRIX projectionToWorldWithCameraAtOrigin;\0D\0A    XMFLOAT3 cameraPosition;\0D\0A    BOOL     useBaseAlbedoFromMaterial;\0D\0A    XMFLOAT3 lightPosition;     \0D\0A    BOOL     useNormalMaps;\0D\0A    XMFLOAT3 lightColor;\0D\0A    float    defaultAmbientIntensity;\0D\0A\0D\0A    XMMATRIX prevFrameViewProj;\0D\0A    XMMATRIX prevFrameProjToViewCameraAtOrigin;\0D\0A    XMFLOAT3 prevFrameCameraPosition;\0D\0A    float    padding;\0D\0A\0D\0A\09float Znear;\0D\0A\09float Zfar;\0D\0A    UINT  maxRadianceRayRecursionDepth;\0D\0A    UINT  maxShadowRayRecursionDepth;\0D\0A\0D\0A};\0D\0A\0D\0Astruct RTAOConstantBuffer\0D\0A{\0D\0A    UINT seed;\0D\0A    UINT numSamplesPerSet;\0D\0A    UINT numSampleSets;\0D\0A    UINT numPixelsPerDimPerSet;\0D\0A\0D\0A    float maxAORayHitTime;             // Max AO ray hit time used for tMax in TraceRay.\0D\0A    BOOL approximateInterreflections;      // Approximate interreflections. \0D\0A    float diffuseReflectanceScale;         // Diffuse reflectance from occluding surfaces. \0D\0A    float minimumAmbientIllumination;      // Ambient illumination coef when a ray is occluded.\0D\0A\0D\0A    float maxTheoreticalAORayHitTime;  // Max AO ray hit time used in falloff computation accounting for\0D\0A                                       // exponentialFalloffMinOcclusionCutoff and maxAORayHitTime.    \0D\0A    BOOL useSortedRays;\0D\0A    XMUINT2 raytracingDim;\0D\0A\0D\0A    BOOL applyExponentialFalloff;     // Apply exponential falloff to AO coefficient based on ray hit distance.    \0D\0A    float exponentialFalloffDecayConstant;\0D\0A    BOOL doCheckerboardSampling;\0D\0A    BOOL areEvenPixelsActive;\0D\0A\0D\0A    UINT spp;\0D\0A    float padding[3];\0D\0A};\0D\0A\0D\0A \0D\0A// Final render output composition modes.\0D\0Aenum CompositionType {\0D\0A    PBRShading = 0,\0D\0A    AmbientOcclusionOnly_Denoised,\0D\0A    AmbientOcclusionOnly_RawOneFrame,\0D\0A    AmbientOcclusionAndDisocclusionMap,\0D\0A    AmbientOcclusionVariance,\0D\0A    AmbientOcclusionLocalVariance,\0D\0A    RTAOHitDistance,\0D\0A    NormalsOnly,\0D\0A    DepthOnly,\0D\0A    Albedo,\0D\0A    BaseMaterialAlbedo,\0D\0A    Count\0D\0A};\0D\0A\0D\0Anamespace TextureResourceFormatRGB\0D\0A{\0D\0A    enum Type {\0D\0A        R32G32B32A32_FLOAT = 0,\0D\0A        R16G16B16A16_FLOAT,\0D\0A        R11G11B10_FLOAT,\0D\0A        Count\0D\0A    };\0D\0A#ifndef HLSL\0D\0A    inline DXGI_FORMAT ToDXGIFormat(UINT type)\0D\0A    {\0D\0A        switch (type)\0D\0A        {\0D\0A        case R32G32B32A32_FLOAT: return DXGI_FORMAT_R32G32B32A32_FLOAT;\0D\0A        case R16G16B16A16_FLOAT: return DXGI_FORMAT_R16G16B16A16_FLOAT;\0D\0A        case R11G11B10_FLOAT: return DXGI_FORMAT_R11G11B10_FLOAT;\0D\0A        }\0D\0A        return DXGI_FORMAT_UNKNOWN;\0D\0A    }\0D\0A#endif\0D\0A}\0D\0A\0D\0Anamespace TextureResourceFormatR\0D\0A{\0D\0A    enum Type {\0D\0A        R32_FLOAT = 0,\0D\0A        R16_FLOAT,\0D\0A        R8_UNORM,\0D\0A        Count\0D\0A    };\0D\0A#ifndef HLSL\0D\0A    inline DXGI_FORMAT ToDXGIFormat(UINT type)\0D\0A    {\0D\0A        switch (type)\0D\0A        {\0D\0A        case R32_FLOAT: return DXGI_FORMAT_R32_FLOAT;\0D\0A        case R16_FLOAT: return DXGI_FORMAT_R16_FLOAT;\0D\0A        case R8_UNORM: return DXGI_FORMAT_R8_UNORM;\0D\0A        }\0D\0A        return DXGI_FORMAT_UNKNOWN;\0D\0A    }\0D\0A#endif\0D\0A}\0D\0A\0D\0A\0D\0Anamespace TextureResourceFormatRG\0D\0A{\0D\0A    enum Type {\0D\0A        R32G32_FLOAT = 0,\0D\0A        R16G16_FLOAT,\0D\0A        R8G8_SNORM,\0D\0A        Count\0D\0A    };\0D\0A#ifndef HLSL\0D\0A    inline DXGI_FORMAT ToDXGIFormat(UINT type)\0D\0A    {\0D\0A        switch (type)\0D\0A        {\0D\0A        case R32G32_FLOAT: return DXGI_FORMAT_R32G32_FLOAT;\0D\0A        case R16G16_FLOAT: return DXGI_FORMAT_R16G16_FLOAT;\0D\0A        case R8G8_SNORM: return DXGI_FORMAT_R8G8_SNORM;\0D\0A        }\0D\0A        return DXGI_FORMAT_UNKNOWN;\0D\0A    }\0D\0A#endif\0D\0A}\0D\0A\0D\0Astruct ComposeRenderPassesConstantBuffer\0D\0A{\0D\0A    CompositionType compositionType;\0D\0A    UINT isAOEnabled;\0D\0A    float RTAO_MaxRayHitDistance;\0D\0A    float defaultAmbientIntensity;\0D\0A    \0D\0A    BOOL variance_visualizeStdDeviation;\0D\0A    float variance_scale;\0D\0A    float padding[2];\0D\0A};\0D\0A\0D\0Astruct TextureDimConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    XMFLOAT2 invTextureDim;\0D\0A};\0D\0A\0D\0Astruct FilterConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    UINT step;\0D\0A    float padding;\0D\0A};\0D\0A\0D\0Astruct TemporalSupersampling_ReverseReprojectConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    XMFLOAT2 invTextureDim;\0D\0A\0D\0A    float depthSigma;\0D\0A    UINT DepthNumMantissaBits;      // Number of Mantissa Bits in the floating format of the input depth resources format.\0D\0A    BOOL usingBilateralDownsampledBuffers;\0D\0A    float padding;\0D\0A};\0D\0A\0D\0Astruct TemporalSupersampling_BlendWithCurrentFrameConstantBuffer\0D\0A{\0D\0A    float stdDevGamma;\0D\0A    BOOL clampCachedValues;\0D\0A    float clamping_minStdDevTolerance;\0D\0A    float padding;\0D\0A\0D\0A    float clampDifferenceToTsppScale;\0D\0A    BOOL forceUseMinSmoothingFactor;\0D\0A    float minSmoothingFactor;\0D\0A    UINT minTsppToUseTemporalVariance;\0D\0A\0D\0A    UINT blurStrength_MaxTspp;\0D\0A    float blurDecayStrength;\0D\0A    BOOL checkerboard_enabled;\0D\0A    BOOL checkerboard_areEvenPixelsActive;\0D\0A};\0D\0A\0D\0Astruct CalculatePartialDerivativesConstantBuffer\0D\0A{\0D\0A    XMUINT2 textureDim;\0D\0A    float padding[2];\0D\0A};\0D\0A\0D\0Astruct DownAndUpsampleFilterConstantBuffer\0D\0A{\0D\0A    XMFLOAT2 invHiResTextureDim;\0D\0A    XMFLOAT2 invLowResTextureDim;\0D\0A};\0D\0A\0D\0A// Grass Geometry\0D\0A#define N_GRASS_TRIANGLES 5\0D\0A#define N_GRASS_VERTICES 7\0D\0A#define MAX_GRASS_STRAWS_1D 100\0D\0Astruct GenerateGrassStrawsConstantBuffer_AppParams\0D\0A{\0D\0A    XMUINT2 activePatchDim; // Dimensions of active grass straws.\0D\0A    XMUINT2 maxPatchDim;    // Dimensions of the whole vertex buffer.\0D\0A\0D\0A    XMFLOAT2 timeOffset;\0D\0A    float grassHeight;\0D\0A    float grassScale;\0D\0A    \0D\0A    XMFLOAT3 patchSize;\0D\0A    float grassThickness;\0D\0A\0D\0A    XMFLOAT3 windDirection;\0D\0A    float windStrength;\0D\0A\0D\0A    float positionJitterStrength;\0D\0A    float bendStrengthAlongTangent;\0D\0A    float padding[2];\0D\0A};\0D\0A\0D\0Astruct GenerateGrassStrawsConstantBuffer\0D\0A{\0D\0A    XMFLOAT2 invActivePatchDim;\0D\0A    float padding1;\0D\0A    float padding2;\0D\0A    GenerateGrassStrawsConstantBuffer_AppParams p;\0D\0A};\0D\0A\0D\0A\0D\0A// Attributes per primitive type.\0D\0Astruct PrimitiveConstantBuffer\0D\0A{\0D\0A\09UINT     materialID;          \0D\0A    UINT     isVertexAnimated; \0D\0A    UINT     padding[2];\0D\0A};\0D\0A\0D\0Anamespace MaterialType {\0D\0A    enum Type {\0D\0A        Default,\0D\0A        Matte,      // Lambertian scattering\0D\0A        Mirror,     // Specular reflector that isn't modified by the Fresnel equations.\0D\0A        AnalyticalCheckerboardTexture\0D\0A    };\0D\0A}\0D\0A\0D\0Astruct PrimitiveMaterialBuffer\0D\0A{\0D\0A\09XMFLOAT3 Kd;\0D\0A\09XMFLOAT3 Ks;\0D\0A    XMFLOAT3 Kr;\0D\0A    XMFLOAT3 Kt;\0D\0A    XMFLOAT3 opacity;\0D\0A    XMFLOAT3 eta;\0D\0A    float roughness;\0D\0A    BOOL hasDiffuseTexture;\0D\0A    BOOL hasNormalTexture;\0D\0A    BOOL hasPerVertexTangents;\0D\0A    MaterialType::Type type;\0D\0A    float padding;\0D\0A};\0D\0A\0D\0Astruct AlignedUnitSquareSample2D\0D\0A{\0D\0A    XMFLOAT2 value;\0D\0A    XMUINT2 padding;  // Padding to 16B\0D\0A};\0D\0A\0D\0Astruct AlignedHemisphereSample3D\0D\0A{\0D\0A    XMFLOAT3 value;\0D\0A    UINT padding;  // Padding to 16B\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    XMFLOAT3 position;\0D\0A    XMFLOAT3 normal;\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalTextureTangent\0D\0A{\0D\0A\09XMFLOAT3 position;\0D\0A\09XMFLOAT3 normal;\0D\0A\09XMFLOAT2 textureCoordinate;\0D\0A\09XMFLOAT3 tangent;\0D\0A};\0D\0A\0D\0A// Ray types traced in this sample.\0D\0Anamespace PathtracerRayType {\0D\0A    enum Enum {\0D\0A        Radiance = 0,\09// ~ Radiance ray generating color and GBuffer data\0D\0A        Shadow,         // ~ Shadow/visibility rays\0D\0A        Count\0D\0A    };\0D\0A}\0D\0A\0D\0Anamespace RTAORayType {\0D\0A    enum Enum {\0D\0A        AO = 0,\09\0D\0A        Count\0D\0A    };\0D\0A}\0D\0A\0D\0A\0D\0Anamespace TraceRayParameters\0D\0A{\0D\0A    static const UINT InstanceMask = ~0;   // Everything is visible.\0D\0A    namespace HitGroup {\0D\0A        static const UINT Offset[PathtracerRayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            1, // Shadow ray\0D\0A        };\0D\0A\09\09static const UINT GeometryStride = PathtracerRayType::Count;\0D\0A    }\0D\0A    namespace MissShader {\0D\0A        static const UINT Offset[PathtracerRayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            1, // Shadow ray\0D\0A        };\0D\0A    }\0D\0A}\0D\0A\0D\0Anamespace RTAOTraceRayParameters\0D\0A{\0D\0A    static const UINT InstanceMask = ~0;   // Everything is visible.\0D\0A    namespace HitGroup {\0D\0A        static const UINT Offset[RTAORayType::Count] =\0D\0A        {\0D\0A            0, // AO ray\0D\0A        };\0D\0A        // Since there is only one closest hit shader across shader records in RTAO, \0D\0A        // always access the first shader record of each BLAS instance shader record range.\0D\0A        static const UINT GeometryStride = 0;\0D\0A    }\0D\0A    namespace MissShader {\0D\0A        static const UINT Offset[RTAORayType::Count] =\0D\0A        {\0D\0A            0, // AO ray\0D\0A        };\0D\0A    }\0D\0A}\0D\0A\0D\0Astatic const XMFLOAT4 BackgroundColor = XMFLOAT4(0.79f, 0.88f, 0.98f, 1.0f);\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
