#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 092d6b5ce1e5d0d0d25f38c017d8e413.pdb
; shader hash: 092d6b5ce1e5d0d0d25f38c017d8e413
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.TemporalSupersampling_ReverseReprojectConstantBuffer
;       {
;
;           uint2 textureDim;                         ; Offset:    0
;           float2 invTextureDim;                     ; Offset:    8
;           float depthSigma;                         ; Offset:   16
;           uint DepthNumMantissaBits;                ; Offset:   20
;           int usingBilateralDownsampledBuffers;     ; Offset:   24
;           float padding;                            ; Offset:   28
;       
;       } cb;                                         ; Offset:    0
;
;   
;   } cb;                                             ; Offset:    0 Size:    32
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !51, globals: !143)
!1 = !DIFile(filename: "RTAO\5CShaders\5CDenoising\5CTemporalSupersampling_ReverseReprojectCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !26, !36, !43}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 128, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 128, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 128, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 128, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 128, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 128, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 96, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 96, size: 96, align: 32, elements: !18, templateParams: !23)
!18 = !{!19, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 96, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 96, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 96, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !20)
!25 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool4", file: !1, line: 43, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<bool, 4>", file: !1, line: 43, size: 128, align: 32, elements: !28, templateParams: !34)
!28 = !{!29, !31, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 43, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 43, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, line: 43, baseType: !30, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !27, file: !1, line: 43, baseType: !30, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!34 = !{!35, !14}
!35 = !DITemplateTypeParameter(name: "element", type: !30)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 99, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 99, size: 64, align: 32, elements: !38, templateParams: !41)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 99, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 99, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !{!24, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 126, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 126, size: 128, align: 32, elements: !45, templateParams: !50)
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !44, file: !1, line: 126, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !44, file: !1, line: 126, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !44, file: !1, line: 126, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !44, file: !1, line: 126, baseType: !20, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!50 = !{!24, !14}
!51 = !{!52, !61, !70, !71, !74, !77, !80, !94, !97, !118, !122, !125, !128, !131, !134, !137, !140}
!52 = !DISubprogram(name: "main", scope: !1, file: !1, line: 94, type: !53, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !57, templateParams: !60)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !{!13, !42}
!61 = !DISubprogram(name: "DecodeNormalDepth", linkageName: "\01?DecodeNormalDepth@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !62, file: !62, line: 438, type: !63, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DIFile(filename: "./RTAO/shaders\5CRaytracingShaderHelper.hlsli", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !66, !68}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 150, baseType: !8)
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !20)
!70 = !DISubprogram(name: "DecodeNormalDepth_N16D16", linkageName: "\01?DecodeNormalDepth_N16D16@@YAXIAIAV?$vector@M$02@@AIAM@Z", scope: !62, file: !62, line: 426, type: !63, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubprogram(name: "Unpack_R8G8B16_FLOAT", linkageName: "\01?Unpack_R8G8B16_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !62, file: !62, line: 393, type: !72, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!16, !65}
!74 = !DISubprogram(name: "Unpack_R8_FLOAT", linkageName: "\01?Unpack_R8_FLOAT@@YAMI@Z", scope: !62, file: !62, line: 364, type: !75, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!20, !65}
!77 = !DISubprogram(name: "DecodeNormal", linkageName: "\01?DecodeNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !62, file: !62, line: 344, type: !78, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!16, !36}
!80 = !DISubprogram(name: "BilateralResampleWeights", linkageName: "\01?BilateralResampleWeights@@YA?AV?$vector@M$03@@MV?$vector@M$02@@V1@Y03V2@V?$vector@M$01@@V?$vector@I$01@@Y03V?$vector@H$01@@3@Z", scope: !1, file: !1, line: 41, type: !81, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!43, !20, !16, !43, !83, !36, !55, !86, !36}
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 384, align: 32, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 4)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, align: 32, elements: !84)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 112, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 112, size: 64, align: 32, elements: !89, templateParams: !92)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !88, file: !1, line: 112, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !88, file: !1, line: 112, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!92 = !{!93, !42}
!93 = !DITemplateTypeParameter(name: "element", type: !15)
!94 = !DISubprogram(name: "IsWithinBounds", linkageName: "\01?IsWithinBounds@@YA_NV?$vector@H$01@@0@Z", scope: !62, file: !62, line: 62, type: !95, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!30, !87, !87}
!97 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@BilinearDepthNormal@CrossBilateral@@YA?AV?$vector@M$03@@MV?$vector@M$02@@V?$vector@M$01@@1V3@Y03V4@1UParameters@12@@Z", scope: !99, file: !98, line: 113, type: !101, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DIFile(filename: "RTAO\5CShaders\5CDenoising/CrossBilateralWeights.hlsli", directory: "")
!99 = !DINamespace(name: "BilinearDepthNormal", scope: !100, file: !98, line: 105)
!100 = !DINamespace(name: "CrossBilateral", scope: null, file: !98, line: 17)
!101 = !DISubroutineType(types: !102)
!102 = !{!43, !20, !16, !36, !36, !43, !83, !36, !103}
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parameters", scope: !99, file: !98, line: 107, size: 160, align: 32, elements: !104)
!104 = !{!105, !111}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !103, file: !98, line: 109, baseType: !106, size: 64, align: 32)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parameters", scope: !107, file: !98, line: 21, size: 64, align: 32, elements: !108)
!107 = !DINamespace(name: "Normal", scope: !100, file: !98, line: 19)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Sigma", scope: !106, file: !98, line: 23, baseType: !20, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "SigmaExponent", scope: !106, file: !98, line: 24, baseType: !20, size: 32, align: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !103, file: !98, line: 110, baseType: !112, size: 96, align: 32, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parameters", scope: !113, file: !98, line: 54, size: 96, align: 32, elements: !114)
!113 = !DINamespace(name: "Depth", scope: !100, file: !98, line: 52)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Sigma", scope: !112, file: !98, line: 56, baseType: !20, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "WeightCutoff", scope: !112, file: !98, line: 57, baseType: !20, size: 32, align: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "NumMantissaBits", scope: !112, file: !98, line: 58, baseType: !65, size: 32, align: 32, offset: 64)
!118 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@Bilinear@CrossBilateral@@YA?AV?$vector@M$03@@V?$vector@M$01@@@Z", scope: !119, file: !98, line: 92, type: !120, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!119 = !DINamespace(name: "Bilinear", scope: !100, file: !98, line: 89)
!120 = !DISubroutineType(types: !121)
!121 = !{!43, !36}
!122 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@Depth@CrossBilateral@@YA?AV?$vector@M$03@@MV?$vector@M$01@@V3@0UParameters@12@@Z", scope: !113, file: !98, line: 77, type: !123, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubroutineType(types: !124)
!124 = !{!43, !20, !36, !43, !36, !112}
!125 = !DISubprogram(name: "RemapDdxy", linkageName: "\01?RemapDdxy@@YA?AV?$vector@M$01@@MV1@0@Z", scope: !62, file: !62, line: 681, type: !126, isLocal: false, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false)
!126 = !DISubroutineType(types: !127)
!127 = !{!36, !20, !36, !36}
!128 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@Depth@CrossBilateral@@YA?AV?$vector@M$03@@MV?$vector@M$01@@V3@UParameters@12@@Z", scope: !113, file: !98, line: 61, type: !129, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!43, !20, !36, !43, !112}
!131 = !DISubprogram(name: "FloatPrecision", linkageName: "\01?FloatPrecision@@YAMMI@Z", scope: !62, file: !62, line: 300, type: !132, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!20, !20, !65}
!134 = !DISubprogram(name: "SmallestPowerOf2GreaterThan", linkageName: "\01?SmallestPowerOf2GreaterThan@@YAII@Z", scope: !62, file: !62, line: 281, type: !135, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!65, !65}
!137 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@Normal@CrossBilateral@@YA?AV?$vector@M$03@@V?$vector@M$02@@Y03V4@UParameters@12@@Z", scope: !107, file: !98, line: 28, type: !138, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!138 = !DISubroutineType(types: !139)
!139 = !{!43, !16, !83, !106}
!140 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@BilinearDepthNormal@CrossBilateral@@YA?AV?$vector@M$03@@MV?$vector@M$02@@V?$vector@M$01@@1V3@Y03V4@UParameters@12@@Z", scope: !99, file: !98, line: 130, type: !141, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!141 = !DISubroutineType(types: !142)
!142 = !{!43, !20, !16, !36, !36, !43, !83, !103}
!143 = !{!144, !148, !154, !159, !160, !162, !164, !169, !170, !172, !175, !176, !177, !180, !184, !185, !186, !187, !190, !194, !195, !196, !198, !202, !206, !207, !222, !224, !226, !228, !230, !232}
!144 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", scope: !145, file: !146, line: 16, type: !147, isLocal: true, isDefinition: true, variable: float -1.000000e+00)
!145 = !DINamespace(name: "RTAO", scope: null, file: !146, line: 14)
!146 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!148 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !149, file: !150, line: 506, type: !151, isLocal: true, isDefinition: true)
!149 = !DINamespace(name: "TraceRayParameters", scope: null, file: !150, line: 504)
!150 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !153, line: 20, baseType: !65)
!153 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!154 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !155, file: !150, line: 508, type: !156, isLocal: true, isDefinition: true)
!155 = !DINamespace(name: "HitGroup", scope: !149, file: !150, line: 507)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, align: 32, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 2)
!159 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !155, file: !150, line: 513, type: !151, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !161, file: !150, line: 516, type: !156, isLocal: true, isDefinition: true)
!161 = !DINamespace(name: "MissShader", scope: !149, file: !150, line: 515)
!162 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !163, file: !150, line: 526, type: !151, isLocal: true, isDefinition: true)
!163 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !150, line: 524)
!164 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !165, file: !150, line: 528, type: !166, isLocal: true, isDefinition: true)
!165 = !DINamespace(name: "HitGroup", scope: !163, file: !150, line: 527)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32, align: 32, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 1)
!169 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !165, file: !150, line: 534, type: !151, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !171, file: !150, line: 537, type: !166, isLocal: true, isDefinition: true)
!171 = !DINamespace(name: "MissShader", scope: !163, file: !150, line: 536)
!172 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !150, line: 544, type: !173, isLocal: true, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !153, line: 17, baseType: !43)
!175 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !145, file: !146, line: 15, type: !147, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !145, file: !146, line: 16, type: !147, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariable(name: "g_inCurrentFrameNormalDepth", linkageName: "\01?g_inCurrentFrameNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 21, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<unsigned int>", file: !1, line: 21, size: 64, align: 32, elements: !2, templateParams: !179)
!179 = !{!13}
!180 = !DIGlobalVariable(name: "g_inCurrentFrameLinearDepthDerivative", linkageName: "\01?g_inCurrentFrameLinearDepthDerivative@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 22, type: !181, isLocal: false, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 22, size: 96, align: 32, elements: !2, templateParams: !182)
!182 = !{!183}
!183 = !DITemplateTypeParameter(name: "element", type: !37)
!184 = !DIGlobalVariable(name: "g_inReprojectedNormalDepth", linkageName: "\01?g_inReprojectedNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 23, type: !178, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariable(name: "g_inTextureSpaceMotionVector", linkageName: "\01?g_inTextureSpaceMotionVector@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 24, type: !181, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariable(name: "g_inCachedNormalDepth", linkageName: "\01?g_inCachedNormalDepth@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 25, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariable(name: "g_inCachedValue", linkageName: "\01?g_inCachedValue@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 26, type: !188, isLocal: false, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 26, size: 64, align: 32, elements: !2, templateParams: !189)
!189 = !{!24}
!190 = !DIGlobalVariable(name: "g_inCachedTspp", linkageName: "\01?g_inCachedTspp@@3V?$Texture2D@V?$vector@I$01@@@@A", scope: !0, file: !1, line: 27, type: !191, isLocal: false, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<unsigned int, 2> >", file: !1, line: 27, size: 96, align: 32, elements: !2, templateParams: !192)
!192 = !{!193}
!193 = !DITemplateTypeParameter(name: "element", type: !56)
!194 = !DIGlobalVariable(name: "g_inCachedValueSquaredMean", linkageName: "\01?g_inCachedValueSquaredMean@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 28, type: !188, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariable(name: "g_inCachedRayHitDepth", linkageName: "\01?g_inCachedRayHitDepth@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 29, type: !188, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariable(name: "g_outCachedTspp", linkageName: "\01?g_outCachedTspp@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 32, type: !197, isLocal: false, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 32, size: 32, align: 32, elements: !2, templateParams: !179)
!198 = !DIGlobalVariable(name: "g_outReprojectedCachedValues", linkageName: "\01?g_outReprojectedCachedValues@@3V?$RWTexture2D@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 33, type: !199, isLocal: false, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<unsigned int, 4> >", file: !1, line: 33, size: 128, align: 32, elements: !2, templateParams: !200)
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "element", type: !5)
!202 = !DIGlobalVariable(name: "g_outDebug1", linkageName: "\01?g_outDebug1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 35, type: !203, isLocal: false, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 35, size: 128, align: 32, elements: !2, templateParams: !204)
!204 = !{!205}
!205 = !DITemplateTypeParameter(name: "element", type: !44)
!206 = !DIGlobalVariable(name: "g_outDebug2", linkageName: "\01?g_outDebug2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 36, type: !203, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UTemporalSupersampling_ReverseReprojectConstantBuffer@@@@A", scope: !0, file: !1, line: 38, type: !208, isLocal: false, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TemporalSupersampling_ReverseReprojectConstantBuffer>", file: !1, line: 38, size: 32, align: 32, elements: !2, templateParams: !209)
!209 = !{!210}
!210 = !DITemplateTypeParameter(name: "T", type: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "TemporalSupersampling_ReverseReprojectConstantBuffer", file: !150, line: 354, size: 256, align: 32, elements: !212)
!212 = !{!213, !215, !217, !218, !219, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "textureDim", scope: !211, file: !150, line: 356, baseType: !214, size: 64, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMUINT2", file: !153, line: 21, baseType: !55)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "invTextureDim", scope: !211, file: !150, line: 357, baseType: !216, size: 64, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT2", file: !153, line: 15, baseType: !36)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "depthSigma", scope: !211, file: !150, line: 359, baseType: !20, size: 32, align: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "DepthNumMantissaBits", scope: !211, file: !150, line: 360, baseType: !152, size: 32, align: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "usingBilateralDownsampledBuffers", scope: !211, file: !150, line: 361, baseType: !220, size: 32, align: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !153, line: 24, baseType: !15)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !211, file: !150, line: 362, baseType: !20, size: 32, align: 32, offset: 224)
!222 = !DIGlobalVariable(name: "ClampSampler", linkageName: "\01?ClampSampler@@3USamplerState@@A", scope: !0, file: !1, line: 39, type: !223, isLocal: false, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 39, size: 32, align: 32, elements: !2)
!224 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !150, line: 544, type: !225, isLocal: false, isDefinition: true)
!225 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !173, size: 32, align: 4, offset: 96)
!226 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !150, line: 544, type: !227, isLocal: false, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !173, size: 32, align: 4, offset: 64)
!228 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !150, line: 544, type: !229, isLocal: false, isDefinition: true)
!229 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !173, size: 32, align: 4, offset: 32)
!230 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !150, line: 544, type: !231, isLocal: false, isDefinition: true)
!231 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !173, size: 32, align: 4)
!232 = !DIGlobalVariable(name: "srcIndexOffsets", linkageName: "\01?srcIndexOffsets@?1??main@@YAXV?$vector@I$01@@@Z@3QBV?$vector@H$01@@B.v", scope: !52, file: !1, line: 117, type: !233, isLocal: false, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 256, align: 32, elements: !84)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!235 = !{i32 2, !"Dwarf Version", i32 4}
!236 = !{i32 2, !"Debug Info Version", i32 3}
!237 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
