#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: e9001d89550ec1f487ceb24373310067.pdb
; shader hash: e9001d89550ec1f487ceb24373310067
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer cb
; {
;
;   struct cb
;   {
;
;       struct struct.TemporalSupersampling_BlendWithCurrentFrameConstantBuffer
;       {
;
;           float stdDevGamma;                        ; Offset:    0
;           int clampCachedValues;                    ; Offset:    4
;           float clamping_minStdDevTolerance;        ; Offset:    8
;           float padding;                            ; Offset:   12
;           float clampDifferenceToTsppScale;         ; Offset:   16
;           int forceUseMinSmoothingFactor;           ; Offset:   20
;           float minSmoothingFactor;                 ; Offset:   24
;           uint minTsppToUseTemporalVariance;        ; Offset:   28
;           uint blurStrength_MaxTspp;                ; Offset:   32
;           float blurDecayStrength;                  ; Offset:   36
;           int checkerboard_enabled;                 ; Offset:   40
;           int checkerboard_areEvenPixelsActive;     ; Offset:   44

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !29)
!1 = !DIFile(filename: "RTAO\5CShaders\5CDenoising\5CTemporalSupersampling_BlendWithCurrentFrameCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 42, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 42, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 38, type: !18, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !22, templateParams: !26)
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !{!27, !28}
!27 = !DITemplateTypeParameter(name: "element", type: !24)
!28 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!29 = !{!30, !34, !41, !46, !47, !49, !51, !56, !57, !59, !62, !63, !64, !67, !76, !77, !88, !90, !93, !94, !95, !96, !97, !101, !102, !121, !123, !125, !127}
!30 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", scope: !31, file: !32, line: 16, type: !33, isLocal: true, isDefinition: true, variable: float -1.000000e+00)
!31 = !DINamespace(name: "RTAO", scope: null, file: !32, line: 14)
!32 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRTAO/Shaders/RTAO.hlsli", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!34 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !35, file: !36, line: 506, type: !37, isLocal: true, isDefinition: true)
!35 = !DINamespace(name: "TraceRayParameters", scope: null, file: !36, line: 504)
!36 = !DIFile(filename: "C:\5CUsers\5Cuser\5CDesktop\5CDirectX-Graphics-Samples\5CSamples\5CDesktop\5CD3D12Raytracing\5Csrc\5CD3D12RaytracingRealTimeDenoisedAmbientOcclusion\5CRaytracingHlslCompat.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !39, line: 20, baseType: !40)
!39 = !DIFile(filename: "./SampleCore/shaders\5CHlslCompat.hlsli", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 41, baseType: !24)
!41 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !42, file: !36, line: 508, type: !43, isLocal: true, isDefinition: true)
!42 = !DINamespace(name: "HitGroup", scope: !35, file: !36, line: 507)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, align: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 2)
!46 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !42, file: !36, line: 513, type: !37, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !48, file: !36, line: 516, type: !43, isLocal: true, isDefinition: true)
!48 = !DINamespace(name: "MissShader", scope: !35, file: !36, line: 515)
!49 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@RTAOTraceRayParameters@@3IB", scope: !50, file: !36, line: 526, type: !37, isLocal: true, isDefinition: true)
!50 = !DINamespace(name: "RTAOTraceRayParameters", scope: null, file: !36, line: 524)
!51 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@RTAOTraceRayParameters@@3QBIB", scope: !52, file: !36, line: 528, type: !53, isLocal: true, isDefinition: true)
!52 = !DINamespace(name: "HitGroup", scope: !50, file: !36, line: 527)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, align: 32, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 1)
!56 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@RTAOTraceRayParameters@@3IB", scope: !52, file: !36, line: 534, type: !37, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@RTAOTraceRayParameters@@3QBIB", scope: !58, file: !36, line: 537, type: !53, isLocal: true, isDefinition: true)
!58 = !DINamespace(name: "MissShader", scope: !50, file: !36, line: 536)
!59 = !DIGlobalVariable(name: "BackgroundColor", scope: !0, file: !36, line: 544, type: !60, isLocal: true, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !39, line: 17, baseType: !4)
!62 = !DIGlobalVariable(name: "RayHitDistanceOnMiss", linkageName: "\01?RayHitDistanceOnMiss@RTAO@@3MB", scope: !31, file: !32, line: 15, type: !33, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariable(name: "InvalidAOCoefficientValue", linkageName: "\01?InvalidAOCoefficientValue@RTAO@@3MB", scope: !31, file: !32, line: 16, type: !33, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariable(name: "g_inCurrentFrameValue", linkageName: "\01?g_inCurrentFrameValue@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 20, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 20, size: 64, align: 32, elements: !2, templateParams: !66)
!66 = !{!13}
!67 = !DIGlobalVariable(name: "g_inCurrentFrameLocalMeanVariance", linkageName: "\01?g_inCurrentFrameLocalMeanVariance@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 21, type: !68, isLocal: false, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 21, size: 96, align: 32, elements: !2, templateParams: !69)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "element", type: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 64, size: 64, align: 32, elements: !72, templateParams: !75)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !71, file: !1, line: 64, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !71, file: !1, line: 64, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!75 = !{!13, !28}
!76 = !DIGlobalVariable(name: "g_inCurrentFrameRayHitDistance", linkageName: "\01?g_inCurrentFrameRayHitDistance@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 22, type: !65, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "g_inReprojected_Tspp_Value_SquaredMeanValue_RayHitDistance", linkageName: "\01?g_inReprojected_Tspp_Value_SquaredMeanValue_RayHitDistance@@3V?$Texture2D@V?$vector@I$03@@@@A", scope: !0, file: !1, line: 23, type: !78, isLocal: false, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<unsigned int, 4> >", file: !1, line: 23, size: 160, align: 32, elements: !2, templateParams: !79)
!79 = !{!80}
!80 = !DITemplateTypeParameter(name: "element", type: !81)
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 40, size: 128, align: 32, elements: !82, templateParams: !87)
!82 = !{!83, !84, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !81, file: !1, line: 40, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !81, file: !1, line: 40, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !81, file: !1, line: 40, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !81, file: !1, line: 40, baseType: !24, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!87 = !{!27, !14}
!88 = !DIGlobalVariable(name: "g_inOutValue", linkageName: "\01?g_inOutValue@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 25, type: !89, isLocal: false, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 25, size: 32, align: 32, elements: !2, templateParams: !66)
!90 = !DIGlobalVariable(name: "g_inOutTspp", linkageName: "\01?g_inOutTspp@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 26, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 26, size: 32, align: 32, elements: !2, templateParams: !92)
!92 = !{!27}
!93 = !DIGlobalVariable(name: "g_inOutSquaredMeanValue", linkageName: "\01?g_inOutSquaredMeanValue@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 27, type: !89, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "g_inOutRayHitDistance", linkageName: "\01?g_inOutRayHitDistance@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 28, type: !89, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "g_outVariance", linkageName: "\01?g_outVariance@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 29, type: !89, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "g_outBlurStrength", linkageName: "\01?g_outBlurStrength@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 30, type: !89, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariable(name: "g_outDebug1", linkageName: "\01?g_outDebug1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 32, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 32, size: 128, align: 32, elements: !2, templateParams: !99)
!99 = !{!100}
!100 = !DITemplateTypeParameter(name: "element", type: !5)
!101 = !DIGlobalVariable(name: "g_outDebug2", linkageName: "\01?g_outDebug2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 33, type: !98, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "cb", linkageName: "\01?cb@@3U?$ConstantBuffer@UTemporalSupersampling_BlendWithCurrentFrameConstantBuffer@@@@A", scope: !0, file: !1, line: 35, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TemporalSupersampling_BlendWithCurrentFrameConstantBuffer>", file: !1, line: 35, size: 32, align: 32, elements: !2, templateParams: !104)
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "T", type: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "TemporalSupersampling_BlendWithCurrentFrameConstantBuffer", file: !36, line: 365, size: 384, align: 32, elements: !107)
!107 = !{!108, !109, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "stdDevGamma", scope: !106, file: !36, line: 367, baseType: !8, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "clampCachedValues", scope: !106, file: !36, line: 368, baseType: !110, size: 32, align: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !39, line: 24, baseType: !15)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "clamping_minStdDevTolerance", scope: !106, file: !36, line: 369, baseType: !8, size: 32, align: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !106, file: !36, line: 370, baseType: !8, size: 32, align: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "clampDifferenceToTsppScale", scope: !106, file: !36, line: 372, baseType: !8, size: 32, align: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "forceUseMinSmoothingFactor", scope: !106, file: !36, line: 373, baseType: !110, size: 32, align: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "minSmoothingFactor", scope: !106, file: !36, line: 374, baseType: !8, size: 32, align: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "minTsppToUseTemporalVariance", scope: !106, file: !36, line: 375, baseType: !38, size: 32, align: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "blurStrength_MaxTspp", scope: !106, file: !36, line: 377, baseType: !38, size: 32, align: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "blurDecayStrength", scope: !106, file: !36, line: 378, baseType: !8, size: 32, align: 32, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "checkerboard_enabled", scope: !106, file: !36, line: 379, baseType: !110, size: 32, align: 32, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "checkerboard_areEvenPixelsActive", scope: !106, file: !36, line: 380, baseType: !110, size: 32, align: 32, offset: 352)
!121 = !DIGlobalVariable(name: "BackgroundColor.1", linkageName: "BackgroundColor.1", scope: !0, file: !36, line: 544, type: !122, isLocal: false, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !60, size: 32, align: 4, offset: 32)
!123 = !DIGlobalVariable(name: "BackgroundColor.2", linkageName: "BackgroundColor.2", scope: !0, file: !36, line: 544, type: !124, isLocal: false, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !60, size: 32, align: 4, offset: 64)
!125 = !DIGlobalVariable(name: "BackgroundColor.3", linkageName: "BackgroundColor.3", scope: !0, file: !36, line: 544, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !60, size: 32, align: 4, offset: 96)
!127 = !DIGlobalVariable(name: "BackgroundColor.0", linkageName: "BackgroundColor.0", scope: !0, file: !36, line: 544, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !60, size: 32, align: 4)
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
